#define _CRT_SECURE_NO_WARNINGS     // Для работы функции "scanf", чтобыы программа не выдавала ошибку;
#include <stdio.h>
#include <string.h>                 // Бибилиотека для работы функции "strlen";
#include <locale.h>                 // Для вывода символов на русском языке;
#include <windows.h>                // Библиотека для ввода/вывода в функции "scanf" русских символов;

#define DENSITY 62.4                // Директива препроцессора. Вместо имени "DENSITY" в коде прописывется константа "62.4";
#define PRAISE "является химическим элементом таблицы Менделеева"      //Директива препроцессора. Вместо имени "PRAISE" в коде подставится символьная строка, без ковычек;
#define PI 3.14159
#define WEIGHT 62.0

#define BEEP '\a'                       // При применении макроса "BEEP" в функции "printf" раздасться звуковое обовещение;
#define TEE 'T'                         // При применении макроса "TEE" в функции "printf" выведется символ "Т";
#define ESC '\033'                      // При применении макроса "ESC" в функции "printf" выведется символ управляющей последовательности "ESC";
#define OOPS "Теперь вы сделали это"    // При применении макроса "OOPS" в функции "printf" выведется строка символов;

#define BOOK "Война и мир"

//#define TOES = 20                       // Лучше макросу не присваивать константу в таком виде, т.к. если в коде применит математическое выражене, 
                                        // может получить что-то вроде digits = finger + TOES (digits + = 20);

int main()
{
    setlocale(LC_ALL, "RUS");       // Для ввода/вывода на консоле русских символов;
    SetConsoleCP(1251);             // Настройка ввода на кириллицу;
    SetConsoleOutputCP(1251);       // Настройка вывода на кириллицу;

    float weight, volume;
    int size, letters;
    char name[40];                  // Массив для имени, до 40 символов;

/*    printf("Здравствуйте! Как вас зовут?\n");
    scanf("%s", name);              // Для массива символов & не нужен. Спецификатор "%s" для ввода/вывода строки. Если ввести имя и еще фамилию, программа будет работать некорректно, т.к. фамилия перейдет на следующую функцию "scanf";
    printf("%s, сколько вы весите в фунтах?\n", name);  // Спецификатор "%s" для ввода/вывода строки (в данном случае имени);
    scanf("%f", &weight);           // Важно: %f для float и символ &;

    size = sizeof(name);            // Переменной "size" присвоится значение "40". Размер всего массива (40 байт);
    letters = strlen(name);         // Переменной "letters", с помощью функции "strlen" присвоится количество букв, из которых состоит имя. Количество реально введенных букв;
    volume = weight / DENSITY;      // Вычисление объема. Вместо имени константы "DENSITY" подставляется значение "62.4" ;

    printf("Хорошо, %s, ваш объем составляет %2.2f кубических футов.\n", name, volume);     /* Вместо спецификатора "%s" подставялется строка из символов(в данном случае подставится имя).
                                                                                               Вместо спецификатора "%2.2f" подставится результат переменной "volume", 
                                                                                               при этом первая "2" это минимальная ширина всего поля. Если всё число (с точкой и хвостом) уже занимает 4 символа (например, 1.23), а указано 2, 
                                                                                               то пробелов не будет вообще. Пробелы появятся, только если число окажется короче этой цифры, например "1"
                                                                                            */
/*    printf("К тому же ваше имя состоит из %d букв,\n", letters);                            // Вместо спецификатора "%d" выведетсяя число, т.е. из скольки букв состоит имя;
    printf("и мы располагаем %d байтами для его сохранения.\n", size);                      // Вместо спецификатора "%d" выведетсяя число, т.е. какое значение присвоено переменной "size";
*/
    // Следующий код:
    
/*    char name[40];                                                                          // Для массива "name" выделено "40" байт. Массив может содержать до "40" символов, включая символа окончания строки "\0", который на монитор не выводится, он автоматически ставится после последнего символа;
    printf("Какой химический элемент знаете? \n");
    scanf("%s", name);              // При использовании спецификатора "%s", символ "&" перед переменной не нужен. Если в функции "scanf" ввести два или более слов, то потом при вызове функции "printf" выведетсятолько первое слово, т.е. если встроке встречается пробел, то уже следующие символы отрезаются;
    printf("Верно, %s, %s. \n\n", name, PRAISE);        // Вместо первого "%s" символьна строка (т.е. слово), вместо вторго "%s" вместо макроса подставится строка;
*/
// Следующий код:

/*   char name[40];
    printf("Какой химический элемент знаете? \n");
    scanf("%s", name);
    printf("Верно, %s, %s. \n\n", name, PRAISE);
    printf("Название элемента состоит из %zd символов и занимает %zd ячеек памяти. \n", strlen(name), sizeof name); // Функция "strlen" выдает количество символов, включая знаки препинания, пробелы. Количество байт до нулевого символа;
                                                                                                                    // Функция "sizeof" выдает сколько байт занимает массив "name" (в данном случае "40");
    printf("Подтверждающая фраза состоит из %zd символов, \n", strlen(PRAISE));               // Функция "strlen" выдает количество символов, включая знаки препинания, пробелы. Количество байт до нулевого символа;
    printf("и занимает %zd ячеек памяти. \n", sizeof PRAISE);                                 // Функция "sizeof" выдает количество символов на едиицу больше, т.к. учитывает символ окнчания строки "\0". Количество байт с нулевым символом;
*/  
// Следующий код:

/*   float area, circum, radius;
    printf("Каков радиус вашей пиццы? \n");
    scanf("%f", &radius);
    area = PI * radius * radius;
    circum = 2.0 * PI * radius;
    printf("Основные параметры Вашей пиццы:\n");                      
    printf("Длина окружности %1.2f, площадь %1.2f. \n", circum, area);       // Спецификатор "%1.2f" - "1" - сколько пробелом перед первой цифрой числа, "2" - сколько знаков после запятой;
*/
// Следующий код:

/*    const int MONTH = 12;                       // С помощью модификатора "const" созается символическая константа "MONTH" со значение "12". Эта значение нельзя изменить, оно постояно;
    printf("%d месяцев в году. \n\n", MONTH);
*/
// Следующий код:

/*   int voltage = 380;
    float power = 4.6;
    int current = 12;
    printf("Потребляемое напряжение электродвигателя %d вольт, мощность %.2f ватт. \n", voltage, power);
    printf("Электродвигатель вести %.0f кг. \n", WEIGHT);
    printf("Двигатель набирает мало оборотов. \n");
    printf("Замер тока показал %d ампер, при номинальном значении %d ампер. Новый стоит около 1240%c. \n\n", current / 2, current, '$'); // Символ "$" хоть и не объявлен, но допустимо его прописсать, как аргумент в функции "printf";
*/
// Следующий код:
/*    float cost = 12.99;
    float perсent = 80.0;
    printf("Данный экземпляр книги \"%s\" стоит $%.2f. \n", BOOK, cost);
    printf("Это %.f%% от цены в прайс-листе. \n\n", perсent);
*/




    return 0;
}