#include <stdio.h>
#include <math.h>
#include <locale.h>
#include <Windows.h>

#define ROWS 6		// Вложенный цикл;
#define CHARS 10	// Вложенный цикл;

// #define SIZE 10	// Массив с циклами;
#define PAR 72		// Массив с циклами;

#define SIZE 8		// Для счета четных чисел;

// double power(double n, int p);		// Прототип функции. Возведение числа в целые степени;

int main(void)
{
	setlocale(LC_ALL, "RUS");
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);

	// Суммирует целые числа, вводимы  интерактивном режиме:
/*	long num;
	long sum = 0L;				// "0L" - дает понять компилятору, что значение типа "long", а не по умолчаниютипа "int". И компилятор выделит нужный объем в памяти для хранения данного значения; 
	int status;

	printf("Введите целое число для последующего суммирования ");
	printf("(или q для завершения программы): ");
	status = scanf_s("%d", &num);
	while (status == 1)
	{
		sum = sum + num;
		printf("Введите следующее число (или q для завершения программы): ");
		status = scanf_s("%d", &num);
	}
	printf("Сумма введеных целых чисел равна %ld. \n", sum);
*/
	// Когда цикл завершается:
/*	int n = 5;
	while (n++ < 7)					// Завершится после того как переменная "n" станет равна "7";
	{
		printf("n = %d \n", n);
		n++;
		printf("Теперь n = %d \n", n);
	}
	printf("Цикл завершен. \n");
*/
	// Когда цикл не закончится:
/*	int n = 0;
	while(n < 3)					// Данный цикл будет бесконечен, т.к. составной оператор не взят в фигурные скобки "{}";
		printf("n равно %d \n", n);	// Ниже операторы уже не выполят действия;
		n++;
	printf("Это все, что делает данная программа. \n");
*/
	// ";" в конце проверки цикла:
/*	int n = 0;
	while (n++ < 3);					// Данный цикл выполнитя один раз, т.к. вконце стоит ";" является оператором;
		printf("n равно %d \n", n);		// И данный оператор выполнится один раз. Для лучшего восприятия такого лучше ";" ставить на следующей строке;
	printf("Это все, что делает данная программа. \n");
*/
	// Сравнение чисел с плавающей запятой:
/*	const double ANSWER = 3.14159;
	double response;

	printf("Каково значение числа pi? \n");
	scanf_s("%lf", &response);
	while (fabs(response - ANSWER) > 0.0001)		// Функция "fabs" (от floating-point absolute) — она берет модуль (абсолютное значение) числа, то есть отбрасывает минус, если он есть;
	{												// Пока разница между ответом пользователя и правильным числом больше, чем "0.0001" — считай ответ неверным, операторы цикла выполнятся;
		printf("Введите значение еще раз. \n");		// По логике получается, когда рузультат сравнения окажется меньше "0.0001", блок операторов пропустится, т.е. ответ более менее точен;
		scanf_s("%lf", &response);					// Если больше, то по логике ответ не верный, блок операторов цикла выполнят действие;
	}												// Функция "fabs" применяется для более точного сравнения если значение не целое, занчение "0.0001" может быть еще меньше или больше; 
	printf("Достаточно близко! \n");				// Функция "fabs" находится в библиотеке "math.h";
*/
	// Истинные и ложные значения в языке С:
/*	int true_val, false_val;
	true_val = (10 > 2);							// Переменной присвоится значение истины - "1";
	false_val = (10 == 2);							// Переменной присвоится значение ложь - "0";
	printf("true = %d; false = %d \n", true_val, false_val);
*/
	// Какие значения являются истинными?:
/*	int n = 3;
	while (n)										// Когда переменная достигнет значения "0", то выражение в цикле будет ложь и оператор цикла пропустится, произойдет выход из цикла;
		printf("%2d является истинным \n", n--);
	printf("%2d является ложным \n\n", n);
	n = -3;										
	while (n)										// Когда переменная достигнет значения "0", то выражение в цикле будет ложь и оператор цикла пропустится, произойдет выход из цикла;
		printf("%2d является истинным \n", n++);
	printf("%2d является ложным \n\n", n);
*/
	// Неправильное применене операции =:
/*	long num;
	long sum = 0L;				// "0L" - дает понять компилятору, что значение типа "long", а не по умолчаниютипа "int". И компилятор выделит нужный объем в памяти для хранения данного значения; 
	int status;

	printf("Введите целое число для последующего суммирования ");
	printf("(или q для завершения программы): ");
	status = scanf_s("%d", &num);														// Если введена цифра, то эта цифра попадает в буфер обмена данными, компилятор преобразует в двоичный код, буфер тем самы очищается;
	while (status = 1)																	// Если введена буква, не число, то функция, ожидая число, увидет букву в буфере и выдаст на выходе "0", а буква в буфере останется. И так будет происходить при следующих итерациях, т.е. цикл будет бесконечен;
	{
		sum = sum + num;
		printf("Введите следующее число (или q для завершения программы): ");
		status = scanf_s("%d", &num);
	}
	printf("Сумма введеных целых чисел равна %ld. \n", sum);
*/
	// Использование переменной типа _Bool:
/*	long num;
	long sum = 0L;
	_Bool input_is_good;											// "_Bool" - тип данных, которыйимеет только два значения "1" - истина т "0" - ложь.
	printf("Введите целое число для последующего суммирования ");	// Также можно применить библиотеку "stdbool.h", в котором "bool" сделан псевдонимом "_Bool",
	printf("(или q для завершения программы): ");					// в котором определены две константы "true" ("1") и "false" ("0");
	input_is_good = (scanf_s("%ld", &num) == 1);					// Переменной "input_is_good" писваивается тип "_Bool";
	while (input_is_good)											// В итоге в проверке будет четко "1" или "0";
	{
		printf("Введите целое число для последующего суммирования ");
		printf("(или q для завершения программы): ");
		input_is_good = (scanf_s("%ld", &num) == 1);
	}
	printf("Сумма введеных целых чисел равна %ld. \n", sum);
*/
	// Цикл со счетчиком:
/*	const int NUMBER = 22;
	int count = 1;
	while (count <= NUMBER)					// Сообщение выведется 22 раза;
	{										// Счетчик с применением цикла "while" необходимо, чтобы значение операнда менялось, либо в блоке операторов, либо в проверке выражения цикла; 
		printf("Выполянется программа! \n");
		count++;
	}
*/
	// Цикл for со счетчиком:
/*	const int NUMBER = 22;
	int count;
	for (count = 1; count <= NUMBER; count++)		// Операция инкрементирования выполняется в конце каждой итерации цикла;
		printf("Выполянется программа! \n");		// Т.е. сначала пропечатается текст, только затем произойдет увеличение переменной "count";
*/
	// Использование цикла for для построения таблицы кубов:
/*	int num;
	printf("    n	  n в кубе \n");
	for (num = 1; num <= 6; num++)
		printf("%5d %5d \n", num, num * num * num);
*/
	// Декремента для реализации обратного отсчета:
/*	int secs;
	for (secs = 5; secs > 0; secs--)
		printf("%d секунд(ы)! \n", secs);
	printf("Ключ на зажигание! \n");
*/
	// Можно отсчитывать двойками, десятками и т.п.:
/*	int n;
	for (n = 2; n < 60; n = n + 13)		// Счет с интервалом "13";
		printf("%d \n", n);
*/
	// Можно делать подсчет по символам, а не по цифрам:
/*	char ch;
	for (ch = 'a'; ch <= 'z'; ch++)
		printf("Значение ASCII для %c равно %d \n", ch, ch);
*/
	// Можно сделать проверку в условии (сравнение значения в кубе):
/*	int num;
	for (num = 1; num * num * num <= 216; num++)
		printf("%5d \n", num);
*/
	// Проверка в процессе умножения переменной (вместо инкременты, допустим):
/*	double dept;
	for (dept = 100.0; dept < 150.0; dept = dept * 1.1)
		printf("Теперь ваша задолженность составляет %.2f. \n", dept);
*/
	// В цикле for в качестве выраженияможно применять любое допустимое выражение:
/*	int x;
	int y = 55;
	for (x = 1; y <= 75; y = (++x * 5) + 50)
		printf("%10d %10d \n", x, y);
*/
	// Можно оставить одно из выражений цикла for пустым, но при этом проверяемый операнд должен меняться:
/*	int ans, n;
	ans = 2;
	for (n = 3; ans <= 25; )
		ans = ans * n;
	printf("n = %d; ans = %d. \n", n, ans);
*/
	// Когда первое выражение можно не прописывать в цикле for, вместо нееможно применить функцию printf:
/*	int num = 0;
	for (printf("Продолжайте вводить числа! \n"); num != 6; )		// Когда введется значение "6", т.е. в результате проверки будет "0" - ложь, произойдет выход из цикла;
		scanf_s("%d", &num);
	printf("Вот то число, которое было нужно! \n");
*/
	// Еще проверка с циклом for:
/*	int n;
	for (n = 0; n < 10; n++)
		printf("%d, %d \n", n, n * 2 + 1);
*/
	// Цикл for, операция с запятой:
/*	const int FIRST_OZ = 46;	// Тариф;
	const int NEXT_OZ = 20;		// Тариф;
	int ounces, cost;
	printf(" унции тариф \n");
	for (ounces = 1, cost = FIRST_OZ; ounces <= 16; ounces++, cost += NEXT_OZ)
		printf("%5d  $%.2f \n", ounces, cost / 100.0);
*/
	// Очередность выполнения в вычислении:
/*	const int FIRST_OZ = 46;	// Тариф;
	const int NEXT_OZ = 20;		// Тариф;
	int ounces = 1, cost;
	ounces++, cost = ounces * FIRST_OZ;			// Сначала переменная "ounces" увеличится на "1", затем в следующем выражении переменная "ounces" будет уже увеличеная;
	printf("%5d  $%d \n", ounces, cost);		// В итоге получаем "ounces" = 2, "cost" = 92;
*/
	// Сумма последовательости:
/*	int t_ct;
	double time, power_of_2;
	int limit;
	printf("Введите желаемое количество элементов последовательности: ");
	scanf_s("%d", &limit);
	for (time = 0, power_of_2 = 1, t_ct = 1; t_ct <= limit;		// Равнозначно 1 + 1/2 + 1/4 + 1/8 + 1/16 + ... и т.д.;	
		t_ct++, power_of_2 *= 2.0)
	{
		time += 1.0 / power_of_2;			
		printf("время = %.25f, когда количество элементов = %d. \n", time, t_ct);
	}
*/
	//	Цикл с постусловием do while:
/*	const int secret_cod = 13;
	int cod_entered;
	do
	{
		printf("Для входа в программу нужен пароль, \n");
		printf("введите серетный код: \n");
		scanf_s("%d", &cod_entered);
	} while (cod_entered != secret_cod);
	printf("Вы вошли в программу! \n");
*/
	// Аналогичная программа, только с циклом while:
/*	const int secret_cod = 13;
	int cod_entered;
	printf("Для входа в программу нужен пароль, \n");
	printf("введите серетный код: \n");
	scanf_s("%d", &cod_entered);
	while (cod_entered != secret_cod)
	{
		printf("Для входа в программу нужен пароль, \n");
		printf("введите серетный код: \n");
		scanf_s("%d", &cod_entered);
	}
	printf("Вы вошли в программу! \n");
*/
	// Вложенные циклы:
/*	int row;
	char ch;
	for (row = 0; row < ROWS; row++)
	{
		for (ch = 'A'; ch < ('A' + CHARS); ch++)
			printf("%c", ch);
		printf("\n");
	}
*/
	// Применение зависимых вложенных циклов:
/*	const int ROW_S = 6;
	const char CHAR_S = 6;
	int row;
	char ch;
	for (row = 0; row < ROW_S; row++)
	{
		for (ch = ('A' + row); ch < ('A' + CHAR_S); ch++)
			printf("%c", ch);
		printf("\n");
	}
*/
	// Приминение массива с циклами:
/*	int index, score[SIZE] = {0};
	int sum = 0;
	float average;
	printf("Введите %d результатов игры в гольф : \n", SIZE);
	for (index = 0; index < SIZE; index++)
		scanf_s("%d", &score[index]);
	printf("Введены следующие результаты: \n");
	for (index = 0; index < SIZE; index++)
		printf("%5d", score[index]);
	printf("\n");
	for (index = 0; index < SIZE; index++)
		sum += score[index];
	average = (float)sum / SIZE;
	printf("Сумма результатов = %d, среднее значение = %.2f \n", sum, average);
	printf("Полученный гандикап равен %.0f. \n", average - PAR);
*/
	// Возведения числа в целые степени. Цикл использованием функции:
/*	double x, xpow;
	int exp;
	printf("Введите число и целую положительную степень,");
	printf(" в которую\nчисло будет возведено. Для завершения прораммы");
	printf(" введите q. \n");
	while (scanf_s("%lf%d", &x, &exp) == 2)		// Сравнение счисло "2", т.к. функция "scanf_s" если примет два числовых значения будет равнятся двум;
	{											// Если одно из значений будет не числовым, то "scanf_s" выдаст "1" и блок операторов цикла пропустятся;
		xpow = power(x, exp);
		printf("%.3g в степени %d равно %.5g \n", x, exp, xpow);		// Спецификатор "%.5g" сам выберет в каком виде вывести значение. Число "5" - это сколько занчений будет после запятой;
		printf("Введите следующую пару чисел или q для завершения. \n");
	}
	printf("Надеемся, что вы оценили это упражнение -- до свидания. \n");
*/
	// Просто выражения для проверки истинности (из вопроссов для самоконтроля):
//	x > 5

//	scanf_s("%lf", &x) != 1);
	
//	x == 5;

//	scanf_s("%d", &x) == 1);

//	x != 5;

//	x >= 20;

/*	int i, j, list[10] = {0};
	for (i = 0; i < 10; i++)
	{
		list[i] = 2 * i + 3;			// В массиве первое значение будет равным "3";
		for (j = 0; j <= i; j++)
			printf("%3d", list[j]);		// Этаже "3" выводится на печать. В предыдущей записи была переменная-индекс "i", здесь "j", но эти переменные имеют доступ к одному и тому же массиву;
		printf("\n");
	}
*/
/*	char ch = '$';
	int count_1, count_2;
	for (count_1 = 0; count_1 < 4; count_1++)
	{
		for (count_2 = 0; count_2 <= 8; count_2++)
			printf("%c", ch);
		printf("\n");
	}
*/
	// scanf работа с массивом:
/*	double mint[10];
	scanf_s("%lf", &mint);			// Это адрес расположения (начала) массива, т.е. первого элемента массива, такая запись некорректна, лучше записать "scanf_s("%lf", &mint[0])" или просто "mint" (без амперсанда);
	scanf_s("%lf", &mint[2]);		// Это адрес расположения значения массива;
	scanf_s("%lf", mint[2]);		// При такой записи программа уйдет в ошибку!!! В таком случае если, например записать значение "20", то получается, что мы пытаемся записать в адрес "20" какое то значение, но этот адре уже занят другим значением;
*/									// К тому же эта область может быть зарезервированна системой;
	// 	Счет четных чисел с одним циклом:
/*	int by_twos[SIZE] = {0};
	int index;
	for (index = 0; index < SIZE; index++)
	{
		by_twos[index] = 2 * index + 2;
		printf("%d ", by_twos[index]);
	}
	printf("\n");
*/
	// 	Счет четных чисел с двумя циклами:
/*	int by_twos[SIZE] = {0};
	int index;
	for (index = 0; index < SIZE; index++)
		by_twos[index] = 2 * (index + 1);
	for (index = 0; index < SIZE; index++)
		printf("%d ", by_twos[index]);
	printf("\n");
*/
	// Функция printf в цикле for:
/*	int k;
	for (k = 1, printf("%d: Hi! \n", k); printf("k = %d \n", k),
		k * k < 26; k += 2, printf("Now k is %d \n", k))
		printf("k is %d in the loop. \n", k);		// Когда "k" станет равно "7", проверка даст "ложь" и тело цикла (printf("k is %d in the loop")) не выполнится ни разу. Выполнится только надпись "Now k is 7" и "k = 7" внутри заголовка for;
*/
	return 0;
}

/*
double power(double n, int p)			// Определение функции;
{
	double pow = 1;
	int i;
	for (i = 1; i <= p; i++)
		pow *= n;
	return pow;							// Возврат значения фунцкции;
}
*/

	// Определение функции, когда принимается переменная одного типа, а возвращается другого типа:
/* long count(int volume)
	{
		return (long)volume * volume;
	}
*/