#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
#include <locale.h>
#include <windows.h>

int main(void)
{
	setlocale(LC_ALL, "RUS");
	SetConsoleCP(1251);             // Настройка ввода на кириллицу;
	SetConsoleOutputCP(1251);       // Настройка вывода на кириллицу;

	int age;
	float assets;
	char pet[30];
	char text = 'F';

	unsigned width, precision;
	int number = 354;
	double weight = 216.8;

	int n;

/*	printf("Введите информацию о соем возрасте, сумме в банке, любимое животное. \n");
	scanf("%d %f", &age, &assets);						// Запятую между спецификатрами не стивим;
	scanf("%s", pet);									// В этом примере возраст и сумму можно вводить через "Enter" или через пробел, сумму и строку только через пробел;
	printf("%d, $%.2f, %s \n\n", age, assets, pet);		// При спецификаторе "%s" после пробела, прекращает читать следующие символы, т.е. выведет, например только слово;
	printf("%c \n", text);								// Спецификатор "%с" в функции "printf" выведется только символ. "%с" читает все, и пробелы, и табуляции, и переносна следующую строку, в отличии от "%s";
*/

	// С пробелами:
/*	printf("Введите информацию о соем возрасте, сумме в банке, любимое животное. \n");
	scanf("%d %f", &age, &assets);						// Запятую между спецификатрами не стивим;
	scanf("%c", pet);									// В этом примере возраст и сумму можно вводить через "Enter" или через пробел, сумму и строку только через пробел;
	printf("  %d,		$%.2f,			%s \n\n", age, assets, pet);
*/
	// Поле переменной ширины:
/*	printf("Введите ширину поля: \n");
	scanf("%d", &width);
	printf("Значение равно: %*d: \n", width, number);			// Вместо "*" подставляется значение переменной "width" и это значение будет являться ширинной поля (могут появиться отступы слева);
	printf("Теперь введите ширину и точность: \n");
	scanf("%d %d", &width, &precision);
	printf("Вес = %*.*f \n\n", width, precision, weight);		// Вместо первой "*" подставляется значение переменной "width" и это значение будет являться ширинной поля (могут появиться отступы слева).
																// Вместо второго "*" подставляется значение переменной "precision", которое укажет число знаков после запятой;
*/
	// Пропуск чисел в потоке:
/*	printf("Введите 3 целых числа: \n");
	scanf("%*d %*d %d", &n);									// В функции "scanf" символ "*" играет роль пропуска вывода чисел или символов, если стоит вместе со спецификатором;
	printf("Последним целым числом было %d. \n\n", n);			// После ввода чисел выведется то значение, где отсутствовал символ "*". В данном случает это 3 число;
*/
	// Следующий код:
/*	int dolmatinec;
	scanf("%d", &dolmatinec);

	float num1, num2;
	scanf("%f %E", &num1, &num2);

	
	char name1[20];
	scanf("%s", name1);
	printf("Паста %s. \n", name1);

	char name2[20];
	int number1;
	scanf("%s %d", name2, &number1);
	printf("%s %d \n", name2, number1);

	int number2;
	scanf("%*s %d", &number2);		// Символ "*" в спецификаторе "%s" проигнорирует написанное слово;
	printf("%d \n\n", number2);
*/


	

	return 0;
}