#include <stdio.h>
#include <stdint.h>
#include <locale.h>
#include <stddef.h>							// Содержит определение "ptrdiff_t";

#define VALUE 8516.586
#define TEXT "Форматирование предложения"
#define NUMBER 65724

// #define ( {					// Имя макроса нначинается толкько с букв или нижнего подчеркивания и состоит из них, а также цифр, из символов давать имена недопустимо;
// #define ) }					// Имя макроса нначинается толкько с букв или нижнего подчеркивания и состоит из них, а также цифр, из символов давать имена недопустимо;

int main(void)
{
	setlocale(LC_ALL, "RUS");

	float a = 26.485;
	float A = 124.973;
	char ch = 'G';
	int decimal = 84;
	double expon = 236.86e14;
	float EXPON = 14.96E10;
	float drob = 74.05;
	double d = 4869.875289425;
	double D = 54.258963147;
	int octa = 24;
	void *ptr = &decimal;
	char stroka[] = "Добрый вечер";
	unsigned u = 5468;
	short sh = 58;
	short num = 345;
	short mnum = -65724;
	float n1 = 3.0;
	double n2 = 3.0;
	long n3 = 2000000000;
	long n4 = 1234567890;
	int bph2o = 212;
	int rv;
	int number = 249;
	intmax_t big_val = 9223372036854775807LL;			// Максимум для 64 бит;
	uintmax_t u_big_val = 18446744073709551615ULL;
	double d_pi = 3.14159265358979323846;
	long double ld_pi = 3.14159265358979323846L; // Суффикс L обязателен для константы;
	char text[] = "Программирование на C";

	int numbers[10] = { 0 };
	int* ptr1 = &numbers[2]; // Указатель на 3-й элемент
	int* ptr2 = &numbers[8]; // Указатель на 9-й элемент


	printf("%a: число с плавающей запятой, шестнадцатеричной цифры и р-запись. \n", a);
	printf("%A: число с плавающей запятой, шестнадцатеричной цифры и P-запись. \n", A);
	printf("%c: вывод символа. \n", ch);
	printf("%d: вывод десятичного числа. \n", decimal);
	printf("%e: вывод числа с плавающей запятой, экспоненциальное представление. \n", expon);
	printf("%E: вывод числа с плавающей запятой, экспоненциальное представление. \n", EXPON);
	printf("%f: вывод числа с плавающей запятой. \n", drob);
	printf("%g: в зависимости от значения использует спецификатор f или e. \n"														// Спецификатор "%g" считает только первые 6 цифр значащими, остальные отбрасывает, получится результат "4869.87". Если будет число "4869875.289425", то результат "4,86988e+06";
		   "Спецификатор е применяется если показатель степени меньше -4 либо больше или равен указанной точности. \n", d);			// Если будет число "4869875.289425", то результат "4,86988e+06";
	printf("%G: в зависимости от значения использует спецификатор f или E. \n"														// Спецификатор "%G" считает только первые 6 цифр значащими, остальные отбрасывает, получится результат " 54.259" (после округления 6 число "0" отбросится).
			"Спецификатор Е применяется если показатель степени меньше -4 либо больше или равен указанной точности. \n", D);		// Если будет число "5425896314.7", то результат "5.4259Е+09";
	printf("%i: вывод десятичного числа. \n", decimal);
	printf("%o: вывод числа без знака в восьмеричной форме. \n", octa);
	printf("%p: указатель. \n", ptr);
	printf("%s: вывод символьной строки. \n", stroka);
	printf("%u: вывод десятично целого числа без знака. \n", u);
	printf("%x: вывод шестнадцатеричного целого чиисла без знака, используются шестнадцатериччные цифры 0f.\n", decimal);
	printf("%X: вывод шестнадцатеричного целого чиисла без знака, используются шестнадцатериччные цифры 0f.\n", octa);
	printf("%%: вывод знака процент. \n\n");

	// Модификаторы для спецификаторов:
	// Ширина поля целыми числами, флаги форматирования (пробелы), алгебраические знаки:
	// Тип int:
	printf("*%d*: без указания пробела. \n", decimal);
	printf("*%2d*: на выходе пробелов не будет, т.к. число занимает 2 пробела. \n", decimal);
	printf("*%10d*: получаем отступ слева 8 пробелов, еще 2 пробела забирает значение. \n", decimal);
	printf("*%-9d*: получаем 7 пробелов справа, 2 пробела занимает значение. \n", decimal);
	printf("%ld: как тип long, %9lu: как тип long и слева будет 5 отступов. \n\n", u, u);			// Тоже самое с модификатором "ll" ("%lld", "%12llu") тип long long;

	printf("*%x: шестнадцатеричный эквивалент, %X: шестнадцатеричный эквивалент, %#x: шестнадцатеричная форма*. \n", 77, 77, 77);
	printf("**%d**: без отступов, **% d**: с одним отступом, **  %d**: с двумя отступами, с алгебраическим знаком -. \n", 46, 46, -46);
	printf("**%4d**: 3 пробела перед числом, **%6.3d**: 2 нуля перед числом, 3 пробела перед значением, \n" 
			" **%05d**: 4 нуля перед числом, **%06.3d**: 2 нуля перед числом, 3 пробела перед значением. \n\n", 7, 7, 7, 7);

	// Тип short:
	printf("*%hu*: без уазания пробела, *%hx*: шестнадцатеричный эквивалент, *%5.3hd*: два отступа слева, еще 3 знимает значение, при этом первый знак 0.\n", sh, sh, sh);
	printf("*%2hu*: на выходе пробелов не будет, т.к. число занимает 2 пробела. \n", sh);
	printf("*%5hu*: получаем отступ слева 3 пробела, еще 2 пробела забирает значение. \n\n", sh);
	printf("num как тип short и тип unsigned short: %hd и %hu. \n", num, num);				// Некорректная запись, но диапазона типа "short" хватает, что со знаком спецификатор %hd, что без знака спецификатор %hu - программа работать будет;
	printf("-num как тип short и тип unsigned short: %hd и %hu. \n", mnum, mnum);			// Некорректная запись. 65724 в HEX - FFFFFFFFFFFEFF44 (8 байт), знаковый тип "short" ("%hd)" имеет 2 байта, плучается обрезка первых 6 байт, осталось FF44 (1111111101000100, первый знак переменной "-"), в результате значение "-188". Или можно представить - -65724 + 65536 = -188;
																							// Спецификатор "%hu" - беззнаковый тип "short" (2 байта) знак "-" уже отбрасывается, тоже происходит обрезка значения, получилось FF44 (1111111101000100), результат "65348". Программа будет рабать не корректно. Или можно представить - 65724 - 65536 = 188;
	printf("num как тип int и тип char: %d и %c. \n", num, num);							// Значение "345" в диапазон типа "int" помещается, программа будет работать корректно. Если применить спецификатор "%c" (тип "char", который имеет размер 1 байт), произойдет обрезка старших байтов (345 - 0х0159, останется 0х59 или 89). В результате вывдется символ согласно ASCII "Y";
	printf("NUMBER как тип int, short и char: %d, %hd, %c. \n\n", NUMBER, NUMBER, NUMBER);	// Значение "65724" в диапазон типа "int" помещается, программа будет работать корректно. Если применить специффикатор "hd" (тип "short", размером 2 байта), произойдет обрезка старших байтов (65724 - 0х0100ВС, останется 0х00ВС или 188).
																							// Если применить спецификатор "%c" (тип "char", который имеет размер 1 байт), произойдет обрезка старших байтов (65724 - 0х0100ВС, останется 0хВС или 188). В результате выводится символ ASCII "?", вернее компилятору неизветен такойд знака, т.е. знак не определен. Программа не будет корректно работать;

	// Тип unsigned char, signed char:
	printf("Как int равняется %d. \n", number);
	printf("Как char (hh) равняется %hhd: 249 это 0b000000011111001, старшие 2 байта обрежутся, останется 0b11111001, т.к. тип данных со знаком, то 8 бит единица это знак -. \n\n", number);
	printf("%hhu: в диапазон типа char помещается, %hhx: представление в шестнадцатеричной форме, %5.hhd - знаковый тип char, в диапазон не помещется (результат со знаком -), слева отступа, еще 2 отступа занимает результат. \n\n", number, number, number);


	// Ширина поляс с числами с плавающей запятой, алгебраические знаки, пробелы, 
	printf("*%f: без модификатра.* \n", VALUE);
	printf("*%e: без модификатра.* \n", VALUE);
	printf("*%4.2f: отступ слева 4 пробела, но значение занимает больше, ширина автоматически будет больше. Округление до 2 значений после запятой*. \n", VALUE);
	printf("*%3.1f: отступ слева 3 пробела, но значение занимает больше, ширина автоматически будет больше. Округление до 1 значения после запятой*. \n", VALUE);
	printf("*%12.3f: отступ слева 4 пробела, остальные 8 - значение. 3 значения после запятой*. \n", VALUE);
	printf("*%15.3E: отступ слева 6 пробелов, остальные 9 - значение. Представление значения в экспоненциальной форме*. \n", VALUE);
	printf("*%+11.2f*: перед значением ставится алгебраический знак +. Отступ слева 3 пробела, остальные 8 - значение, включая знак +. Округление до 2 значений после запятой*. \n", VALUE);
	printf("*%012.2f: перед значением будет 5 нулей. Округление до 2 значений после запятой*. \n\n", VALUE);

	printf("Обычный double:    %.18f. \n", d_pi);
	printf("Длинный long double: %.18Lf. \n", ld_pi);
	printf("Длинный long double, отступы слева и 8 знаков после запятой: %28.8Lf. \n\n", ld_pi);

	// Форматирование строк:
	printf("[%2s]: строка выведется целиком, спецификатор расширяет поле автоматически, двойка здесь не играет роли. \n", TEXT);
	printf("[%30s]: строка выведется целиком, добавится 4 отступа слева. \n", TEXT);
	printf("[%30.4s]: выведутся первые 4 символа строки, добавится 26 отступов слева. \n", TEXT);
	printf("[%-30.6s]: выведутся первые 6 символов строки справа, добавятся 24 отступа справа. \n\n", TEXT);

	//  Определение сколько символов составляет строка:
	rv = printf("Вода закипает при %d градусах по Фаренгейту. \n", bph2o);
	printf("Функция printf() вывела %d символов. \n\n", rv);
	
	// Несогласование преобразования с плавающей запятой:
	printf("%.le, %.le, %.le, %.le. \n", n1, n2, n3, n4); // Для "n1", "n2" спецификатор подойжет - код корректный. А для "n3", "n4" ответ будет не корректен, спецификатор "%е" не используется для целочисленных констант;
	printf("%ld, %ld. \n", n3, n4);						  // В данной строке результат получится корректный;
	printf("%ld, %ld, %ld, %ld. \n\n", n1, n2, n3, n4);	  // Для чисел с плавающей запятой спецификатор "%ld", как и просто "%d" не используется, ответ будет ноль или вовсе непредсказуем. А для "n3", "n4" ответ будет хоть и будет корректен, но т.к. в функции прописанный неверные спецификаторы, вывод тоже может быть непредсказуем; 
	/* Для первых двух спецификаторов %e всё хорошо: они берут по 8 байт от n1 и n2.
	Для третьего %e функция снова забирает 8 байт.
	Но в очереди на этом месте лежит n3 (всего 4 байта)!
	Результат: printf берет 4 байта числа n3 и «склеивает» их со следующими 4 байтами, которые принадлежат числу n4.
	
	%ld (который хочет 4 байта) пытается прочитать n1 (3.0), которое занимает 8 байт: Число 3.0 в памяти выглядит как: 00 00 00 00 (первые 4 байта) и 40 08 00 00 (вторые 4 байта).
	Первый %ld забирает первые 4 байта - видит все нули - выводит 0. Второй %ld забирает оставшиеся 4 байта от того же самого числа n1 - видит 40 08 00 00 - в десятичной системе это 1074266112. 
	Главный вывод: Числа в компьютере — это просто последовательность битов. Спецификатор — это «трафарет». Если трафарет (%e — 8 байт) наложить на данные неправильного размера (long — 4 байта), 
	он захватит часть соседнего числа, и мы получим бессмысленный результат.
	*/

	// Вывод длинных строк:
	printf("Вот один из способов вывода ");
	printf("длинной строки. \n");
	printf("Вот второй способ вывода \
  длинной строки. \n");								// При таком виде использования с применением обратной наклоной черты, новая строка учитывает все пробелы, табуляции;
	printf("А вот самый новый способ вывода ");
	printf("длинной строки. \n\n");					// ANSI C

	// Передача значений типа intmax_t или uintmax_t:
	// Модификатор "j" автоматически определяет какой тип данных выбрать, что дает преимущество для ибежания ошибок при выборе спецификатора.
	printf("Знаковое max и дополнительными нулями слева: %.23jd. \n", big_val);
	printf("Беззнаковое max: %ju. \n", u_big_val);
	printf("В шестнадцатеричном виде и отступами слева: %20jx. \n\n", u_big_val);

	// Размер используется специально для типа "size_t":
	// Раньше приходилось гадать: использовать %u, %lu или %llu. Модификатор "z" решил эту проблему — он всегда выбирает правильный размер автоматически.
	// sizeof возвращает значение типа size_t
	// %zu — спецификатор для вывода size_t
	size_t length = strlen(text);						// "strlen" возвращает "size_t";
	printf("Длина строки: %zu символ. \n\n", length);
	printf("Размер типа double: %zu байт(а)\n", sizeof(d));
	printf("Размер типа int:    %zu байт(а)\n", sizeof(int));
	printf("Размер типа char:   %zu байт(а)\n", sizeof(char));

	// Модификатор "t" предназначен для вывода значений типа "ptrdiff_t".
	// "ptrdiff_t" — это специальный целочисленный тип со знаком, который используется для хранения разности между двумя указателями. 
	// Если вычесть один адрес из другого, результат будет иметь именно этот тип.
	 // Вычитаем указатели
	ptrdiff_t diff = ptr2 - ptr1;
	printf("Расстояние между элементами: %td. \n", diff);			// %td — для знакового ptrdiff_t
	printf("Если вычесть наоборот: %td. \n", ptr1 - ptr2);		
	printf("%tx — если хотитим увидеть разность в шестнадцатеричном виде. \n\n", diff);
	printf("Расстояние между элементами: %12ti, 11 отступов слева. \n", diff);

	return 0;
}