#include <stdio.h>
#include <inttypes.h>
#include <locale.h>

int main(void)
{
	setlocale(LC_ALL, "RUS");

	/* Переносимы типы данных: */
	int32_t me32;
	me32 = 26974831;
	/* 
	Также сущствуют идругие типы как uint8_t, int8_t, uint64_t и другие.
	Такие типы данных можно переносить смело из одной системы в дугую не опасаясь за точность работыпрограмы,
	в отличие от записи int, long, unsigned, т.к. при переносе из одой системы одной разрядности в другую другой разрядности,
	типы данных могут иметь разную битность (в одной системе int 32 бита, в другой 16 бит);
	*/

	printf("Сначала предположим, что int32_t является int: ");
	printf("me32 = %d \n", me32);
	printf("Далее не будем делать никаких предположений. \n");
	printf("Вместо этого воспользуемся \"макросом\" из файла inttypes.h: ");		
	printf("me32 = %"PRId32" \n", me32);	// Вместо макроса фиксированной точности PRId32 подставляется нужный спецификатор (%d). Применяется с заголовочным файлом "inttypes.h". 
											// Для вывода имен типа файлов в заголовочном файле "stdint.h", но он уже включен в файл "inttypes.h";							
	printf("me32 = %" "d" " \n", me32);		// Следующий шаг компилятор преобразует в такой вид запись. Тот же вывод, что запись выше;
	printf("me32 = %d \n\n", me32);			// При следующем шаге копилятор уже преобразует в такой вид зпись. В результате запись, как и выше в строках;

	float d = 99.44;						// По умолчанию константа с плавающей запятой. По умолчанию в Си вещественные числа без суффикса (как f) считаются типом double.

	float m = 0xC.1fp8;						// Присвоение переменной "m" значения 3103.00. "0xC - это шестнадцатеричное значение "12". "1f"  - это 1/16 + 15/256 (15/256 относится к "f"). "р8" - это 2 в 8 степени, т.е. 256.
											// В результате получаем выражение "(12 + 1/16 + 15/256) * 256 = 3103.00".
											// После "1" диапазон в шестнадцатеричной системе от "0 до F". Т.е. "от 0 до 16;

	float total = 410000.0;
	float bit = 4.82e8;						// 4.82*10 в 11 степени;
	float left = 6.26e-7;					// 6.26*10 в -7 степени;

	printf("%f может быть записан как %e. \n", total, total);										// Спецификатор "%f" для вывода значения с плавающей запятой (41000.000000). "%е" для вывода в експоненциальном представлении (4.100000е+05);
	printf("И его %a в шестнадцатиричной, представляющей степени 2, форме записи \n", total);		// "%а" для вывода в шестандцатиричной форме. 
	printf("%f может быть записан как %e. \n", bit, bit);											// При "%f" - 482000000.000000. Здесь с помощью спецификатора "%е" число в експоненциальной форме будет выглядеть 4.820000е+08;
	printf("%lf может быть записано как %le. \n\n", left, left);									// При "lf" - 0.000001. При "%le" - 6.260000е-07;

	/*
	Для представления числа в шестнадцатиричную форму:
	Делим число на 16 и записываем остатки: 
	(410000/16=25625), остаток 0
	(25625/16=1601), остаток 9
	(1601/16=100), остаток 1
	(100/16=6), остаток 4
	(6/16=0), остаток 6 
	Читаем снизу вверх: 0x64190. 
	В шестнадцатеричном виде это (6,4190 х 16 в степени 4)
	Поскольку в стандарте "p" означает степень двойки, пересчитываем: (16^{4}=(2^{4})^{4}=2^{16}).
	Получаем (6,4190 х 2^{16}).
	Сдвигаем запятую так, чтобы перед ней была единица (нормализация):
	(6,4190_{16}) в двоичном виде 0110.0100000110010000_{2} Чтобы получить 1.1001..., нужно сдвинуть запятую на 2 бита влево.
	При этом экспонента увеличивается на 2: (16+2=18).
	Теперь берем наше двоичное число 1.10010000011001... и снова группируем по 4 бита, чтобы вернуть в шестнадцатеричный вид: 
	1. (это наша единица перед точкой)
	1001 = 9
	0000 = 0
	0110 = 6
	0100 = 4 
	Получаем: 1.9064.Добавляем экспоненту: p+18. 
	Итог: (6.4190 х 2^{16}=1.9064 х 2^{18}). 
	*/

	float toobig = 3.4e38 * 100.0f;		// Присвоено слишком большое значение;
	printf("%e \n\n", toobig);			// На монитор выведется сообщение "inf" (infinity) бесконечность. Т.е. выход за пределы диапазона;

	/* Ошибка округления:*/
	float a, b;
	b = 20e20 + 1.0;
	a = b - 20e20;
	printf("%f \n\n", a);
	/*
	В результате получим зачение 40081754685440,000000, что далеко от истины, т.к. при присвоении переменной "b" пытаемся в числе изменить 21 знак.
	Функция "float" работает с точностью до 6...9 знака. А "double" до 15...17;
	*/
	
	/* Вывод размеров типов данных с помощью спецификатора "%zd" (sizeof): */
	printf("Тип char имеет размер %zd байт(ов).\n", sizeof(char));
	printf("Тип short имеет размер %zd байт(ов).\n", sizeof(short));
	printf("Тип int имеет размер %zd байт(ов).\n", sizeof(int));
	printf("Тип long имеет размер %zd байт(ов).\n", sizeof(long));
	printf("Тип long long имеет размер %zd байт(ов).\n", sizeof(long long));
	printf("Тип float имеет размер %zd байт(ов).\n", sizeof(float));
	printf("Тип double имеет размер %zd байт(ов).\n", sizeof(double));
	printf("Тип long double имеет размер %zd байт(ов).\n\n", sizeof(long double));
	/* При компиляции на мониторе будет виден размер типа данных. */

	float n = 100.f;		
	printf("%f значение с плавающей точкой. Суффикс \"f\" дает знать,\n ", n);
	printf("что переменной \"n\" будет присвоено значение с плавающей запятой. \n\n");

	/* Управляющая послледовательность: */
	float salary;
	printf("\aВведите желаемую сумму месячной зарплаты:");	// "\а" должен быть звуковой сигнал, далее текст;
	printf(" $__________\b\b\b\b\b\b\b");					// Далее с помощью "\b", которая 7 раз отступает влево, т.е. после знака "$" курсор установится после третьего подчеркивания;
	scanf_s("%f", &salary);									// И на месте четвертого подчеркивания будет мигать курсор на мониторе. Вводим значение, значение заменяет последующие курсоры, оставшиеся останутся;
	printf("\n\t$%.2f в месяц соответствует $%.2f в год.", salary, salary * 12);	// Дальше происходит перенос на начало следующей строки ("\n"). С помощью "\t" происходит одна табуляция, затем выводится введенная сумма (после точки два знака), дальше текст и сумма за год;
	printf("\rХхера се \n\n");								// И с помощью "\r" происходит возврат карретки в начало и пишется текст перед суммой (первой суммой); 

	/* Представление символа в разных формах: */
	char ch;
	ch = '\r';		// Присвоение символа управляющей последовательности;
	ch = 13;		// Присвоение символа в десятичной форме;
	ch = 015;		// Присвоение символа в восьмеричной форме;
	ch = 0x0D;		// Присвоение символа в шестандцатеричной форме;

	/* Просто задачка: */
	int legs, cows;
	printf("Скоолько коровьих ног вынасчитали? \n");
	scanf_s("%d", &legs);
	cows = legs / 4;
	printf("Отсюда следует, что есть %d коров. \n\n", cows);


	return 0;
}