// Использование массива структур:
/*
#pragma once
#define TSIZE	45					// Размер массива для хранения названия фильма;
#define	FMAX	5					// Максимальное количество фильмов;

struct film							// Структура типа film;	
{
	char title[TSIZE];				// Поле название фильма, которое должно быть не больше 44 символов, 45 символ - символ конца строки;
	int rating;						// Поле для рейтинга фильма;
};

char* s_gets(char* st, int n);		// Функция принимает адрес начала массива и размер массива, возвращает адрес на начало массива, т.е. вернется указатель на начало текста;
*/


// Динамическое выделение памяти для структуры:
/*
#pragma once
#define TSIZE	45					// Размер массива для хранения названия фильма;

struct film							// Структура типа film;	
{
	char title[TSIZE];				// Поле название фильма, которое должно быть не больше 44 символов, 45 символ - символ конца строки;
	int rating;						// Поле для рейтинга фильма;
};
*/


// Использование связанного списка структур:
/*
#define TSIZE 45

struct film							// Структура типа film;	
{
	char title[TSIZE];				// Поле название фильма, которое должно быть не больше 44 символов, 45 символ - символ конца строки;
	int rating;						// Поле для рейтинга фильма;
	struct film* next;				// У4казывает на следующую структуру в списке;
};

char* s_gets(char* st, int n);
*/


// Заголовочный файл для простого типа списка (абстрактный список данных):
/*
#ifndef FUNCTION_H_								// Если флаг FUNCTION_H_ еще НЕ создан (файл читается впервые), компилятор заходит внутрь;
#define FUNCTION_H_								// Создает флаг FUNCTION_H_. Теперь при повторном чтении файла компилятор увидит этот флаг и пропустит весь код до самого #endif;
#include <stdbool.h>

char* s_gets(char* st, int n);					// Функция для ввода текста;

// Объявление специфичные для программы:
#define TSIZE	45
struct film
{
	char title[TSIZE];
	int rating;
};
// Определение общих типов:
typedef struct film Item;						// Создем псевдоним Item на структуру типа film;

typedef struct node
{
	Item item;
	struct node* next;							// Указатель на структуру типа node;  
} Node;											// Создем псевдоним Node на структуру struct node;
typedef Node* List;								// Создаем новый тип данных List, который является псевдонимом для указателя Node*. List заменяет указатель на структуру Node*;
	
void showmovies(Item item);						// Функция принимает переменную item типа структуры Item (передается структура);
static void CopyToNode(Item item, Node* pnode);	// Функция принимает переменную item типа структуры Item (передается структура), принимает указатель pnode на переменную типа структуры Node (указатель на структуру). 
												// Модификатор static закрывает доступ к функции из любых внешних файлов (например, main.c), делая её доступной только внутри файла с её определением (list.c).

// Прототипы функций:
// предусловия: plist указывает на список
// постусловия: список инициализированный пустым содержимым
void InitializeList(List* plist);				// Функция принимает указатель plist на указатель List типа структуры node (указатель на адрес структуры);

// операция: определение, является ли список пустым, plist указывает на инициализированный список
// постусловия: функция возвращает значение True, если список пуст, и False в противном случае
bool ListIsEmpty(const List* plist);			// Функция принимает указатель plist на указатель List типа структуры node (указатель на адрес структуры), возвращает значение ложь или истина. Квалификатор const защищает адрес на структуру от случайных изменений;

// операция: определение, является ли список полным, plist указывает на инициализированный список
// постуслвоия: функция возвращает значение True, если список полон, и False в противном случае
bool ListIsFull(const List* plist);				// Функция принимает указатель plist на указатель List типа структуры node (указатель на адрес структуры), возвращает значение ложь или истина. Квалификатор const защищает адрес на структуру от случайных изменений;

// операция: определение количества элементов в списке, plist указывает на инициализированный список
// постуслвоия: функция возвращает число элементов в списке
unsigned int ListItemCount(const List* plist);	//  Функция принимает указатель plist на указатель List типа структуры node (указатель на адрес структуры), возвращает беззнаковое значение типа int. Квалификатор const защищает адрес на структуру от случайных изменений;

// операция: добавление элемента в конец списка
// предусловие: item - элемент, добавляемый в список, plist указывает на инициализированный список
// посусловие: если возможно, функция добавляет элемент в конец списка и возвращает значение True, в противном случае возвращает значение False;
bool AddItem(Item item, List* plist);			// Функция принимает переменную item типа структуры Item и указатель plist на указатель List типа структуры node (указатель на адрес структуры), возвращает значение ложь или истина;

// операция: применение функции к каждому элементу списка, plist указывает на инициализированный список
//			 pfun указывает на функцию, которая принимает  аргумент item и не имеет возвращаемого значения
// постусловия: функция, указанная pfun, выполнится один раз для кажого элемента в списке
void Traverse(const List* plist, void (*pfun)(Item item));	//  Функция принимает указатель plist на указатель List типа структуры node (указатель на адрес структуры), и указатель pfun, который может принять адрес любой функции, принимающей только аргумент типа Item item;

// операция: освобождение выделенной памяти, если она есть, plist указывает на инициализированный список
// постусловия: любая память выделенная для списка, освобождается, и список устанавливается в пустое состояние
void EmptyTheList(List* plist);					// Функция принимает указатель plist на указатель List типа структуры node (указатель на адрес структуры);

#endif											// Конец определения заголовочного файла. Защита от повторно включения;
*/


// Абстрактный тип данных для предоставления очереди:
/*
#ifndef FUNCTION_H_								// Если флаг FUNCTION_H_ еще НЕ создан (файл читается впервые), компилятор заходит внутрь;
#define FUNCTION_H_								// Создает флаг FUNCTION_H_. Теперь при повторном чтении файла компилятор увидит этот флаг и пропустит весь код до самого #endif;
#include <stdbool.h>

// typedef int Item;								// Для элемента очереди используем тип int. Созадаем тип данных Item типа int. Делается для того чтобы вместо int Item можно было заменить, например, на другой тип данных struct film Item. Затем в структуре где применяется этот ничего уже менять не нужно;

// ==================================================================//
// Еще программа абстрактный тип данных для предоставления очереди :
#define MIN_PER_HR	60.0				// Константа: количество минут в одном часе (нужна для перевода часов симуляции в минуты);

typedef struct item						
{
	long arrive;						// Время присоединения к очереди клиента;
	int processtime;					// Желаемое количество минут консультации;
} Item;									// Структура типа item применяется прсевдоним  Item;

bool newcustomer(double x);				// Имеется новый клиент? Функция принимает зачение типа double и возращает логическую 1 или логический 0;
Item customertime(long when);			// Установка параметров клиента. Функция принимает значение типа long и возвращает заполненную струкутру типа Item; 
// ==================================================================//

#define MAXQUEUE 10								// Максимальное вместимость очереди (клиентов);
typedef struct node								// Создаем структуру типа node;
{
	Item item;									// Поле переменной item типа Item. Item является псевдонимом типа int. В результате получаем простую переменную int item;  
	struct node* next;							// Создаем указатель next на структуру node. Этот указатель нужен для связки со следующей структурой, которая имеет теже поля, что текущая структура node;
} Node;											// Создем псевдоним Node структуры node;

typedef struct queue
{
	Node* front;								// Указатель на начало очереди. Указатель на структуру Node (псевдоним структуры node);
	Node* rear;									// Указатель на конец очереди. Указатель на структуру Node (псевдоним структуры node);
	int items;									// Переменная для количества элементов в очереди;
} Queue;										// Создем псевдоним Queue структуры queue;

// операция: инициализация очереди
// предусловие: pq указывает на очередь
// постусловие: очередь инициализирована пустым содержимым
void InitializeQueue(Queue* pq);				// Функция принимает указатель pq адрес на структуру Queue (псевдоним структуры queue);

// операция: проверка, полна ли очередь
// предусловие: pq указывает на ранее инициализированную очередь
// постусловие: возвращает True, если очередь полна, и False в противном случае
bool QueueIsFull(const Queue* pq);				// Функция принимает указатель pq адрес на структуру Queue (псевдоним структуры queue), спецификатор const защищает адрес от случайного изиенения;

// операция: проверка, пуста ли очередь
// предусловие: pq указывает на ранее инициализированную очередь
// постусловие: возвращает True, если очередь пуста, и False в противном случае
bool QueueIsEmpty(const Queue* pq);				// Функция принимает указатель pq адрес на структуру Queue (псевдоним структуры queue), спецификатор const защищает адрес от случайного изиенения;

// операция: определение количества элементов в очереди
// предусловие: pq указывает на ранее инициализированную очередь
// постусловие: возвращает количество элементов в очереди
int QueueItemCount(const Queue* pq);			// Функция принимает указатель pq адрес на структуру Queue (псевдоним структуры queue), спецификатор const защищает адрес от случайного изиенения;

// операция: добавление элемента в конец очереди
// предусловие: pq указывает на ранее инициализированную очередь, элемент должен быть помещен в конец очереди
// постусловие: если очередь не полна, элемент помещается в конец очереди и функция возвращает True,
//				в противном случае очередь остается неизменной и функция возвращает False
bool EnQueue(Item item, Queue* pq);				// Функция принимает переменную типа данных Item (принимает переменную item типа данных Item), и принимает указатель pq адрес на структуру Queue (псевдоним структуры queue);

// операция: удаление элемента из начала очереди
// предусловие: pq указывает на ранее инициализированную очередь
// постусловие: если очередь не пуста, элемент в начале очереди копируется в *pitem и удаляется из очереди,
//				и функция возвращает True; если операция опустошает очередь, очередь переустанавливается в пустое состояние.
//				Если очередь пуста с самого начала, она остается неизменной, и функция возвращает False
bool DeQueue(Item* pitem, Queue* pq);			// Функция принимает указатель pitem (адрес) на переменную типа Item и принимает указатель pq адрес на структуру Queue (псевдоним структуры queue);

// операция: опустошение очереди
// предусловие: pq указывает на ранее инициализированную очередь
// постусловие: очередь пуста
void EmptyTheQueue(Queue* pq);					// Функция принимает указатель pq адрес на структуру Queue (псевдоним структуры queue);

#endif
*/


// Двоичное дерево поиска:
/*
#ifndef FUNCTION_H_								// Если флаг FUNCTION_H_ еще НЕ создан (файл читается впервые), компилятор заходит внутрь;
#define FUNCTION_H_								// Создает флаг FUNCTION_H_. Теперь при повторном чтении файла компилятор увидит этот флаг и пропустит весь код до самого #endif;
#include <stdbool.h>

typedef struct item								// Создаем структуру типа item;
{
	char petname[20];							// Объявление строкового массива из 20 элементов;
	char petkind[20];							// Объявление строкового массива из 20 элементов;
} Item;											// Созадем структуру типа Item (псевдоним струткуры item);

#define MAXITEMS	10							// Максимальное количество животных в клубе;

typedef struct trnode							// Создаем структуру типа trnode;
{
	Item item;									// Объявление переменной item типа структуры Item;	
	struct trnode* left;						// Указатель на левое дерево. Указатель left на структуру типа trnode;
	struct trnode* right;						// Указатель на правое дерево. Указатель right на структуру типа trnode;
} Trnode;										// Создаем структуру типа Trnode (псевдоним структуры trnode);

typedef struct tree								// Объявление структуры типа tree;
{
	Trnode* root;								// Указатель на корень дерева. Указатель root на структуру типа Trnode;
	int size;									// Количество элементов в дереве. Переменная типа int;
} Tree;											// Создаем структуру типа Tree(псевдоним структуры tree);

// операция: инициализация дерева пустым содержимым
// предусловия: ptree указывает на дерево
// постусловие: дерево установлено в пустое состояние
void InitializeTree(Tree* ptree);				// Функция принимает указатель (адрес) ptree на структуру типа Tree;

// операция: Определение, является ли дерево пустым
// предусловия: ptree указывает на дерево
// постусловия: функция возвращает true, если дерево пустое, и false - в противном случае
bool TreeIsEmpty(const Tree* ptree);			// Функция принимает указатель (адрес) ptree на структуру типа Tree. Квалификатор const защищает от случайного изменения данных полей структуры. Возвращает логические 1 или 0;

// операция: определение, является ли дерево полным
// предусловия: ptree указывает на дерево
// постусловия: функция возвращает true, если дерево полное, и false - в противном случае 
bool TreeIsFull(const Tree* ptree);				// Функция принимает указатель (адрес) ptree на структуру типа Tree. Квалификатор const защищает от случайного изменения данных полей структуры. Возвращает логические 1 или 0;

// операция: определение количества элементов в дереве
// предусловия: ptree указывает на дерево
// постусловия: функция возвращает количество элементов в дереве
int TreeItemCount(const Tree* ptree);			// Функция принимает указатель (адрес) ptree на структуру типа Tree. Квалификатор const защищает от случайного изменения данных полей структуры. Возвращает значение типа int;

// операция: добавление элемента к дереву
// предусловия: pi - адрес добавляемого элемента, ptree указывает на инициализированное дерево
// постусловия: если возможно, функция добавляет элемент к дереву и возвращает true, в противном случае возвращает false
bool AddItem(const Item* pi, Tree* ptree);		// Функция принимает указатель (адрес) pi на структуру типа Item. Квалификатор const защищает от случайного изменения данных полей структуры. Принимает указатель (адрес) ptree на структуру типа Tree. Возвращает логические 1 или 0;

// операция: поиск элемента в дереве
// предусловия: pi указывает на элемент, ptree указывает на инициализированное дерево
// постусловия: функция возвращает true, если элемент присутствует в дереве, и false - в противном случае
bool InTree(const Item* pi, const Tree* ptree);	// Функция принимает указатель (адрес) pi на структуру типа Item и принимает указатель (адрес) ptree на структуру типа Tree. Квалификатор const защищает от случайного изменения данных полей структуры. Возвращает логические 1 или 0;

// операция: удаление элемента из дерева
// предусловия: pi - адрес удаляемого элемента, ptree указывает на инициализированное дерево
// постусловия: усли возможно, функция удаляет элемент из дерева и возвращает true, в противном случает возвращает false
bool DeleteItem(const Item* pi, Tree* ptree);	// Функция принимает указатель (адрес) pi на структуру типа Item. Квалификатор const защищает от случайного изменения данных полей структуры. Принимает указатель (адрес) ptree на структуру типа Tree. Возвращает логические 1 или 0;

// операция: применение указанной функции к кажому элементу в дереве
// предусловия: ptree указывает на дерево, pfun указывает на функцию, которая принимает аргумент на Item и не имеет возвращаемого значения
// постусловия: функция, указанная с помощью pfun, выполняется один раз для каждого элемента в дереве
void Traverse(const Tree* ptree, void(*pfun)(Item item));	// Функция принимает указатель (адрес) ptree на структуру типа Tree. Квалификатор const защищает от случайного изменения данных полей структуры. Принимает указатель (адрес) любой функции, которая принимает переменную item типа структуры Item; 

// операция: удаление всех элементов из дерева
// предусловия: ptree указывает на инициализированное дерево
// постусловия: дерево является пустым
void DeleteAll(Tree* ptree);					// Функция принимает указатель (адрес) ptree на структуру типа Tree;

#endif // FUNCTION_H_
*/

// Вопрос самоконтроля 5:
/*
// stack.h -- интерфейс стека 
#ifndef STACK_H_
#define STACK_H_

#include <stdbool.h>

// ЗДЕСЬ ВСТАВЬТЕ ТИП ЭЛЕМЕНТА 
// НАПРИМЕР, typedef int Item; 
typedef int Item;

#define MAXSTACK 100

typedef struct stack
{
	Item items[MAXSTACK]; // содержит сведения о стеке            
	int top;              // индекс первой пустой ячейки        
} Stack;

// операция:        инициализация стека                         
// предусловия:     ps указывает на стек                        
// постусловия:     стек инициализирован пустым значением       
void InitializeStack(Stack* ps);

// операция:        проверяет, является ли стек полным          
// предусловия:     ps указывает на ранее инициализированный стек 
// постусловия:     возвращает значение true, если стек полон,  
//                  иначе возвращает значение false             
bool FullStack(const Stack* ps);

// операция:        проверяет, является ли стек пустым          
// предусловия:     ps указывает на ранее инициализированный стек 
// постусловия:     возвращает значение true, если стек пуст,   
//                  иначе возвращает значение false             
bool EmptyStack(const Stack* ps);

// операция:        заталкивает элемент в стек                  
// предусловия:     ps указывает на ранее инициализированный стек 
//                  элемент должен помещаться в верхушку стека  
// постусловия:     если стек не полон, элемент помещается      
//                  в верхушку стека и функция возвращает       
//                  значение true; иначе стек остается         
//                  неизменным, а функция возвращает            
//                  значение false                              
bool Push(Item item, Stack* ps);

// операция:        удаляет элемент из верхушки стека           
// предусловия:     ps указывает на ранее инициализированный стек 
// постусловия:     если стек не пуст, элемент в верхушке       
//                  стека копируется в *pitem и удаляется       
//                  из стека, а функция возвращает              
//                  значение true; если операция                
//                  опустошает стек, стек                       
//                  переустанавливается в пустое состояние.     
//                  Если стек пуст с самого начала, он          
//                  остается неизменным, а функция              
//                  возвращает значение false                   
bool Pop(Item* pitem, Stack* ps);

#endif
*/

