#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include "Function.h"


// Использование массива структур (и для остальных программ):

char* s_gets(char* st, int n)				// Функция принимает адрес начала массива и размер массива, возвращает адрес на начало массива, т.е. вернется указатель на начало текста;
{
	char* ret_val;							// Создаем указатель типа char для того, чтобы дать адрес начала текста (начало массива);
	char* find;								// Создаем указатель типа char для символа;
	ret_val = fgets(st, n, stdin);			// Функция fgets() используется для ввода текста, 1 аргумент - массив, куда запишется текст, 2 аргумент - размер массива, 3 аргумент - стандартный поток ввода. Указателю ret_val запишется адрес начала массива (начало текста);
	if (ret_val)							// Если ввели только ввод, указателю ret_val записался бы адрес символа \n. Пропустится в случае ошибки программы или конец файла EOF;
	{
		find = strchr(st, '\n');			// Функция strchr() ищет символ новой строки, если находит, то записывает адрес указателю find. Если не нашел запишется нулевой адрес;
		if (find)							// Если нашли символ новой строки, блок if выполнит действие, если не найдет (только в случае, если текст превысил размер массива), блок if пропустится;
			*find = '\0';					// Указателю перезаписывается символ новой строки на символ конца строки;
		else								// Если не найден символ новой строки (только в случае, если текст превысил размер массива), то символы, которые не влезли в размер, очистятся;
			while (getchar() != '\n')		// Произойдет очистка буфера ввода от этих символов;
				continue;
	}
	return ret_val;							// Функция возвращает адрес начала массива (возвращает текст). Вернет NULL в случает ошибки программы или конец файла EOF;
}


// Заголовочный файл для простого типа списка (абстрактный список данных):
/*
void showmovies(Item item)
{
	printf("Фильм: %s Рейтинг: %d\n", item.title, item.rating);	// Вывод текста на консоль. item.title - переменная item типа структуры Item обращается к полю title (массив типа char). item.rating - переменная item типа структуры Item обращается к полю rating (переменная типа int);
}

static void CopyToNode(Item item, Node* pnode)
{
	pnode->item = item;											// Указатель pnode указывает на структуру Node, в которой поле item. Node это псевдоним струкутры film. Поле item содержит информацию полей структуры film.   
}																// Этим полям перезаписываются данные фильма;

void InitializeList(List* plist)
{
	*plist = NULL;												// Указателю plist, который указывает на указаетль List. List это псевдоним для указателя Node*. Node* указывает на структуру node. Указаетль plist содержит случайный адрес.
}																// При инициализации, для страховки программы от случайного мусора, присваивается нулевой адрес (NULL);

bool ListIsEmpty(const List* plist)
{
	if (*plist == NULL)											// Если по указателю plist содержится нулевой адрес, то функция вернет true, если какой то адрес есть false; 
		return true;											// Данная функция предназначена на случай проверки содержимого списка фильмов. Если есть хоть один фильм, вернет false;
	else
		return false;
}

bool ListIsFull(const List* plist)
{
	Node *pt;													// Объявление указателя pt типа структуры Node. Node псевдоним структуры node;
	bool full;													// Объявление переменной типа bool, может иметь значение либо 0, либо 1;
	pt = (Node*)malloc(sizeof(Node));							// Указателю pt присваивается адрес выделенной памяти для струкутуры в куче. (Node*) - даем знать компилятору что работаем с типом струкутры Node. sizeof(Node) - определение размера струкутуры;
	if (pt == NULL)												// Проверка: если функция malloc() не смогла выделить место в памяти, вернет нулевой адрес.
		full = true;											// Переменной присвоится логическая 1;
	else
		full = false;											// Переменной присвоится логический 0;
	free(pt);													// Очистка выделенной памяти от данных; 
	return full;												// Возврат значения 1 или 0;
}																// Функия проверяет может ли программа выделить место в памяти данных под структуру;

unsigned int ListItemCount(const List* plist)
{
	unsigned int count = 0;
	Node* pnode = *plist;										// Объявление указателя pnode на псевдоним Node структуры nodе с последующей инициализацией. Указаетлю pnode записывается адрес структуру Node; 
	while (pnode != NULL)										// Если адрес указателя не нулевой, выполнится блок while; 
	{
		++count;												// К счетчику прибавится единица. Если при следующей итерации снова адрес указателя pnode ненулевой, счетчик снова увеличится на 1 и т.д.;
		pnode = pnode->next;									// Указателю pnode присваивается адрес поля struct node* next (адрес следующего фильма) структуры node;
	}
	return count;												// Функция вернет количество в списке фильмов;
}

bool AddItem(Item item, List* plist)
{
	Node* pnew;													// Объявление указателя pnew типа структуры Node. Node псевдоним структуры node;
	Node* scan = *plist;										// Объявление указателя scan типа структуры Node с последующей инициализацией. Указателю scan запишесывается адрес структуры Node;
	pnew = (Node*)malloc(sizeof(Node));							// Указателю pnew запишется адрес выделенной памяти (в куче) под структуру Node. (Node*) - даем знать компилятору что работаем с типом струкутры Node. sizeof(Node) - определение размера струкутуры;
	if (pnew == NULL)											// Проверка: если функция malloc() не смогла выделить место в памяти, вернет нулевой адрес.
		return false;											// Переменной присвоится логический 0;
	CopyToNode(item, pnew);										// Вызов функции CopyToNode(), к принимает переменную item типа структуры Item. Item - псевдоним струкутры film. Так же принимает адрес под структуру выделенной в памяти данных;
	pnew->next = NULL;											// В поле struct node* next (адрес следующего фильма) записывается нулевой адрес. Это делается чтобы не записали адрес случайного мусора; 
	if (scan == NULL)											// Если адрес указателя scan равен нулевому адресу, выполнится блок if;
		*plist = pnew;											// Указаетлю plist на структуру node записывается адрес в выделенной памяти под структуру для структуры node;
	else
	{
		while (scan->next != NULL)								// Цикл закончится когда указатель scan поля struct node* next (адрес следующего фильма) структуры node достигнет нулевого адреса;
			scan = scan->next;									// Указатель scan поля struct node* next (адрес следующего фильма) структуры node записывается в указатель scan;
		scan->next = pnew;										// После цикла указателю scan поля struct node* next (адрес последнего фильма) структуры node запишется адрес последней структуры (последнего фильма);
	}
	return true;												// Функция вернет значение true (логическая 1);
}

void Traverse(const List* plist, void (*pfun)(Item item))
{
	Node* pnode = *plist;										// Объявление указателя pnode на псевдоним Node структуры nodе с последующей инициализацией. Указателю pnode записывается адрес структуру Node;  
	while(pnode != NULL)										// Если адрес указателя не нулевой, выполнится блок while; 
	{
		(*pfun)(pnode->item);									// Вызов функции по адресу, переданному в pfun (в нашем случае showmovies). В неё передаются сами данные фильма (pnode->item) по значению (копированием); 
		pnode = pnode->next;									// Указателю pnode присваивается адрес поля struct node* next (адрес следующего фильма) структуры node;
	}
}

void EmptyTheList(List* plist)
{
	Node* current = *plist;										// Ставим курсор на текущую голову списка. Объявление указателя current типа структуры Node с последующей инициализацией. Указателю current записывается адрес структуры Node;
	Node* psave = NULL;											// Временный указатель для спасения адреса следующего узла. Объявление указателя psave типа структуры Node с последующей инициализацией. Указателю psave записывается нулевой адрес;
	while (current != NULL)										// Если адрес указателя не нулевой, выполнится блок while; 
	{
		psave = current->next;									// Спасаем адрес следующего узла, пока текущий жив. Указателю psave присваивается адрес, на который указывает указатель current, поля struct node* next (адрес следующего фильма) структуры node;
		free(current);											// Безопасно удаляем текущий узел из памяти;
		current = psave;										// Перемещаем курсор на сохраненный следующий узел. Адрес указателя psave на текущую структуру типа Node, записывается в указатель current адрес структуры типа Node (для того чтобы сохраниться связь со следующей структорой);
	}
	*plist = NULL;												// В самом конце обязательно зануляем оригинальный указатель в main;
}
*/


// Абстрактный тип данных для предоставления очереди:
/*
static void CopyToNode(Item item, Node* pn);					// Функция принимает переменную item типа данных Item (Item псевдоним типа int) и принимает указатель pn на структуру Node (псевдоним структуры node). При помощи квалификатора static функция является локальной, видна только для файла, где она определена. Если вызвать в другом файле, компилятор выдаст ошибку;
static void CopyToItem(Node* pn, Item* pi);						// Функция принимает указатель pn на структуру Node (псевдоним структуры node) и указатель pi (адрес) на переменную типа Item. При помощи квалификатора static функция является локальной, видна только для файла, где она определена. Если вызвать в другом файле, компилятор выдаст ошибку;

void InitializeQueue(Queue* pq)
{
	pq->front = pq->rear = NULL;								// pq->front — указатель pq указывает на поле Node* front структуры queue. pq->rear — указатель pq указывает на поле Node* rear структуры queue. 
																// В начале работы программы указателям конца (rear) и начала (front) очереди присваивается нулевой адрес NULL, обозначая, что очередь пока пуста;
	pq->items = 0;												// Указатель pq указывает на поле int items структуры queue. Переменной items присваивается значение 0 (в очереди изначально 0 элементов);
}

bool QueueIsFull(const Queue* pq)
{
	return pq->items == MAXQUEUE;								// Указатель pq указывает на поле int items структуры queue. Значение переменной items сравнивается с макросом MAXQUEUE (равным 10). Если количество элементов достигло максимума, функция вернет логическую 1 (true), если нет — 0 (false);
}

bool QueueIsEmpty(const Queue* pq)
{
	return pq->items == 0;										// Указатель pq указывает на поле int items структуры queue. Значение переменной items сравнивается с 0. Если элементов нет, функция вернет логическую 1 (true), если в очереди кто-то есть — 0 (false);
}

int QueueItemCount(const Queue* pq)
{
	return pq->items;											// Указатель pq указывает на field int items структуры queue. Функция возвращает значение переменной items (текущее количество элементов в очереди);
}


bool EnQueue(Item item, Queue* pq)
{
	Node* pnew;													// Объявление указателя pnew на структуру Node (псевдоним структуры node);
	if (QueueIsFull(pq))										// Вызов функции QueueIsFull(). Если функция вернет значение логическую, функция EnQueue() вернет логический 0, т.е. нет свободного места под следующий список;
		return false;
	pnew = (Node*)malloc(sizeof(Node));							// Указателю pnew запишется адрес выделенной памяти (в куче) под структуру Node. (Node*) - даем знать компилятору что работаем с типом струкутры Node. sizeof(Node) - определение размера струкутуры;
	if (pnew == NULL)											// Проверка: если функция malloc() не смогла выделить место в памяти, вернет нулевой адрес;
	{
		fprintf(stderr, "Не удается выделить память!\n");
		exit(1);												// Программа завершится с кодом 1;
	}
	CopyToNode(item, pnew);										// Вызов функции CopyToNode(), в которой происходит запись значения в поле структуры Item item (int item);
	pnew->next = NULL;											// Указатель pnew указывает на поле struct node* next (адрес следующей структуры node). Указателю записывается нулевой адрес. Это делается чтобы не записали адрес случайного мусора; 
	if (QueueIsEmpty(pq))										// Вызов функции QueueIsEmpty(). Проверка на пустую очередь. Если очередь пуста, то новый элемент становится первым, и полю pq->front записывается адрес pnew;
		pq->front = pnew;
	else
		pq->rear->next = pnew;									// Если очередь не пуста, то мы заходим в текущий последний элемент очереди (через pq->rear) и в его поле next записываем адрес нового узла pnew, прицепляя его в конец цепочки;
	pq->rear = pnew;											// Полю pq->rear структуры queue, указаетлю rear записывается адрес добавленной структуры Node, для которой с помощью функции malloc() выделили место в памяти (в куче);
	pq->items++;												// Указатель pq указывает на поле int items структуры Queue (псевдоним струкутры queue). Переменная типа int увеличивается на 1 (счетчик увеличился на 1);
	return true;												// Функция возвращает логическую 1;
}

bool DeQueue(Item* pitem, Queue* pq)
{
	Node* pt;													// Объявление указателя pt на структуру Node (псевдоним структуры node);
	if (QueueIsEmpty(pq))										// Вызов функции QueueIsEmpty(). Если очередь пуста, то функция вернет логичесикую 1 и функция DeQueue() вернет логический 0;
		return false;
	CopyToItem(pq->front, pitem);								// Вызов функции CopyToItem(). Функции передается поле Node* front (адрес на структуру Node) структуры Queue и передается указатель pitem, который указывает (адрес) на переменную типа Item (int Item). Дальше работы функции CopyToItem() описан в определении этой функции; 
	pt = pq->front;
	pq->front = pq->front->next;								// pq->front->next - указатель pq указывает на (адрес) поле Node* front структуры queue, а указатель front указывает (адрес) на поле struct node* next структуры node, адрес указателя next (следующая в очереди структура node) присваивается полю Node* front структуры queue (указателю front адрес следующего узла);
	free(pt);													// Очистка вделенной памяти по струткуру node. Все данные теряются;
	pq->items--;												// Указаетель pq указывает на адрес поля int items (на переменную типа int). Значение этой переменной декрементируется. Счетчик записанных структур уменьшается;
	if (pq->items == 0)											// Если переменная items равна 0, то по указателю на поле Node* rear (указатею rear) записывается нулевой адрес. Значит в очереди нет записанных структур, список пуст; 
		pq->rear = NULL;
	return true;												// Функция возвращает логическую 1;
}

void EmptyTheQueue(Queue* pq)									
{
	Item dummy;													// Объявление переменной dummy типа Item (int dummy);
	while (!QueueIsEmpty(pq))									// Вызов функции QueueIsEmpty(), которая принмает указатель (адрес) на структуру Queue. Если число записанных структур будет равно 0, функция вернет 1, но знак "!" инвертирует 1 в 0 и цикл завершится. Выделенная память под структуры очистилась;
		DeQueue(&dummy, pq);									// Вызов функции DeQueue(), которая принимает адрес на переменную типа Item и адрес на структуру Queue;
}

static void CopyToNode(Item item, Node* pn)
{
	pn->item = item;								// Указатель pn указывает на поле Item item структуры Node (псевдоним структуры node). Переменной item типа Item (псевдоним типа int) записывается значение такой же переменной, которе ввели в функции main() при вызове функции EnQueue();
}

static void CopyToItem(Node* pn, Item* pi)
{
	*pi = pn->item;									// Указатель pn указывает на поле Item item структуры Node (псевдоним структуры node). В поле Item item (Item псевдоним типа int (или int item)) должно лежать значение, которе ввели когда то ввели в функции main() при вызове функции EnQueue().
}													// Это значение записывается по указателю pi переменной item типа данных Item (Item псевдоним типа int (или int item));

// ==================================================================//
// Еще программа абстрактный тип данных для предоставления очереди:
// x - среднее время между прибытиями клиентов в минутах.
// возвращает true, если клиент появляется в течение данной минуты.
bool newcustomer(double x)
{
	if (rand() * x / RAND_MAX < 1)					// rand() - функция возвращает случайное число от 0 до 32767. RAND_MAX - макрос, который имеет значение 32767. 
		return true;								// Если результат будет меньше 1, функция вернет логическую 1 - клиент(ы) пришел(ли);
	else											// Если результат больше или равно 1, функция вернет логический 0 - клиент(ы) не пришел(ли);
		return false;
}

// when - время прибытия клиента.
// Функция возвращает структуру Item со временем прибытия, установленным when, и временем обслуживания,
// установленным в случайное значение из диапазона от 1 до 3.
Item customertime(long when)						
{
	Item cust;										// Объявление переменной типа структуры Item;
	cust.processtime = rand() % 3 + 1;				// rand() - функция возвращает случайное число от 0 до 32767, это число делится на 3, остаток будет от до 2. Плюс прибавляем 1, т.к. на каждого клиента выделяется мнимум минута. Это итоговое значение присваивается полю cust.processtime структуры Item;
	cust.arrive = when;								// Время прибытия клиента присвивается полю cust.arrive структуры Item;
	return cust;									// Функция возвращает структуру с заполненными полями;
}
// ==================================================================//
*/


// Двоичное дерево поиска:
/*
typedef struct pair													// Создаем структуру типа pair;
{
	Trnode* parent;													// Создаем указатель parent на тип структуры Trnode. Данный указатель указывает на ветку дерева (родительску), которая содержит информацию о ветке, в которой содержится информация о животном в клубе и в какой ветке дерева опредленное животное содержится (левой или правой);
	Trnode* child;													// Создаем указатель child на тип структуры Trnode. Данный указатель указывает на ветку дерева, в которой содержится информация о конкретном животном в клубе, эта ветка может находится слева или справа по отношению от родительской ветки. И эта ветка также может быть родительской, которая может указвать на другое животное в клубе;
} Pair;																// Создаем структуру типа Pair (псевдоним структуры pair);

//=========================================//
// Прототипы локальных функций:
// Данные функции видны только этому файлу, другие файлы эти функции не видят;
static Trnode* MakeNode(const Item* pi);
static bool ToLeft(const Item* i1, const Item* i2);
static bool ToRight(const Item* i1, const Item* i2);
static void AddNode(Trnode* new_node, Trnode* root);
static void InOrder(const Trnode* root, void(*pfun)(Item item));
static Pair SeekItem(const Item* pi, const Tree* ptree);
static void DeleteNode(Trnode** ptr);
static void DeleteAllNodes(Trnode* root);
//=========================================//

// Абстрактные функции:
void InitializeTree(Tree* ptree)									// Инициализация дерева (самого первого);
{
	ptree->root = NULL;												// Указатель ptree обращается к полю Trnode* root структуры Tree, т.к. еще неизвестен следующий узел указателю root записывается нулевой адрес;
	ptree->size = 0;												// Указатель ptree обращается к полю int size и этому полю записывается значение 0;
}																	// Данная операция в этой функции делается, чтобы указатели не указывали на случайный (мусорный) адрес и количество улов было равно 0, а не какому либо случайному (мусорному) значению. Тем самым программа защищается от бага;

bool TreeIsEmpty(const Tree* ptree)									// Проверка дерева на свободное место;
{
	if (ptree->root == NULL)										// Указатель ptree обращается к полю Trnode* root структуры типа Tree, если указатель равен нулевому адресу, то дерево свободно (пустое);
		return true;												// Функция возвращает логическую 1;
	else															// Если указателю root присвоен адрес отличный от 0, в дереве имеются данные по животному (даже если это записано в структуре первого дерева);
		return false;												// Функция вернет логический 0;
}

bool TreeIsFull(const Tree* ptree)									// Проверка дерева на полностью занятые узлы;
{
	if (ptree->size == MAXITEMS)									// Указатель ptree обращается к полю int size структуры типа Tree, если переменная равна максимальному значению узлов (т.е. 10 животных), то место в дереве отсутствует;
		return true;												// Функция возвращает логическую 1;
	else															// Если переменная size меньше 10, то место в дереве есть; 
		return false;												// Функция вернет логический 0;
}

int TreeItemCount(const Tree* ptree)								// Функция возвращает количество узлов (сколько животных состоит в клубе);
{
	return ptree->size;												// Указатель ptree обращается к полю int size структуры типа Tree. Во время вызова, функция вернет значение, которое записано в переменной size, т.е. количество животных состоящих в клубе;
}

bool AddItem(const Item* pi, Tree* ptree)							// Функция добавляет информацию животного в узел и возвращает логическую 1 при успешном добавлении. Если не получилось добавить функция вернет логический 0;
{
	Trnode* new_node;												// Создаем указатель new_node на структуру типа Trnode, которое играет роль добавления нового животного в новый узел;
	if (TreeIsFull(ptree))											// Проверка на свободное место в дереве. Если нет места, выведется сообщение "Дерево переполнено" и функция  AddItem() завершится, вернув логический 0;
	{																
		fprintf(stderr, "Дерево переполнено\n");
		return false;
	}
	if (SeekItem(pi, ptree).child != NULL)							// Проверка на дублирование узла, функция SeekItem() ищет в дереве структуру (животное) с таким же именем и видом животного. Если узел находится с таким же именем и видом, то выводится сообщение "Попытка добавления дублированного элемента", вернув логический 0;
	{
		fprintf(stderr, "Попытка добавления дублированного элемента\n");
		return false;
	}
	new_node = MakeNode(pi);										// Функция MakeNode() добавляет в узел данные по животоному (добавляет данные структуры Item, на которую указвает указатель pi. При этом дочерним узлам left и right записывается нулевой адрес, чтобы сделать узел в дереве последним. При этом функция возвращает указатель (адрес) на структуру Trnode и этот адрес записывается указателю new_node;
	if (new_node == NULL)											// Если указателю не удалось записать адрес, то адрес будет нулевой, т.к. в функции MakeNode() используется функция malloc() и если не удастся выделить память в куче, функция вернет нулевой адрес;
	{
		fprintf(stderr, "Не удалось создать узел\n");				// Выведется сообщение "Не удалось создать узел" и функция  AddItem() вернет логический 0;
		return false;
	}
	ptree->size++;													// Указатель ptree обращается к полю int size структуры типа Tree. Происходит инкрементирование переменной на 1. Это означает, что удалось записать данные животного в узел;
	if (ptree->root == NULL)										// Указатель ptree обращается к полю Trnode* root структуры типа Trnode. Если указателю root нулевой адрес,
		ptree->root = new_node;										// запишется адрес новой структуры Trnode.
	else															// Если указателю root записан не нулевой адрес (то есть у дерева уже есть корень), вызовется функция AddNode(), которая принимает адрес нового узла (new_node) и адрес корня дерева (ptree->root). Корень служит стартовой точкой, от которой функция начнет спускаться по веткам.
		AddNode(new_node, ptree->root);								// Функция рекурсивно ищет свободное место ниже по дереву и определяет, к какому узлу и в какую ветку привязать новые данные (левую или правую).
	return true;													// Функция AddItem() возвращает логическую 1 в случае успешного добавления животного в новую струткуру типа Trnode;
}

bool InTree(const Item* pi, const Tree* ptree)						// Функция проверяет на наличие данных о животном в дереве (ищет узел (структуру Trnode) в дереве, которая содержит данные о животном);
{
	return (SeekItem(pi, ptree).child == NULL) ? false : true;		// Функция возвращает результат - существует или не существует животное в списке. Для поиска используется функция SeekItem(), которая принимает указатель pi (адрес) на структуру типа Item и указатель ptree (адрес) на структуру типа Tree.
}																	// Функция SeekItem() возвращает структуру типа Pair. Структура Pair обращается к полю child. Если функция нашла данные животного (структуры типа Item), функция InTree() вернет логическую 1, если не найдет логический 0;

bool DeleteItem(const Item* pi, Tree* ptree)						// Функция удаляет структуру типа Trnode из дерева, для поиска вводится структура типа Item (данные о животном);
{
	Pair look;														// Создаем переменную look типа структуры Pair, в которой содержатся поле корневого узла parent и дочернее поле корневого узла child;
	look = SeekItem(pi, ptree);										// Функция SeekItem() возвращает структуру типа Pair. Адрес этой структуры записывается указателю look;
	if (look.child == NULL)											// Проверяем есть ли данная струткура типа Item с данными о животном. Если в дочернем указателе child адрес нулевой, функция DeleteItem() вернет логический 0 - удалять нечего;
		return false;
	if (look.parent == NULL)										// Проверяем есть ли данная струткура типа Item с данными о животном. Если в корневом указателе parent адрес нулевой, это значит, что узел является самым верхним, над ним отсутствует родительский узел. И далее вызовится функция DeleteNode(), 
		DeleteNode(&ptree->root);									// которая принмает адрес указателя ptree, который обращается к полю Trnode* root (указателю на главный корень дерева). Функция DeleteNode() определит какой узел сделать главным; 
	else if (look.parent->left == look.child)						// Проверяем есть ли данная струткура типа Item с данными о животном в левой струткуре. look.parent->left - указатель parent переменной look типа струткуры Pair обращается к указателю left на струткуру Trnode, т.е. какой адрес левого дочернего узла записан. look.child - смотрим какой адрес записан у дочернего узла.
		DeleteNode(&look.parent->left);								// Если адрес равны, вызывается функция DeleteNode(), которая принимает адрес указателя left (у родительского узла берем адрес дочернего узла). Функция DeleteNode() определит какой узел подставить вместо удаленного узла с данными о животном (вместо удаленной струткуры, заменить на другую);
	else															// Если узел нашелся, но он не является главным корнем и не висит у родителя слева, значит, методом исключения он гарантированно висит справа
		DeleteNode(&look.parent->right);							// Функция DeleteNode() принимает адрес дочернего правого узла и удаляет его. И определится какой узел подставится вместо удаленного узла с данными о животном (вместо удаленной струткуры, заменится на другую);
	ptree->size--;													// Указатель ptree указвает на поле int size структуры типа Tree. Переменная уменьшается на единицу. Т.е. уменьшаем количество животных состоящих в клубе;
	return true;													// Функция возвращает логическую единицу в случае успеха удаления структуры;
}

void Traverse(const Tree* ptree, void(*pfun)(Item item))			// Функция принимает адрес указателя ptree на структуру Tree и указатель на любую функцию, которая принимает переменную item типа структуры Item (данные по животному);
{																	// В данной программе выводятся данные по животным, состоящим в клубе;
	if (ptree != NULL)												// Проверяем существование самой структуры управления деревом (картотеки). Если картотека создана в памяти, то адрес ptree не равен нулю;
		InOrder(ptree->root, pfun);									// Указатель ptree обращается к полю Trnode* root структуры Tree. Функция InOrder() принимает адрес этого корня (даже если он NULL) и указатель pfun на функцию (в данной программе это функция printitem()); 
}

void DeleteAll(Tree* ptree)											// Функция удаляет все узлы (структуры), принимает указатель (адрес) ptree на структуру типа Tree (где хранятся все данные по животным состоящим в клубе);
{
	if (ptree != NULL)												// Проверяем существование самой структуры управления деревом (картотеки). Если картотека создана в памяти, то адрес ptree не равен нулю;
	{
		DeleteAllNodes(ptree->root);								// Функция DeleteAllNodes() принимает указатель (адрес) root поля Trnode* root структуры типа Tree. Функция удаляет все струткруры (все базу данных по клубу);
		ptree->root = NULL;											// Указатель ptree обращается к указателю поля Trnode* root структуры типа Tree. И указтелю root записывается нулевой адрес, т.е. дерево существует. но оно пустое;
		ptree->size = 0;											// Указатель ptree обращается к переменной поля int size структуры типа Tree. Переменной size присваивается 0, т.е. в клубе 0 животных;
	}	
}

// Определения локальных функций: 
static void InOrder(const Trnode* root, void(*pfun)(Item item))		// Функция принимает указатель root на струткуру Trnode (указатель на корневой узел - дерево) и казатель на любую функцию, которая принимает переменную item типа структуры Item (данные по животному);
{
	if (root != NULL)												// Проверяем, существует ли текущий узел дерева (не упёрлись ли мы в конец ветки);
	{
		InOrder(root->left, pfun);									// Функция InOrder() вызывает сама себя, но принимает адрес левой дочерней структуры в родительской структуре и указатель pfun на функцию (в данной программе это функция printitem()). Самовызов функции (рекурсия) не закончится, пока не дойдет до конца левой ветки, где адрес равен NULL;
		(*pfun)(root->item);										// Вызывается функция (в данном случае printitem), на которую указывает указатель pfun. Функция принимает струкутру item типа структуры Item (примает данные по животному);
		InOrder(root->right, pfun);									// Функция InOrder() вызывает сама себя, но принимает адрес правой дочерней структуры в родительской структуре и указатель pfun на функцию (в данной программе это функция printitem()). Самовызов функции (рекурсия) не закончится, пока не дойдет до конца правой ветки, где адрес равен NULL;
	}																// Принцип функции InOrder(), заключается в том, что начало идет с самого верха дерева, до самого низа по левой стороне, когда левая сторона закончилась и упёрлась в NULL, функции InOrder() принмать нечего, и она пропустится до строки (*pfun)(root->item) и происходит печать самой нижней струткуры, 
}																	// При обратной рекурсии уже напечатается строка корневой структуры, затем программа полезет в правую дочернюю структуру и тоже напечатает текст. 		
																	// Получается в обратном направлении получается путь лево, вверх, вправо, вверх, вверх, вправо, вверх, вверх и т.д.;  

static void DeleteAllNodes(Trnode* root)							// Функция для удаления всего дерева. Функция принимает указатель root указывающий на структуру типа Tnode;
{
	Trnode* pright;													// Создаем локальный указатель pright указывающий на структуру типа Trnode;
	if (root != NULL)												// Проверяем, существует ли текущий узел дерева (не упёрлись ли мы в конец ветки);
	{
		pright = root->right;										// root->right - указатель root обращается к полю struct trnode* right структуры Trnode. Указателю pright записывается адрес правой дочерней структуры right;
		DeleteAllNodes(root->left);									// Функция DeleteAllNodes() вызывает сама себя, принимая указатель left текущей структуры Trnode, на которую указывает root. Функция будет вызывать сама себя, пока не дойдет до конца левой ветки, где адрес равен NULL;
		free(root);													// Происходит очистка выделенной памяти под корневую структуру;
		DeleteAllNodes(pright);										// Функция DeleteAllNodes() вызывает сама себя, принимая указатель pright, которой раннее записался адрес правой структуры в корневой (родительской) структуре;
	}																// Принцип функции DeleteAllNodes(), заключается в том, что начало идет с самого верха дерева, до самого низа по левой стороне, когда левая сторона закончилась и упёрлась в NULL, функции DeleteAllNodes() принмать нечего, и она пропустится до строки free(root) и происходит удаление выделенной памяти под левую структуру,
}																	// При обратной рекурсии уже дойдет до удаления правой структуры, т.к. сохраненный адрес pright передается в следующий самовызов. Получается в обратном направлении получается путь лево - удалили, вверх, вправо - удалили, вверх - удалили, вверх, вправо - удалили, вверх - удалили, вверх и т.д.;  

static void AddNode(Trnode* new_node, Trnode* root)					// Функция для добавления узла. Принимает указатель new_node на новую структуру типа Trnode, которую нужно добавить и указатель root, который указывает на структуру типа Trnode;
{
	if (ToLeft(&new_node->item, &root->item))						// При проверки функция ToLeft(), принимает адрес на новую структуру item, которая содержит информацию о животном и адрес на структуру item, где уже находится информация о животном. Функция ToLeft() определяет в какой узел записать новое животное. Запись идет в алфавитном порядке;
	{
		if (root->left == NULL)										// Проверка условия. Если в родительской структуре в поле struct trnode* left указателю left записан нулевой адрес, то дочерней структуры левого узла нет;
			root->left = new_node;									// То по указаетлю left запишется адрес новой структуры new_node. Т.е. у родительской струткуры появилася левая дочерняя структура;
		else														// Если указаетелю записан адрес, то левая дочерняя структура существует и произойдет вновь вызов функции AddNode() (рекурсия), т.е. функция .
			AddNode(new_node, root->left);							// Функция принимает адрес по указателю new_node новой структуры и адрес дочерней левой структуры по указателю left, который содержит корневая (родительская) структура. Рекурсия будет происходить до тех пор, пока указатель left не упрется в нулевой адрес. Т.е. функция ToLeft() решила определить структуру слева;
	}
	else if (ToRight(&new_node->item, &root->item))					// При проверки функция ToRight(), принимает адрес на новую структуру item, которая содержит информацию о животном и адрес на структуру item, где уже находится информация о животном. Функция ToRight() определяет в какой узел записать новое животное. Запись идет в алфавитном порядке;
	{
		if (root->right == NULL)									// Проверка условия. Если в родительской структуре в поле struct trnode* right указателю right записан нулевой адрес, то дочерней структуры правого узла нет;
			root->right = new_node;									// То по указателю right запишется адрес новой структуры new_node. Т.е. у родительской струткуры появилася правая дочерняя структура;
		else
			AddNode(new_node, root->right);							// Функция принимает адрес по указателю new_node новой структуры и адрес дочерней правой структуры по указателю right, который содержит корневая (родительская) структура. Рекурсия будет происходить до тех пор, пока указатель right не упрется в нулевой адрес. Т.е. функция ToRight() решила определить структуру справа;
	}
	else															// Если функции ToLeft() и ToRight() не определили в какой узел добавлять структуру.
	{
		fprintf(stderr, "Ошибка местоположения в AddNode()\n");		// Выведется сообщение об ошибке с кодом 1 и программа завершится, при условии, что введем совершено одинаковые данные по животному;
		exit(1);
	}
}

static bool ToLeft(const Item* i1, const Item* i2)					// Функция определяет в какой узел структуры - в корневой (родительской) структуре добавить новую структуру. Принимает указатель i1 (адрес) на новую структуру типа Item и указатель i2 (адрес) на корневую (родительскую) структуру типа Item;
{
	int comp1;														// Создаем локальную переменную comp1;
	if ((comp1 = strcmp(i1->petname, i2->petname)) < 0)				// Провряем условие при помощи функции strcmp(). Функция ловит разные буквы, если одинаковые будет сверять следующие буквы, результат записывается переменной comp1. Происходит сравнение имен животных, если ответ отрицательный то новая структура будет уйдет в левую ветку. Если имена одинаковые функция вернет 0;
		return true;												// Функция возвращает логическую 1;
	else if (comp1 == 0 && strcmp(i1->petkind, i2->petkind) < 0)	// Если имена одинаковые, произволится проверка по названию вида. Если ответ отрицательный то новая структура уйдет в левую ветку струткуры;
		return true;												// Функция возвращает логическую 1;
	else
		return false;												// Если имя и вид животного совершено одинаковы, функция вернет логический 0. И далее пойдет проверка для правого узла корневой (родительской) структуры;
}

static bool ToRight(const Item* i1, const Item* i2)					// Функция определяет в какой узел структуры - в корневой (родительской) структуре добавить новую структуру. Принимает указатель i1 (адрес) на новую структуру типа Item и указатель i2 (адрес) на корневую (родительскую) структуру типа Item;
{
	int comp1;														// Создаем локальную переменную comp1
	if ((comp1 = strcmp(i1->petname, i2->petname)) > 0)				// Провряем условие при помощи функции strcmp(). Функция ловит разные буквы, если одинаковые будет сверять следующие буквы, результат записывается переменной comp1. Происходит сравнение имен животных, если ответ положительный то новая структура будет уйдет в правую ветку. Если имена одинаковые функция вернет 0;
		return true;												// Функция возвращает логическую 1;
	else if (comp1 == 0 && strcmp(i1->petkind, i2->petkind) > 0)	// Если имена одинаковые, произволится проверка по названию вида. Если ответ положительный то новая структура уйдет в правую ветку струткуры;
		return true;												// Функция возвращает логическую 1;
	else														
		return false;												// Если имя и вид животного совершено одинаковы, функция вернет логический 0. Далее программа завершится аварийно;
}

static Trnode* MakeNode(const Item* pi)								// Функция выделяет память под динамическую структуру. Функция принмает указатель pi на структуру типа Item (под новую структуру с данными о животном);
{
	Trnode* new_node;												// Создаем локальный указатель new_node указывающий на структуру типа Trnode;
	new_node = (Trnode*)malloc(sizeof(Trnode));						// Указателю new_node присваивается адрес выделенной памяти для струкутуры в куче. (Trnode*) - даем знать компилятору что работаем с типом струкутры Trnode. sizeof(Trnode) - определение размера струкутуры;
	if (new_node != NULL)											// Если функции malloc не удалось выделить память, то функция MakeNode() возвращает нулевой адрес на структуру Trnode;
	{
		new_node->item = *pi;										// new_node->item - указатель new_node обращается к переменной item типа структуры Item. И структуре Item копируются данные, на которые указывает указатель pi. Поля структуру Item заполняются данными о животном (имя, вид);
		new_node->left = NULL;										// new_node->left - указатель new_node обращается к указателю left поля struct trnode* left. И указателю left записывается нулевой адрес, для того чтобы обозначит, что у новой корневой (родительской) струткуры будет отсутствует узел с левой дочерней структурой, т.е. ее нет;
		new_node->right = NULL;										// new_node->right - указатель new_node обращается к указателю right поля struct trnode* right. И указателю right записывается нулевой адрес, для того чтобы обозначит, что у новой корневой (родительской) струткуры будет отсутствует узел с правой дочерней структурой, т.е. ее нет;
	}
	return new_node;												// Функция возвращает адрес на новую структру типа Trnode;
}

static Pair SeekItem(const Item* pi, const Tree* ptree)				// Функция ищет узел с животным в дереве. Принимает указатель pi на искомые данные Item и указатель ptree на дерево Tree, в котором проходит поиск. В конце возвращает пару указателей (родитель и цель);
{
	Pair look;														// Создаем локальную переменную look типа Pair, которая будет хранить два указателя: на родительский узел (parent) и на текущий целевой узел (child);
	look.parent = NULL;												// Изначально родитель равен NULL, так как поиск начинается с самого верха (корня), а у корня нет родителя;
	look.child = ptree->root;										// Записываем в child адрес корня дерева (ptree->root), делая корень стартовой точкой для проверки;
	while (look.child != NULL)										// Цикл проверяет, пока не достигнет в родительской структуре нулевого адреса дочерней структуры, т.е. дальше родитеской структуры ничего нет;
	{
		if (ToLeft(pi, &(look.child->item)))						// Функция ToLeft() определяет, нужно ли искать животное в левой ветви. Для этого она принимает адрес pi введенных данных Item и адрес поля item (карточки животного) внутри того узла дерева, на который указывает поле child переменной look структуры Pair. Знак & берет прямой адрес этой карточки;
		{															// Если функция вернет логическую 1 движемся дальше по левому узлу, в противном случае по правому узлу и блок if пропустится;
			look.parent = look.child;								// Указателю parent родительской структуры записывается адрес указателя child дочерней структуры. Получается дальше спускаемся по дереву вниз;
			look.child = look.child->left;							// Далее дочерняя структура становится родительской структурой и у нее есть такие же дочерние узлы. И этой структуре записывается адрес новой левой дочерней структуры. Сделали шаг по дереву вниз влево;
		}
		else if (ToRight(pi, &(look.child->item)))					// Функция ToRight() определяет, нужно ли искать животное в правой ветви. Для этого она принимает адрес pi введенных данных Item и адрес поля item (карточки животного) внутри того узла дерева, на который указывает поле child переменной look структуры Pair. Знак & берет прямой адрес этой карточки;
		{															// Если функция вернет логическую 1 движемся дальше по правому узлу, в противном случае по левому узлу и блок if пропустится;
			look.parent = look.child;								// Указателю parent родительской структуры записывается адрес указателя child дочерней структуры. Получается дальше спускаемся по дереву вниз;
			look.child = look.child->right;							// Далее дочерняя структура становится родительской структурой и у нее есть такие же дочерние узлы. И этой структуре записывается адрес новой правой дочерней структуры. Сделали шаг по дереву вниз вправо;
		}
		else												
			break;													// Если нашли точное совпадение, то произойдет выход из цикла while;
	}
	return look;													// Возвращаем структуру Pair. Если животное найдено, в child будет его адрес, а в parent — адрес ветки выше. Если не найдено, в child останется NULL;
}

static void DeleteNode(Trnode** ptr)								// Функция удаляет узел в дереве (удаляет струткуру с данными по животному, состоящему в клубе). Функция принимает двойной указатель, т.е. адрес на структуру Trnode, и в этот адрес заходим еще раз, получаем доступ к полям структуры Trnode;
{
	Trnode* temp;													// Создаем локальный указатель temp указывающий на структуру типа Trnode;
	if ((*ptr)->left == NULL)										// Проверяем условие. *ptr - получаем доступ к указателю left структуры типа Trnode, если указатель равен нулю, значит в удаляемой структуре в левом узле отсутствует адрес дочерней структуры;
	{
		temp = *ptr;												// Временному указателю temp (адрес) на структуру типа Trnode записывается адрес структуры типа Trnode;
		*ptr = (*ptr)->right;										// Через указатель *ptr получаем доступ к полю struct trnode* right структуры Trnode и этому указателю right записываем адрес дочерней правой структуры;
		free(temp);													// Очищаем память выделенную под структуру, которую передали функции DeleteNode();
	}
	else if ((*ptr)->right == NULL)									// Проверяем условие. *ptr - получаем доступ к указателю right структуры типа Trnode, если указатель равен нулю, значит в удаляемой структуре в правом узле отсутствует адрес дочерней структуры;
	{	
		temp = *ptr;												// Временному указателю temp (адрес) на структуру типа Trnode записывается адрес структуры типа Trnode;
		*ptr = (*ptr)->left;										// Через указатель *ptr получаем доступ к полю struct trnode* left структуры Trnode и этому указателю left записываем адрес дочерней левой структуры;
		free(temp);													// Очищаем память выделенную под структуру, которую передали функции DeleteNode();
	}
	else															// Если у родительской структуры адреса на дочерние струткуры имеют адреса, выполнится блок оператора else;
	{
		for (temp = (*ptr)->left; temp->right != NULL; temp = temp->right)	// Заходим указателем temp в левую ветку удаляемого узла. Пока у текущего узла temp есть правые потомки (temp->right != NULL), цикл будет продолжаться;   
			continue;														// С помощью continue переходим к следующему шагу: смещаем temp строго вправо (temp = temp->right), пока не дойдем до самого крайнего правого узла в этой ветке;
		// ШАГ 1: Копирует адрес правой ветки удаляемого узла:
		temp->right = (*ptr)->right;								// Через временный указатель temp структуры Trnode обращаемся к указателю right, этому указателю записывается адрес указателя right старой структуры;
		// ШАГ 2: Сохраняем адрес удаляемого узла:
		temp = *ptr;												// Временному указателю temp (адрес) на структуру типа Trnode записывается адрес структуры типа Trnode;
		// ШАГ 3: Родитель теперь указывает на левого потомка удаляемого узла:
		*ptr = (*ptr)->left;										// Через указатель *ptr получаем доступ к полю struct trnode* left структуры Trnode и этому указателю left записываем адрес дочерней левой структуры;
		// ШАГ 4: Физически удаляем старый узел:
		free(temp);													// Очищаем память выделенную под структуру, которую передали функции DeleteNode();
	}																
}																	// Принцип удаления струткуры и привязывания веток, удаленной структуры:
																	// Удалили струкутуру с данными о животном, остались отрезаны два узла, левый и правый. Сначала привязываем левую ветку к родительской структуре, удаленной структуры.
																	// Затем в этой привязанной левой ветке через цикл for ищем свободный (нулевой) адрес в правой ветке структур, 
																	// чтобы привязать правую ветку, которая была связана с удаленной родительской структурой;
*/