#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <ctype.h>
#include "Function.h"
#include "Tree.h"


// Задание 7:
/*
char menu(void)                                             // Функция отображения меню и выбора режима работы программы;
{
	int ch;                                                 // Переменная для считывания введенного символа;
	puts("Введите пункт из меню:");
	puts("1) Вывод списка всех слов");
	puts("2) Поиск слова");
	puts("3) Выход");
	while ((ch = getchar()) != EOF)                         // Цикл считывает символ через getchar и крутится, пока не встретит конец файла (EOF);
	{
		while (getchar() != '\n')                           // Внутренний цикл очищает буфер ввода от знака новой строки (\n) и лишних символов;
			continue;
		if (strchr("123", ch) == NULL)                      // Проверяем с помощью strchr, входит ли введенный символ в разрешенную строку "123";
			puts("Введите цифры 1, 2 или 3:");				// Если символ не найден (strchr вернул NULL), выводим предупреждение;
		else
			break;                                          // Если символ корректен (1, 2 или 3), досрочно выходим из цикла;
	}
	if (ch == EOF)                                          // Если пользователь применил комбинацию завершения потока ввода (EOF);
		ch = '3';                                           // Принудительно присваиваем символ '3', что означает команду на выход;
	return ch;                                              // Функция возвращает выбранный символ цифры ('1', '2' или '3') обратно в main;
}

void show_words(const Tree* pt)                             // Функция для вывода списка всех слов в алфавитном порядке. Принимает указатель pt на дерево;
{
	if (TreeIsEmpty(pt))                                    // Проверяем с помощью TreeIsEmpty, есть ли в дереве хотя бы одно слово;
		puts("Записи отсутствуют! Файл был пуст. \n");      // Если дерево пустое, выводим сообщение, что записей нет;
	else
		Traverse(pt, printitem);                            // Если слова есть, запускаем Traverse для обхода дерева и вывода каждого слова через функцию printitem;
}

void printitem(Item item)                                   // Функция для вывода слова и количества его повторений на экран. Принимает элемент Item;
{
	printf("%19s: %d\n", item.word, item.count);            // Выводит в консоль само слово (с выравниванием в 19 символов) и через двоеточие — число его вхождений в файле;
}

void findword(const Tree* pt)                                       // Функция для поиска слова в дереве и вывода количества его повторений. Принимает указатель pt на дерево;
{
	Item temp;                                                      // Создаем локальную переменную temp типа структуры Item для хранения искомого слова;
	if (TreeIsEmpty(pt))                                            // Проверяем с помощью функции TreeIsEmpty, есть ли в дереве хотя бы одно слово;
	{
		puts("Записи отсутствуют!");                                // Если дерево пустое, выводим сообщение на консоль;
		return;                                                     // Досрочно завершаем функцию;
	}
	else                                                            // Если в дереве есть данные, переходим к поиску;
	{
		int vol = 0;                                                // Создаем локальную переменную vol для хранения количества повторений слова;
		puts("Введите слово, которое хотите найти:");
		s_gets(temp.word, SIZE);                                    // Считываем с клавиатуры искомое слово и записываем его в массив temp.word;		
		putchar('\n');
		printf("Слово %s ", temp.word);                             // Выводим начало строки ответа с искомым словом;
		vol = InTree(&temp, pt);                                    // Запускаем функцию InTree, которая ищет слово в дереве и возвращает точное число его повторений;
		if (vol > 0)                                                // Если переменная vol больше нуля, значит, слово успешно найдено в дереве;
			printf(" написано %d раз.\n", vol);                     // Дописываем в консоль точное количество его вхождений;
		else                                                        // Если vol равен 0, значит, такого слова при чтении файла не встречалось;
			printf(" отсутствует в файле.\n");                      // Дописываем в консоль сообщение об отсутствии слова;
	}
}
*/




// Задание 8:
/*
char menu(void)												// Функция выбора режима работы со списком;
{
	int ch;
	puts("Программа членства в клубе Nerfvile Pet Club");
	puts("Введите букву соответствующую вашему выбору:");
	puts("a) добавление животного  l) вывод списка животных");
	puts("c) количесвто животных с одним именем  n) количество животных");
	puts("f) поиск животных  d) удаление животного");
	puts("q) выход");
	while ((ch = getchar()) != EOF)							// Цикл будет работать пока переменная не станет равна концу файла;
	{
		while (getchar() != '\n')							// Очистка буфера от лишних символов;
			continue;
		ch = tolower(ch);									// Функция tolower() переводит символ в нижний регистр. Для случая если ввели символ верхним регистром;
		if (strchr("alcnfdq", ch) == NULL)					// Функция strchr() ищет символ меню, если не найдет, функция вернет нулевой адрес;
			puts("Введите букву a, l, c, n, f, d или q:");
		else
			break;											// Если функция strchr() нашла символ, произойдет выход из цикла while();
	}
	if (ch == EOF)											// Если переменная ch равна символу конца файла, то переменной присваивается символ q, которы означает выход из программы;
		ch = 'q';
	return ch;												// Функцция возвращает переменную ch, которая содержит введенный символ;
}

void addpet(Tree* pt)										// Функция для добавления животного в список. Функция принимает указатель на структуру Tree;
{
	Item temp;												// Создаем локальную переменную temp типа структуры Item;
	if (TreeIsFull((pt)))									// Проверяем, есть ли свободное место в списке. Функция принимает указатель pt на структуру типа Tree;
		puts("В клубе больше нет мест!");					// Если места нет, выведется об этом сообщение;
	else
	{
		puts("Введите кличку животного:");
		s_gets(temp.petname, SLEN);							// Вызов функции для ввода имени животного. Функция принимает строковый массив petname структуры Item;
		puts("Введите вид животного:");
		s_gets(temp.petkind, SLEN);							// Вызов функции для ввода вида животного. Функция принимает строковый массив petkind структуры Item;
		putchar('\n');
		uppercase(temp.petname);							// Вызов функции uppercase(). Переводит все символы имени животного в верхний регистр;
		uppercase(temp.petkind);							// Вызов функции uppercase(). Переводит все символы вида животного в верхний регистр;
		AddItem(&temp, pt);									// Вызов функции AddItem(). Функция проверяет на свободное место в списке (если нет, то животное не добавится), ищет дублера в списке (если имя и вид совпадет, животное не добавится) и только потом добавляет в список животное;
	}
}

void showpets(const Tree* pt)								// Функция для вывода списка животных (причем в алфавитном порядке). Функция принимает указатель на структуру Tree;
{
	if (TreeIsEmpty(pt))									// Проверка, есть ли в списке хотя бы одно животное. Функция TreeIsEmpty() принимает указатель на структуру Tree;
		puts("Записи отсутствуют!");						// Если нет записи, выведется соответствующее сообщение на консоль;
	else
		Traverse(pt, printitem);							// Если есть запись, вызовется функция Traverse(), которая принимает указатель pt на структуру и указатель на функцию printitem;
}

void printitem(Item item)									// Функция для вывода информации о животном. Функция принимает переменную item струткуры типа Item;
{
	printf("Животное %-19s Вид %-19s\n", item.petname, item.petkind);
}

void findpet(const Tree* pt)								// Функция для поиска животного в списке. Функция принимает указатель на структуру Tree;
{
	Item temp;												// Создаем локальную переменную temp типа структуры Item;
	if (TreeIsEmpty(pt))									// Проверка, есть ли в списке хотя бы одно животное. Функция TreeIsEmpty() принимает указатель на структуру Tree;
	{
		puts("Записи отсутствуют!");						// Если список пуст выведется соответствующее сообщение;
		return;												// Функция findpet() завершится;
	}
	else													// Если в списке есть хотя бы одна запись, программа зайдет в блок else;
	{
		puts("Введите кличку животного, которое хотите найти:");
		s_gets(temp.petname, SLEN);							// Вызов функции для ввода имени животного. Функция принимает строковый массив petname структуры Item;
		puts("Введите вид животного:");
		s_gets(temp.petkind, SLEN);							// Вызов функции для ввода вида животного. Функция принимает строковый массив petkind структуры Item;
		putchar('\n');
		uppercase(temp.petname);							// Вызов функции uppercase(). Переводит все символы имени животного в верхний регистр;
		uppercase(temp.petkind);							// Вызов функции uppercase(). Переводит все символы вида животного в верхний регистр;
		printf("%s по имени %s ", temp.petkind, temp.petname);
		if (InTree(&temp, pt))								// Функция InTree() проверяет, состоит ли животное в клубе. Функция принимает адрес структуры типа Item и указатель pt на структуру типа Tree;
			printf(" является членом клуба.\n");
		else
			printf("Не является членом клуба.\n");
	}
}

void droppet(Tree* pt)										// Функция для удаления животного из списка. Функция принимает указатель на структуру Tree;
{
	Item temp;												// Создаем локальную переменную temp типа структуры Item;
	if (TreeIsEmpty(pt))									// Если список пуст выведется соответствующее сообщение;
	{
		puts("Записи отсутствуют!");						// Если список пуст выведется соответствующее сообщение;
		return;												// Функция droppet() завершится;
	}
	puts("Введите кличку животного, которое нужно исключить из клуба:");
	s_gets(temp.petname, SLEN);								// Вызов функции для ввода имени животного. Функция принимает строковый массив petname структуры Item;
	puts("Введите вид животного:");
	s_gets(temp.petkind, SLEN);								// Вызов функции для ввода вида животного. Функция принимает строковый массив petkind структуры Item;
	uppercase(temp.petname);								// Вызов функции uppercase(). Переводит все символы имени животного в верхний регистр;
	uppercase(temp.petkind);								// Вызов функции uppercase(). Переводит все символы вида животного в верхний регистр;
	printf("%s по имени %s ", temp.petkind, temp.petname);
	if (DeleteItem(&temp, pt))								// Функция DeleteItem() проверяет есть ли введенное животное в списке, если есть функция DeleteItem() выполнится. Функция принимает адрес структуры типа Item и указатель pt на структуру типа Tree;
		printf("исключен(а) из клуба.\n");
	else
		printf("Не является членом клуба.\n");
}

void uppercase(char* str)									// Функция для перевода всех символов имени и вида животного в верхний регистр;
{
	while (*str)
	{
		*str = toupper(*str);
		str++;
	}
}
*/

