#define MESG "COMPUTER BYTES DOG"

#include <stdio.h>
#include <locale.h>
#include <Windows.h>

#define ADJUST 7.31
#define SQUARES 64		// Число клеток на шахматной доске;

#define SEC_PER_MIN 60	// Секунд в минуте;
#define S_TO_M 60		// Для альтернативного кода;

#define MAX 100			// 100 бутылок;

#define FORMAT "%s! C is cool! \n"

#define TEN 10

// void pound(int n);		// Объявление прототипа функии. Принимает аргумент переменной типа "int" или "n" является параметром, который принимает аргумент какой-либо переменной в виде значения или выражения;

// Объявление глобальных переменных с применением модификатора const:
const int S_PER_M = 60;
const int S_PER_H = 3600;
const double M_PER_K = 0.62137;

int main(void)
{
	setlocale(LC_ALL, "RUS");
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);

	// Простая программа по вычислению размера обуви:
/*	const double SCALE = 0.333;
	double shoe, foot;
	shoe = 9.0;
	foot = SCALE * shoe + ADJUST;
	printf("Размер обуви (мужской)	длина ступни \n");
	printf("%10.1f %20.2f дюймов \n", shoe, foot);
*/
// Усовершенствованная программа для вычисления размера обуви с использоанием цикла "while": 
/*	const double SCALE = 0.333;
	double shoe, foot;
	printf("Размер обуви (мужской)	длина ступни \n");
	shoe = 3.0;
	while (shoe < 18.5)	// Проходит проверка условия, если условие "true", выпонится блок цикла заключенный в фигурные скобки "{}", если условие "false", блок пропустится и программа продолжится с оператора, следуещий после блока;
	{
		foot = SCALE * shoe + ADJUST;
		printf("%10.1f %20.2f дюймов \n", shoe, foot);		// Второй спецификатор устанавливает ширину поля значения переменной "foot" до значения первой переменной "shoe" в "20" отступов включая значение;
		shoe = shoe + 1.0;	// Увеличение переменной на 1,0;
	}						// Программа вернется снова к проверке условия цикла;
	printf("Если обувь подходит, носите её. \n\n");
*/
// Таблица квадратов 20 значений:
/*	int num = 1;
	while (num < 21)
	{
		printf("%4d %6d \n", num, num * num);
		num = num + 1;
	}
*/
// Экспоненциальный рост (на шахмотной доски):
/*	const double CROP = 2E16;		// Годовой урожай;
	double current, total;
	int count = 1;					// Первая клетка шахматной доски;
	printf("клетка	добавлено	итого	    ");
	printf("процент от \n");
	printf("	  зерен		зерен	  ");
	printf("мирового урожая \n");
	total = current = 1;			// Начинаем с однго зерна;
	printf("%4d %13.2e %12.2e %12.2e \n", count, current, total, total / CROP);
	while (count < SQUARES)
	{
		count = count + 1;
		current = current * 2.0;	// Удвоить количество зерен на следующей клетке;
		total = total + current;	// Обновить итоговую сумму;
		printf("%4d %13.2e %12.2e %12.2e \n", count, current, total, total / CROP);   // Более наглядно, можно подставть спецификатор "%f";
	}
	printf("Вот и все. \n\n");		// На 64 клетке количество зерен превышает годовой урожай во множество раз;
*/
// Деление:
/*	printf("Целочисленное деление: 5/4 равно %d \n", 5 / 4);
	printf("Целочисленное деление: 6/3 равно %d \n", 6 / 3);
	printf("Целочисленное деление: 7/4 равно %d \n", 7 / 4);
	printf("Деление с плавающей запятой: 7./4. равно %1.2f \n", 7. / 4.);
	printf("Смешанное деление: 7./4 равно %1.2f \n", 7. / 4);					// Целое число преобразуется преобразуется в число с плавающей запятой;
*/
// Проверка приоритетов:
/*	int top, score;
	top = score = -(2 + 5) * 6 + (4 + 3 * (2 + 3));		// Сначала переменной "score" привоится значение, затем переменной "top", операция присваивания выполняется справа налево;
	printf("top = %d, score = %d \n", top, score);
*/
// Использование операции sizeof:
/*	int n = 0;
	size_t intsize;				// "size_t" - целочисленный тип без знака, который автоматически выделяет "8" байт в ячейки памяти, т.к. система 64-разрядная. Переменнаяимеет "intsize" будет равна "4" байтам;
	intsize = sizeof(int);		// "sizeof(int)" — возвращает размер типа, тип "int" равен "4" байтам;
	printf("n = %d, n состоит из %zd байтов; все значения int имеют %zd байта. \n", n, sizeof n, intsize);		// "sizeof n" вернет размер переменой "n", т.е. "4" байта;
	printf("Внутри переменной лежит число: %zd \n", intsize);													// Переменной "intsize" присвоено значение "4";
	printf("А сама переменная intsize занимает в памяти: %zd байтов\n", sizeof(intsize));						// Сама переменная "intsize" занимает "8" байт, т.к. система 64-разрядная;
*/
// Операция деления по модулю, работает только с целочисленными типами, с типами плавающей запятой программа работать не будет. Перевод секунды в минуты:
/*	int sec, min, left;
	printf("Перевод секунд в минуты и секунды! \n");
	printf("Введите количество секунд (<= для выхода): \n");
	scanf_s("%d", &sec);
	while (sec > 0)
	{
		min = sec / SEC_PER_MIN;
		left = sec % SEC_PER_MIN;			// Данну операцию можно представить как деление по модулю. Например, 150 % 60 = 150 / 60 = 2, а остаток равно 30;
		printf("%d секунд - это %d минут(ы) %d секунд. \n", sec, min, left);
		printf("Введите следующее значение (<= для выхода): \n");
		scanf_s("%d", &sec);
	}
	printf("Готово! \n");
*/
// Инкремент: префиксная и постфиксная формы:
/*	int ultra = 0, super = 0;
	while (super < 5)
	{
		super++;
		++ultra;
		printf("super %d, ultra %d \n", super, ultra);
	}
*/
// Инкремент: префиксная и постфиксная формы:
/*	int a = 1, b = 1;
	int a_post, pre_b;
	while (a < 6)
	{
		a_post = a++;		// Постфиксная форма. Сначала идет присваивание значения переменной (т.е. переменной присвоится "1"), затем увеличение. Со следующей итерации происходит тоже самое;
		pre_b = ++b;		// Префиксная форма. Сначала идет увеличение, затем присваивание значения переменной (т.е. переменной присвоится "1"). Со следующей итерации происходит тоже самое
		printf("a a_post b pre_b \n");
		printf("%ld %5d %5d %5d \n", a, a_post, b, pre_b);
	}
*/
// Декрементирование:
/*	int count = MAX + 1;
	while (--count > 0)		// Префиксная форма;
	{
		printf("%d бутылок родниковой водына полке, "
			"%d бутылок родниковой воды \n", count, count);
		printf("Возьмите одну из них и пустите по кругу, \n");
		printf("%d бутылок родниковой воды! \n\n", count - 1);				// Если написать "--count", то счет дойдет до "1", а не до "0";
	}
*/

// Как не стоит применять операции инкрементирование и декрементирование:
// printf("%4d %6d \n", num, num * num++);		// Сначала компилятор увеличит значение переменной второго аргумента и только потом, выполнит действие первый аргумент;
// ans = num / 2 + 5 * (1 + num++);				// Сначала компилятор увеличит значение переменной с инкрементой, это результат запишется в переменную и только потом выполнится деление;

// n = 3;										
// y = n++ + n++;								// В данном выражении будет неопределенность;

/*
Не применять опреции инкрементирование и декрементирование к переменной, котора является частю более одного аргумента.
Не применять опреции инкрементирование и декрементирование с переменной, которая появляется в выражении более одного раза.
*/

// Пять видов операторов:
/*	int count, sum;
	count = 0;
	sum = 0;
	while (++count < 20)			// Если цикл состоит из одного оператора фигурные скобки "{}" не нужны;
		sum = sum + 1;				// Если цикл состоит из более одного оператора (составной оператор) фигурные скобки "{}" нужны;
	printf("sum = %d \n", sum);
*/
// Автоматическое присваивание типов:
/*	char ch;
	int i;
	float fl;
	fl = i = ch = 'L';						// Символ "L" имеет код "76", для типа "int", будет занимать размер "4" байта, типа "float" тоже "4" байта;
	printf("ch = %c, i = %d, fl = %2.2f \n", ch, i, fl);
	ch = ch + 2;							// Выражение с типамом данных "int" (число "2" - это тип "int"). В результате выражения будет тип "char";
	i = fl + 3 * ch;						// Выражение с разными типами данных. В результате выражения будет тип "int";
	fl = 2.0 * ch + i;						// Выражение с разными типами данных. В результате выражения будет тип "float";
	printf("ch = %c, i = %d, fl = %2.2f \n", ch, i, fl);
	ch = 1345;								// Переменная "ch" 8 бит (до 256), в результате получим усечение значения. 1345 / 256, остаток 65;
	printf("Теперь ch = %c \n", ch);		// Выведется символ согласно ASCII "А";
	ch = 93.45;								// Значение с плавующей запятой тоже усечется, будет значение "93";
	printf("Теперь ch = %c \n", ch);		// Выведется символ согласно ASCII "]";
*/
// Определяет функцию с аргументом:
/*	int times = 5;
	char ch = '!';
	float f = 6.0;
	pound(times);							// Вызов функции "pound". Вместо переменной "times" подставляется значение "5" и это значение, как аргумент принимает функция "pound";
	pound(ch);								// Вызов функции "pound". Вместо переменной "ch" подставляется значение, т.е. код символа "!" и это значение, как аргумент принимает функция "pound";
	pound(f);								// Вызов функции "pound". Вместо переменной "f" подставляется значение "6.0" и это значение, как аргумент принимает функция "pound";

	return 0;
}

void pound(int n)							// Определение функции. Любые значения, которые принимает функция, преобразуются в тип "int";
{
	while (n-- > 0)							// При переменной "times", символ "#" напечатается "5" раз, при переменной "ch" - "33" раза, при переменной "f" - раз;
		printf("#");
	printf("\n");
}
*/
// Демонстративная программа:
/*	double distk, distm;
	double rate;
	int min, sec;
	int time;
	double mtime;
	int mmin, msec;

	printf("Эта программа преобразует время пробега дистанции в метрической системе \n");
	printf("во время пробега одной мили и вычисляет вашу среднюю \n");
	printf("скорость в милях в час. \n");
	printf("Введите дистанцию пробега в километрах: \n");
	scanf_s("%lf", &distk);
	printf("Введите время в минутах и сеундах. \n");
	printf("Начните с ввода минут. \n");
	scanf_s("%d", &min);
	printf("Теперь введите секунды. \n");
	scanf_s("%d", &sec);
	// Перевод время в секунды:
	time = S_PER_M * min + sec;
	// Перевод километры в мили:
	distm = M_PER_K * distk;
	// Умножение миль в секунду на количество секунд в часе дает количество миль в час:
	rate = distm / time * S_PER_H;
	// Деление времени на расстояние дает время пробега оной мили:
	mtime = (double)time / distm;
	mmin = (int)mtime / S_PER_M;
	msec = (int)mtime % S_PER_M;
	printf("Вы пробежали %1.2f км (%1.2f мили) за %d минут, %d секунд. \n", distk, distm, min, sec);
	printf("Такая скорость соответствует пробегу одной мили за %d мин, ", mmin);
	printf("%d сек. \nВаша средняя скорость составила %1.2f миль в секунду. \n", msec, rate);
*/
// Последовательность дробей:
/*	int i = 1;
	float n;
	printf("Будьте внимательны! Далее идет последовательность дробей. \n");
	while (i++ < 30)
	{
		n = 1.0 / i;
		printf("%f \n", n);
	}
	printf("На этом все! \n");
*/
// Альтернативный вариант перевода секуны в минуты и секунды
/*	int sec, min, left;
	sec = 1;							// Для работы программы переменной присваивается значение;
	printf("Эта программа переводит секунды в минуты и ");
	printf("и секунды. \n");
	printf("Введите количество секунд. \n");
	printf("Для завершения прграммы введите 0. \n");
//	scanf_s("%d", &sec);
	while (sec > 0)
	{
//		scanf_s("%d", &sec);			// Функция ввода данных переносится в послений оператор блока операторов;
		min = sec / S_TO_M;
		left = sec % S_TO_M;			// Данну операцию можно представить как деление по модулю. Например, 150 % 60 = 150 / 60 = 2, а остаток равно 30;
		printf("%d секунд - это %d минут(ы) %d секунд. \n", sec, min, left);
		printf("Cледующее значение? \n");
		scanf_s("%d", &sec);			
	}
	printf("До свиданья! \n");
*/
// Вывод сообщения (смотреть строку 13) и оперции инкрементирование и декрементирование:
/*	int num = 10;
	printf(FORMAT, FORMAT);
	printf("%d \n", ++num);
	printf("%d \n", num++);
	printf("%d \n", num--);
	printf("%d \n", num);
*/
// Вывод символов и значения симвлов (ASCII-код) в разных типах данных:
/*	char c1, c2;
	int diff;
	float num;
	c1 = 'S';
	c2 = 'O';
	diff = c1 - c2;
	num = diff;
	printf("%c%c%c:%d %3.2f \n", c1, c2, c1, diff, num);
*/
// Счет чисел по порядку:
/*	int n = 0;
	while (n++ < TEN)
		printf("%5d", n);		// Счет начнется с "1", т.к. в прверке цикла сначала проверится старое значение, затем увеличится на "1" и в функции "printf" уже будет "1";
	printf("\n");				// И так далле происходит с последующими значениями до "10";
*/
// Алфавит по порядку:
/*	char ch = 'a';
	while (ch <= 'g')
		printf("%5c", ch++);		// Счет начнется с "1", т.к. в прверке цикла сначала проверится старое значение, затем увеличится на "1" и в функции "printf" уже будет "1";
	printf("\n");
*/
// Вывод предупреждающего сообщения:
/*	int n = 0;
	while (n < 5)					// Прграмма будет бесконечно выводить сообщение, т.к. в цикле только один оператор вывода сообщения;
		printf("%s \n", MESG);		// Если заключить два оператора в фигурные скобки, сообщение выведется "5" раз и еще одно сообщение после блока цикла "while";
	n++;
	printf("На этом все. \n");
*/

	return 0;
}
