#define _CRT_SECURE_NO_WARNINGS							// Чтобы копилятор не выдавал ошибку на функцию "scanf()";
#include <stdio.h>
#include <locale.h>

int main(void)
{
	setlocale(LC_ALL, "RUS");

	/* Задание 1: */
	int a = 2147483647;									// Максимальный диапазон;
	printf("%d помещается в диапазон, \n", a);
	a = a + 5;
	printf("%d происходит переплнение. \n", a);			// Получится число -2147483644;
	long b = 2147483647;								// Максимальный диапазон;
	printf("%ld помещается в диапазон, \n", b);
	b = b + 1;	
	printf("%ld происходит переплнение. \n", b);		// Получится число -2147483648;
	unsigned c = 2147483647;
	printf("%u помещается в диапазон, \n", c);			// Максимальный диапазон 4 294 967 295;
	c = c + 6;
	printf("%u так же помещается в диапазон. \n", c);	// Получится число 2147483653;
	c = c * 2;
	printf("%u происходит переплнение. \n\n\n", c);			// Получится число 10;

	float d = 3.4e09;
	printf("%f максимальное значение для передачи точности. \n", d);
	d = 3.4e10;
	printf("%f - данное значение теряет точность. \n", d);
	d = 3.4e38;
	printf("%f - максимальное значение и не точное. \n", d);
	d = 3.405e38;
	printf("%f - выводится сообщение \"inf\" - бесконечность. \n", d);
	d = 1.2e-45;
	printf("%.50f - минимальное значение, когда выводятся еще какие-то значения после запятой. \n", d);
	d = 1.2e-46;
	printf("%.50f - выводятся одни нули. \n\n", d);

	double e = 1.8e307;										// Почти предельный диапазон, если больше компилятор выдаст ошибку;
	printf("%f - не точное значение. \n", e);
	e = 1.8e22;
	printf("%f -  максимальное точное значение. \n", e);
	e = 1.8e23;										
	printf("%f -  уже  не точное значение. \n", e);
	e = 2.2e-100;
	printf("%.100f - минимальное значение, когда выводятся еще какие-то значения после запятой. \n", e);
	e = 2.2e-308;											// Почти минимальное значение, еще меньше делать не имеет смысла;
	printf("%.100f - уже теряется значимость, одни нули. \n\n", e);

	/* Задание 2: */
/*	int ch;
	printf("Введите код символа согласно ASCII: ");
	scanf_s("%d", &ch);							// В функции "scanf_s" не надо прописывать символы управляющей последовательности \n, \t, \r, \b, \a;
	printf("Символ \'%c\' соответствует коду ASCII %d \n\n", ch, ch);
*/
/* Задание 3: */
	printf("\aНапуганная внезапным звуком, Вика воскрикнула: \n");
	printf("\"Во имя всех звезд, что это было!\" \n\n");

/* Задание 4: */
	float drob = 64.25;
	printf("%f \n", drob);
	printf("%e \n", drob);
	printf("%a \n", drob);
	printf("%.2f \n\n", drob);

	double drob_1 = 273.259528568;
	printf("%f \n", drob_1);
	printf("%e \n", drob_1);
	printf("%a \n", drob_1);
	printf("%.10f \n\n", drob_1);

/* Задание 5: */
/*	int age;
	float second_life;
	float second = 3.156e07;
	printf("Введите свой возраст в годах: ");
	scanf_s("%d", &age);
	second_life = age * second;
	printf("%f секунд прожито за %d лет \n\n", second_life, age);
*/
	/* Улучшенный вариант записи: */
	int age;
	printf("Введите свой возраст в годах: ");
	scanf_s("%d", &age);
	printf("%.2f или в научном формате %e секунд прожито за %d лет.\n\n", age * 3.156e07, age * 3.156e07, age);

/* Задание 6: */
	double massa_mol = 3.0e-23;
	double quarta_massa = 950.0;
	double quarta, total_mol;
	printf("Введите объем воды в квартах: ");
	scanf_s("%lf", &quarta);
	total_mol = (quarta * quarta_massa) / massa_mol;
	printf("Количество молекул воды составляет %.3f (или %.3e) в %.3f кварт воды. \n\n", total_mol, total_mol, quarta);

/* Задание 7: */
	float height;
	printf("Введите сворост в сантиметрах: ");
	scanf_s("%f", &height);
	printf("Рост в дюймах составляет %.2f. \n\n", height / 2.54);

/* Задание 8: */
/*	float cup;
	printf("Введите объем в чашках: ");
	scanf_s("%f", &cup);
	printf("В %.2f чашке(ах), содержится %.2f пинта(ы), %.2f унции(ий), %.2f столовых(ая) ложек(ка), %.2f чайных(ая) ложек(ка). \n\n", 
			cup, cup / 2, cup * 8, cup * 8 * 2, cup * 8 * 2 * 3);
*/
	/* Другой вариант: */
	float tea_boat;
	float dining_boat;
	float unciya;
	float cup;
	float pinta;
	printf("Введите объем в чашках: ");
	scanf("%f", &cup);
	pinta = cup / 2;
	unciya = cup * 8;
	dining_boat = unciya * 2;
	tea_boat = dining_boat * 3;
	printf("В %.2f чашке(ах), содержится %.2f пинта(ы), %.2f унции(ий), %.2f столовых(ая) ложек(ка), %.2f чайных(ая) ложек(ка). \n\n",
		cup, pinta, unciya, dining_boat, tea_boat);

	return 0;
}