#include <stdio.h>
#include <string.h>                 // Бибилиотека для работы функции "strlen";
#include <locale.h>                 // Для вывода символов на русском языке;
#include <windows.h>                // Библиотека для ввода/вывода в функции "scanf" русских символов;
#include <limits.h>                 // Библиотека для целочислинных типов. Диапазон типов данных;
#include <float.h>                  // Библиотека для типов с плавающей запятой. Диапазон типов данных;

int main()
{
    setlocale(LC_ALL, "RUS");       // Для ввода/вывода на консоле русских символов;
    SetConsoleCP(1251);             // Настройка ввода на кириллицу;
    SetConsoleOutputCP(1251);       // Настройка вывода на кириллицу;

    // Вывод на монитор сообщения с разерами разных типов данных:
    printf("Пределы чисел для данной системы: \n");
    printf("Количество битов в типе char: %d; \n", CHAR_BIT);
    printf("Максимальное значение типа char: %d; \n", CHAR_MAX);
    printf("Минимальное значение типа char: %d; \n", CHAR_MIN);
    printf("Максимальное значение типа signed char: %d; \n", SCHAR_MAX);
    printf("Минимальное значение типа signed char: %d; \n", SCHAR_MIN);
    printf("Максимальное значение типа unsigned char: %d; \n\n", UCHAR_MAX);
    printf("Максимальное значение типа short: %d; \n", SHRT_MAX);
    printf("Минимальное значение типа short: %d; \n", SHRT_MIN);
    printf("Максимальное значение типа unsigned short: %d; \n\n", USHRT_MAX);
    printf("Максимальное значение типа int: %d; \n", INT_MAX);
    printf("Минимальное значение типа int: %d; \n", INT_MIN);
    printf("Максимальное значение типа unsigned int: %u; \n\n", UINT_MAX);
    printf("Максимальное значение типа long: %ld; \n", LONG_MAX);
    printf("Минимальное значение типа long: %ld; \n", LONG_MIN);
    printf("Максимальное значение типа unsigned long: %ul; \n\n", ULONG_MAX);
    printf("Максимальное значение типа long long: %lld; \n", LLONG_MAX);
    printf("Минимальное значение типа long long: %lld; \n", LLONG_MIN);
    printf("Максимальное значение типа unsigned long long: %llu; \n\n", ULLONG_MAX);

    printf("Количество бит в мантисе типа float: %d \n", FLT_MANT_DIG);
    printf("Минимальное количество значащих дестичных цифр (точность значения) типа float: %d знаков. \n", FLT_DIG);
    printf("Минимальное значение отрицательного десятичного порядка для типа float с полным набором значащих цифр: %d. \n", FLT_MIN_10_EXP);
    printf("Максимальное значение положительного десятичного порядка для типа float с полным набором значащих цифр: %d. \n", FLT_MAX_10_EXP);
    printf("Минимальное значение для положительного числа типа float, сохраняющего полную точность: %e. \n", FLT_MIN);
    printf("Максимальное значение для положительного числа типа float, сохраняющего полную точность: %e. \n", FLT_MAX);
    printf("Разница между 1.00 и минимальным значением float, которое больше 1.00: %e. \n\n", FLT_EPSILON);

    printf("Количество бит в мантисе типа double: %d \n", DBL_MANT_DIG);
    printf("Минимальное количество значащих дестичных цифр (точность значения) типа double: %d знаков. \n", DBL_DIG);
    printf("Минимальное значение отрицательного десятичного порядка для типа double с полным набором значащих цифр: %d. \n", DBL_MIN_10_EXP);
    printf("Максимальное значение положительного десятичного порядка для типа double с полным набором значащих цифр: %d. \n", DBL_MAX_10_EXP);
    printf("Минимальное значение для положительного числа типа double, сохраняющего полную точность: %e. \n", DBL_MIN);
    printf("Максимальное значение для положительного числа типа double, сохраняющего полную точность: %e. \n", DBL_MAX);
    printf("Разница между 1.00 и минимальным значением double, которое больше 1.00: %e. \n\n", DBL_EPSILON);

    printf("Количество бит в мантисе типа long double: %d \n", LDBL_MANT_DIG);
    printf("Минимальное количество значащих дестичных цифр (точность значения) типа long double: %d знаков. \n", LDBL_DIG);
    printf("Минимальное значение отрицательного десятичного порядка для типа long double с полным набором значащих цифр: %d. \n", LDBL_MIN_10_EXP);
    printf("Максимальное значение положительного десятичного порядка для типа long double с полным набором значащих цифр: %d. \n", LDBL_MAX_10_EXP);
    printf("Минимальное значение для положительного числа типа long double, сохраняющего полную точность: %le. \n", LDBL_MIN);
    printf("Максимальное значение для положительного числа типа long double, сохраняющего полную точность: %le. \n", LDBL_MAX);
    printf("Разница между 1.00 и минимальным значением long double, которое больше 1.00: %le. \n\n", LDBL_EPSILON);

    printf("Размер double: %zu байт\n", sizeof(double));
    printf("Размер long double: %zu байт\n", sizeof(long double));

    /* В данном случае компилятор Visual Studio покажет, что размеры типов данных "double" и "long double" одинаковы. */

    return 0;
}