#include <stdio.h>								// "#include" - директива препроцессора. Подключение библиотеки ввода/вывода. Для работы с операторам "printf";
#include <locale.h>

void power(void);								// Прототип функции "power";
void week(void);								// Прототип функции "week";
void text(void);								// Прототип функции "text";
void text_1(void);								// Прототип функции "text_1";

int main(void)									// Главная функция,которая ничего не принимает, но возвращет значение типа "int";
{
	setlocale(LC_ALL, "Rus");					// Функция для настройки вывода сообщения на русском языке на монитор (что бы избежать искажения текста);

	int num;									// Объявление локальной переменной "num" типа "int";
	int voltage, current, resistor;
	num = 1;									// Переменной "num" присваивается значение "1";
	voltage = 220;
	current = 5;

	printf("Я простой ");						// Вывод текста с помощью функции "printf";
	printf("компьютер. \n");					// Вывод тескта с помощью функции "printf". С помощью "\n" происходит перемещение курасора на начало следующей строки;
	printf("Моей любимой цифрой является %d, так она первая. \n", num);			// Вывод текста с помощью функции "printf"."%d" специфиатор для вывода целых десятчных значений, используется только с типом "int".
																				// Чтобы выести значение в конце оператора прописана переменная "num", которая равна "1". В итоге вместо "%d" на экран выведется "1";
	printf("Good program. \n\n");

	resistor = voltage / current;
	printf("Сопротивление R вычисляется из отношения напряжения V на ток I. \n");
	printf("R = V/I = %d/%d = 44 ОМ. \n", voltage, current);					// Первый спецификатор "%d" относится к "voltage", второй "%d" к "current";

	power();									// Вызов функции "power";

	week();										// Вызов функции "week";

	text();										// Вызов функции "text";

	text_1();									// Вызов функции "text_1";


//	getchar();									// Функция "getchar()" используется, чтобы консоль сразу после вывода текста не закрывалась;

	return 0;									// Оператор возврата;
}

void power(void)								// Определение функции "power";
{
	printf("Мощность вычисляетсяпо формуле W = V * I. \n");
	printf("W = 220 * 5 = 1100 Вт или 1,1 кВт. \n\n");
}