#pragma once
char* s_gets(char* mass, int size);				// Каталог для одной книги. Данная функция применяется для многих программ этого раздела;

// Каталог для одно книги:
/*
#define MAXTITL	41								// Каталог для одно книги. Максимальная длина названия, +1 (запас) для символа конца строки '\0;
#define MAXAUTL	31								// Каталог для одно книги. Максимальная длина имени автора, +1 (запас) для символа конца строки '\0;
struct book										// Шаблон структуры (глобальный): дискриптором является book;
{
	char title[MAXTITL];						// Поле для названия книги. Размер массива типа char 41;
	char author[MAXAUTL];						// Поле для ФИО автора. Размер массива типа char 31;
	float value;								// Поле для цены книги;
};												// Конец шаблона структуры;
*/

// Каталог для нескольких книг:
/*
#define MAXTITL	40								// Каталог для нескольких книг. Максимальная длина названия 40 символов включая символ конца строки '\0;
#define MAXAUTL	40								// Каталог для нескольких книг. Максимальная длина имени автора 40 символов включая символ конца строки '\0;
#define MAXBKS	100								// Каталог для нескольких книг. Максимальное количество книг 100;
struct book
{
	char title[MAXTITL];						// Поле для названия книги. Размер массива типа char 40;
	char author[MAXAUTL];						// Поле для ФИО автора. Размер массива типа char 30;
	float value;								// Поле для цены книги;
};												// Конец шаблона структуры;
*/


// Пример вложенной структуры:
/*
#define LEN	20									// Пример вложенной структуры;
static const char* msgs[5] =					// Массив из 5 указателей на неизменяемые строки. Модификатор static делает этот массив видимым только в пределах текущего файла;
{
	"	Благодарю Вас за чудесно проведенный вечер, ",
	"Вы однозначно продемонстрировали, что ",
	"являет собою особенный тип мужчины. Мы обязательно должны встретиться",
	"за восхитительным ужином с ",
	"и весело провести время."
};

struct names									// Объявление структуры типа names;
{
	char first[LEN];							// Поле структуры names (массив);
	char last[LEN];								// Поле структуры names (массив);
};
struct guy										// Объявление структуры типа guy;
{
	struct names handle;						// Вложенная структура names в структуру guy;
	char favfood[LEN];							// Поле структуры guy (массив);
	char job[LEN];								// Поле структуры guy (массив);
	float income;								// Поле структуры guy (переменная);	
};
*/

// Использование указателей на структуры:
/*
#define LEN	20									// Использование указателей на структуры;
struct names									// Объявление структуры типа names;
{
	char first[LEN];							// Поле структуры names (массив);
	char last[LEN];								// Поле структуры names (массив);
};
struct guy										// Объявление структуры типа guy;
{
	struct names handle;						// Вложенная структура names в структуру guy;
	char favfood[LEN];							// Поле структуры guy (массив);
	char job[LEN];								// Поле структуры guy (массив);
	float income;								// Поле структуры guy (переменная);	
};
*/

// Передача членов структуры в качестве аргументов:
/*
#define FUNDLEN	50
struct funds									// Объявление структуры типа funds;
{
	char bank[FUNDLEN];							// Поле структуры funds (массив);
	double bankfund;							// Поле структуры funds (переменная);
	char save[FUNDLEN];							// Поле структуры funds (массив);
	double savefund;							// Поле структуры funds (переменная);
};
double sum(double, double);						// Прототип функции, которая принимает значения переменных типа double;
*/

// Передача указателя на структуру:
/*
#define FUNDLEN	50
struct funds									// Объявление структуры типа funds;
{
	char bank[FUNDLEN];							// Поле структуры funds (массив);
	double bankfund;							// Поле структуры funds (переменная);
	char save[FUNDLEN];							// Поле структуры funds (массив);
	double savefund;							// Поле структуры funds (переменная);
};
double sum(const struct funds*);				// Прототип функции, который принимает указатель на переменную типа funds*. Модификатор const запрещает менять данные полей структуры;
*/

// Передача структуры в качестве аргумента:
/*
#define FUNDLEN	50
struct funds									// Объявление структуры типа funds;
{
	char bank[FUNDLEN];							// Поле структуры funds (массив);
	double bankfund;							// Поле структуры funds (переменная);
	char save[FUNDLEN];							// Поле структуры funds (массив);
	double savefund;							// Поле структуры funds (переменная);
};
double sum(struct funds moolah);				// В качестве аргумента передается сама структура;
*/

// Использование указателей на структуры:
/*
#define NLEN	30
struct namect									// Объявление структуры типа namect;
{
	char fname[NLEN];
	char iname[NLEN];
	int letters;
};
void getinfo(struct namect*);					// Прототип функции, которая принимает указатель на переменную типа структуры namect;
void makeinfo(struct namect*);					// Прототип функции, которая принимает указатель на переменную типа структуры namect;
void showinfo(const struct namect*);			// Прототип функции, которая принимает указатель на переменную типа структуры namect. Модификатор const защищает поля структуры от случайных изменений;
*/

// Передача и возврат структуры:
/*
#define NLEN	30
struct namect									// Объявление структуры типа namect;
{
	char fname[NLEN];
	char iname[NLEN];
	int letters;
};
struct namect getinfo(void);					// Прототип функции, которая ничего не принимает, но возвращает структуру типа namect;
struct namect makeinfo(struct namect);			// Прототип функции, которая принимает структуру типа namect и возвращает структуру типа namect;
void showinfo(const struct namect);				// Прототип функции, которая принимает структуру типа namect. Модификатор const защищает поля структуры от случайных изменений;
*/

// Использование указателей и функции malloc:
/*
#define SLEN	81
struct namect
{
	char* fname;								// Указатель на строку;
	char* iname;								// Указатель на строку;
	int letters;								// Переменная;
};
void getinfo(struct namect*);					// Прототип функции, которая принимает указатель на переменную типа структуры namect;
void makeinfo(struct namect*);					// Прототип функции, которая принимает указатель на переменную типа структуры namect;
void showinfo(const struct namect*);			// Прототип функции, которая принимает указатель на переменную типа структуры namect. Модификатор const защищает поля структуры от случайных изменений;
void cleanup(struct namect*);					// Прототип функции, которая принимает указатель на переменную типа структуры namect;
*/

// Составные литералы:
/*
#define MAXTITL	41
#define MAXAUTL	31
struct book										// Шаблон структуры (глобальный): дискриптором является book;
{
	char title[MAXTITL];						// Поле для названия книги. Размер массива типа char 41;
	char author[MAXAUTL];						// Поле для ФИО автора. Размер массива типа char 31;
	float value;								// Поле для цены книги;
};
*/

// Член гибкого массива:
/*
struct flex
{
	size_t count;								// Тип size_t - универсальный тип, для разных систем ОС, данный тип всегда положительный. В основном предназначен для счета памяти и размера элементов массива;
	double average;
	double scores[];							// Член гибкого массива. Должен быть последним членом структуры и перед этим членом должен быть еще член другого типа;
};
void showFlex(const struct flex* p);			// Для работы со структурой, содержащей член гибкого массива, в функцию необходимо передавать только указатель на переменную типа структуры, поскольку размер массива заранее неизвестно;
*/

// Передача функции массива структур :
/*
#define FUNDLEN	50
#define N		2
struct funds											// Объявление структуры типа funds;
{
	char bank[FUNDLEN];									// Поле структуры funds (массив);
	double bankfund;									// Поле структуры funds (переменная);
	char save[FUNDLEN];									// Поле структуры funds (массив);
	double savefund;									// Поле структуры funds (переменная);
};
double sum(const struct funds money[], int size);		// Функция принимает массив типа структуры и размер этого массива. При этом поля структуры защищены от случайного изменения;
*/

// Сохранение содержимого в файле:
/*
#define MAXTITL	40
#define MAXAUTL	40
#define	MAXBKS	10
struct book
{
		char title[MAXTITL];						// Поле для названия книги. Размер массива типа char 41;
		char author[MAXAUTL];						// Поле для ФИО автора. Размер массива типа char 31;
		float value;								// Поле для цены книги;
};
*/

// Использование перечислимых значение (enum):
/*
#define LEN		30
enum spectrum { red, orange, yellow, green, blue, violet };									// Перечисляемый тип spectrum, который содержит константы в виде имен (цвета). Которые соответствуют целочисленным значениям red = 0, orange = 1 и т.д.;
static const char* colors[] = { "red", "orange", "yellow", "green", "blue", "violet" };		// Массив состоящий из указателей на строки, который защищен от случайного изменения модификатором const. static - создает видимость массива указателей только в этом файле. 
																							// При добавлении #include "Function.h" в Structures.c создается чертеж "static const char* colors[]....". И при компиляции в памяти создается копия массива colors с этой копией работает файл Structures.с. 
																							// Модификатор static убирает глобальность, чтобы при сборке линковщик мог четко определить какой массив брать в определенном файле программы.
																							// Данный массив можно переместить в main для экономии памяти;
*/

// Использование указателей на функции:
/*
#define LEN 81
char showmenu(void);
void eatline(void);									// Показывает меню;
void show(void(*fp)(char*), char* str);				// Функция принимает адрес функции и адрес начала массива и выводит строку на монитор;
void ToUpper(char*);								// Преобразует строку в верхний регстр;
void ToLower(char*);								// Преобразует строку в нижний регистр;
void Transpose(char*);								// Меняет местами регистры;
void Dummy(char*);									// Оставляет строку неизменной;
*/

