#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <ctype.h>
#include "Function.h"


char* s_gets(char* mass, int size)
{
	char* ret_val;									// Указатель на адрес начала массива;
	char* find;										// Указатель на адрес символа;
	ret_val = fgets(mass, size, stdin);				// Если ввели текст, то указателю запишется адрес текста;
	if (ret_val)									// Если есть адрес, то истина. Если текст не вводили, то ложь;
	{
		find = strchr(mass, '\n');					// Когда функция strchr найдет символ новой строки, то запишется адрес этого символа в указатель, где находится этот символ.
		if(find)									// Если размер массива вмещает все символы включая символ новой строки, то функция strchr найдет символ новой строки.								 
			*find = '\0';							// При разименовании указателя будет символ новой строки, который нашла функция strchr. Далее по указателю присвоится символ конца строки;
		else
			while ((getchar()) != '\n')				// Очистка буфера от лишних символов;
				continue;
	}
	return ret_val;									// Функция возвращает адрес начала строки (текста);
}


// Передача членов структуры в качестве аргументов:
/*
double sum(double x, double y)
{
	return (x + y);									// Функция возвращает сумму значений двух переменных;
}
*/

// Передача указателя на структуру:
/*
double sum(const struct funds* money)
{
	return (money -> bankfund + money -> savefund); // Через указатель money заходим внутрь структуры, далее берем значение поля (переменной) bankfund, тоже самое через указатель money заходим внутрь структуры, далее берем значение поля (переменной) savefund.
}													// Эти значения суммируются и функция sum() возвращает эту сумму. money -> bankfund равнозначно (*money).bankfund;
*/

// Передача структуры в качестве аргумента:
/*
double sum(struct funds moolah)						// Создается автоматическя переменная moolah типа структуры funds? в которую копируются поля переменной stan типа структуры funds (поля инициализируются). По завершении работы функции sum, переменная moolah пропадает, вместе с ней и поля;
{
	return (moolah.bankfund + moolah.savefund);		// Через переменную moolah типа структуры funds получаем доступ к значению поля bankfund (перемнной), также через переменную moolah типа структуры funds получаем доступ к значению поля savefund (перемнной).
}													// Эти значения суммируются и функция sum() возвращает эту сумму;
*/

// Использование указателей на структуры:
/*
void getinfo(struct namect* pst)
{
	printf("Введите свое имя. \n");
	s_gets(pst->fname, NLEN);								// В функцию передается 2 аргумента. 1 аргумент - указатель pst указывает на структуру типа namect и берет поле (массив) fname[]. 2 аргумент - размер массива;
	printf("Введите свою фамилию. \n");
	s_gets(pst->iname, NLEN);								// В функцию передается 2 аргумента. 1 аргумент - указатель pst указывает на структуру типа namect и берет поле (массив) iname[]. 2 аргумент - размер массива;
}

void makeinfo(struct namect* pst)
{
	pst->letters = strlen(pst->fname) + strlen(pst->iname);	// pst->letters - указатель pst указывает на переменную letters типа структуры namect. Этому полю присвоится значение суммы длин строк.
}															// strlen(pst->fname) - функция определит сколько символов содержит строка без учета символа конца строки. Определит сколько символов содержит массив fname и iname;

void showinfo(const struct namect* pst)
{
	printf("%s %s, ваше имя и фамилия содержит %d букв. \n", pst->fname, pst->iname, pst->letters);	// Вывод текста на монитор. pst->fname - указатель pst указывает на массив fname.  pst->iname - указатель pst указывает на массив iname. pst->letters - указатель pst указывает на переменную letters. 
}																									// По другому говоря, выведутся введенные строки и значение;
*/

// Передача и возврат структуры:
/*
struct namect getinfo(void)
{
	struct namect temp;										// Объявление перменной (локальная или временная) типа структуры;
	printf("Введите свое имя. \n");
	s_gets(temp.fname, NLEN);								// В функцию передается 2 аргумента. 1 аргумент - в переменной temp типа структуры namect, берем массив (fname[]) и этот массив передается функции. 2 аргумент - размер массива;
	printf("Введите свою фамилию. \n");
	s_gets(temp.iname, NLEN);								// В функцию передается 2 аргумента. 1 аргумент - в переменной temp типа структуры namect, берем массив (iname[]) и этот массив передается функции. 2 аргумент - размер массива;
	return temp;											// Функция возвращает переменную (копию) типа структуры;
}

struct namect makeinfo(struct namect info)
{
	info.letters = strlen(info.fname) + strlen(info.iname);	// В переменной info типа структуры namect, берем переменную (letters). Этой переменной присвоится значение суммы длин строк.
															// strlen(info.fname) - функция определит сколько символов содержит строка без учета символа конца строки. Определит сколько символов содержит массив fname и iname;
	return info;											// Функция возвращает переменную (копию) типа структуры;
}															


void showinfo(const struct namect info)
{
	printf("%s %s, ваше имя и фамилия содержит %d букв. \n", info.fname, info.iname, info.letters);	// Вывод текста на монитор. info.fname - переменная типа структуры, в ней берем массив fname. info.iname - переменная типа структуры, в ней берем массив iname. info.letters - переменная типа структуры, в ней берем переменную letters. 
}																									// По другому говоря, выведутся введенные строки и значение;
*/

// Использование указателей и функции malloc:
/*
void getinfo(struct namect* pst)
{
	char temp[SLEN];
	printf("Введите свое имя. \n");
	s_gets(temp, SLEN);										// В функцию передается 2 аргумента. 1 аргумент - массив куда запишется имя. 2 аргумент - размер массива;
	pst->fname = (char*)malloc(strlen(temp) + 1);			// Выделение динамической памяти под строку с учетом символа конца строки. strlen(temp) определит сколько байт нужно в памяти выделить.
	if (pst->fname != NULL)									// pst->fname - указатель хранит адрес для строки, на которую указвает указатель pst в динамической памяти (куча). fname - указатель указывает на строку в выделенную в динамической памяти.
	{														// Если запись успешно завершилась, то произойдет копирование в выделенную память;
		strcpy_s(pst->fname, strlen(temp) + 1, temp);		// Строка массива temp[] копируется в выделенную динамическую память;
	}
	printf("Введите свою фамилию. \n");
	s_gets(temp, SLEN);										// В функцию передается 2 аргумента. 1 аргумент - массив куда запишется имя. 2 аргумент - размер массива;
	pst->iname = (char*)malloc(strlen(temp) + 1);			// Выделение динамической памяти под строку с учетом символа конца строки. strlen(temp) определит сколько байт нужн
	if (pst->iname != NULL)									// pst->iname - указатель хранит адрес для строки, на которую указвает указатель pst в динамической памяти (куча). iname - указатель указывает на строку в выделенную в динамической памяти.
	{														// Если запись успешно завершилась, то произойдет копирование в выделенную память;
		strcpy_s(pst->iname, strlen(temp) + 1, temp);		// Строка массива temp[] копируется в выделенную динамическую память;
	}
}

void makeinfo(struct namect* pst)
{
	pst->letters = strlen(pst->fname) + strlen(pst->iname);	// pst->letters - указатель pst указывает на переменную letters типа структуры namect. Этому полю присвоится значение суммы длин строк.
}															// strlen(pst->fname) - функция определит сколько символов содержит строка без учета символа конца строки. Определит сколько символов содержит строка, на которую указвают указатели fname и iname;

void showinfo(const struct namect* pst)
{
	printf("%s %s, ваше имя и фамилия содержит %d букв. \n", pst->fname, pst->iname, pst->letters);	// Вывод текста на монитор. pst->fname - указатель pst указывает на переменную типа namect, в которой указатель fname указывает на строку в выделенной динамической памяти.  
}																									// pst->iname - указатель pst указывает на переменную типа namect, в которой указатель iname указывает на строку в выделенной динамической памяти. pst->letters - указатель pst указывает на переменную letters. 

void cleanup(struct namect* pst)
{
	free(pst->fname);										// Освобождение динамической памяти, выделенной под строку;
	pst->fname = NULL;										// Обнуляем указатель, чтобы он не смотрел на "мертвый" адрес;
	free(pst->iname);										// Освобождение динамической памяти, выделенной под строку;
	pst->iname = NULL;										// Обнуляем указатель, чтобы он не смотрел на "мертвый" адрес;
}
*/

// Член гибкого массива:
/*
void showFlex(const struct flex* p)
{
	int i;
	printf("Рейтинг. \n");
	for (i = 0; i < p->count; i++)							// p->count - через указатель на структуру типа flex, в которой берем переменную count;
		printf("%g ", p->scores[i]);						// p->scores[i] - через указатель на структуру типа flex, в которой берем элемент гибкого массива. %g - универсальный спецификатор, который сам определяет какой тип переменной используется, который убирает нули в вещественных числах (был 25.56000 стал 25.56);
	printf("\nСреднее значение: %g \n", p->average);		// p->average - через указатель на структуру типа flex, в которой берем переменную average;
}
*/

// Передача функции массива структур:
/*
double sum(const struct funds money[], int size)
{
	double total;
	int i;
	for (i = 0, total = 0; i < size; i++)					// Цикл сложения значений переменных bankfund, savefund и total;
		total += money[i].bankfund + money[i].savefund;		// money[i].bankfund - заходим в массив типа структуры под индесом [i], берем переменную bankfund. Аналогично с money[i].savefund. Складываем эти 2 переменные плюс переменную total. Результат записывается в переменную total;
	return total;											// Функция возвращает значение total;
}
*/

// Использование указателей на функции:
/*
char showmenu(void)
{
	char ans;													// Локальная переменная для символа;
	puts("Введите выбранный вариант из меню: ");
	puts("u) нижний регистр		l) верхний регистр");
	puts("t) поменять метсами регистры	o) исходный регистр");
	puts("n) следующая строка");
	ans = getchar();											// Функция забирает первый введенный символ и переменной записывается символ;
	ans = tolower(ans);											// Функция предназанчена если символ в меню введен большим регистром;
	eatline();													// Вызов функции для очистки буфера после работы функции getchar();
	while (strchr("ulton", ans) == NULL)						// Проверка цикла, функция ищет первое совпадение симвала (2 аргумент), в строке (1 аргумент). Если символ не совпал не с одним символом строки, функция возвращает NULL;
	{
		puts("Введите u, l, t, o или n:");
		ans = tolower(getchar());								// Снова вводим символ, функция tolower принимавет введенный символ. Функция предназанчена если символ в меню введен большим регистром; 
		eatline();												// Вызов функции для очистки буфера после работы функции getchar();
	}															// В следующей итерации снова происходит проверка введенного символа с помощью функции strchr;
	return ans;													// Функция возвращает введенный символ;
}

void eatline(void)
{
	while (getchar() != '\n')									// Очистка буфера от лишних символов;
		continue;
}

void ToUpper(char* str)											// Функция принимает адрес начала массива (строки);
{
	while (*str)												// Если при разыменовании строка пустая, то первым же символом окажется '\0' (ноль), приобразовывать нечего;
	{
		*str = toupper(*str);									// Сначала разыменовывается указатель *str, достаем символ, далее функция toupper() принимает этот символ и переводит в верхний регистр. Приобразованный символ присваивается вновь этому же указателю *str; 
		str++;													// Сдвиг на следующий элемент массива (строки);
	}
}

void ToLower(char* str)											// Функция принимает адрес начала массива (строки);
{
	while (*str)												// Если при разыменовании строка пустая, то первым же символом окажется '\0' (ноль), приобразовывать нечего;
	{
		*str = tolower(*str);									// Сначала разыменовывается указатель *str, достаем символ, далее функция toupper() принимает этот символ и переводит в нижний регистр. Приобразованный символ присваивается вновь этому же указателю *str; 
		str++;													// Сдвиг на следующий элемент массива (строки);
	}
}

void Transpose(char* str)										// Функция принимает адрес начала массива (строки);
{
	while (*str)												// Если при разыменовании строка пустая, то первым же символом окажется '\0' (ноль), приобразовывать нечего;
	{
		if (islower(*str))										// Проверка условия, если при разыменовании указателя символ окажется в нижнем регистре, 
			*str = toupper(*str);								// то функция toupper() переведет в верхний регистр и этот символ присвоится указателю;
		else if (isupper(*str))									// Проверка условия, если при разыменовании указателя символ окажется в верхнем регистре, 
			*str = tolower(*str);								// то функция tolower() переведет в нижний регистр и этот символ присвоится указателю;
		str++;													// Сдвиг на следующий элемент массива (строки);
	}
}

void Dummy(char* str)											// Функция принимает адрес начала массива (строки);
{
	// Оставляем строку неизменной;								// Функция-заглушка, оставляет символы строки неизменными;
}

void show(void(*fp)(char*), char* str)							// Конструкцию void(*fp)(char*) можно представить как, например, ToUpper(copy) - это функция которая принмает адрес начала массива.
{																// Заголовок функции show. Она принимает адрес кода любой функции в fp и адрес массива в str.
	(*fp)(str);													// Этот универсальный шаблон превращается в реальный вызов, например: ToUpper(copy);
	puts(str);													// Выводим измененную строку на экран;
}
*/

/*
	ЗАГОЛОВОК:      void ( *fp )( char* ),  char* str		   ((*fp)			(char*))
                         │					    │				  │				   │
                         ▼                      ▼				  ▼				   ▼
	ВЫЗОВ:            ( *fp )                ( str );		   ToUpper			  copy
*/

/*
void ToUpper(char*); 
void ToLowert(char*); 
void (*pf) (char*); 
char mis[] = "Nina Metier"; 
pf = ToUpper;
(*pf)(mis);						// Применить ToUpper к mis (первый синтаксис);
pf = ToLower;
pf(mis);						// Применить ToLower к mis (второй синтаксис);
								// (*pf)(mis) равнозначно pf(mis);

void show(void (*fp) (char*), char* str);
show(ToLower, mis);				// show() использует функцию ToLower(): fp = ToLower;
show(pf, mis);					// show() использует функцию, указанную посредством pf: fp = pf;
*/
