// Использование операций с битами для отображений двоичного предстваления чисел:
/*
#pragma once
char* itobs(int, char*);
void show_bstr(const char*);
*/

// Еще вариант использования операций с битами для отображений двоичного предстваления чисел (с инвертированием последних 4 битов):
/*
#pragma once
char* itobs(int, char*);
void show_bstr(const char*);
int invert_end(int num, int bits);
*/

// Определение и использование полей:
/*
// Стили линии:
#pragma once
#define SOLID	0
#define DOTTED	1
#define DASHED	2
// Основые цвета:
#define BLUE	4
#define GREEN	2
#define RED		1
// Смешанные цвета:
#define BLACK	0
#define YELLOW	(RED | GREEN)			// Смешивание цветов. RED и GREEN имеют код 001 и 010 соответственно. При наложении одного цвета на другой получаем 011; 
#define	MAGENTA	(RED | BLUE)			// Смешивание цветов. RED и BLUE имеют код 001 и 100 соответственно. При наложении одного цвета на другой получаем 101; 
#define CYAN	(GREEN | BLUE)			// Смешивание цветов. GREEN и BLUE имеют код 010 и 100 соответственно. При наложении одного цвета на другой получаем 110; 
#define WHITE	(RED | GREEN | BLUE)	// Смешивание цветов. RED, GREEN и BLUE имеют код 001, 010 и 100 соответственно. При наложении одного цвета на другой получаем 111; 

extern const char* colors[8];			// Массив из 8 указатель на строковый на строки. Квалификатор extern дает понял компилятору, что в программе существует этот массив. 
										// При сборке линкер соберет все файлы программы и компилятор найдет связь с этим массивом;
struct box_props						// Структура типа box_props имеет размер 4 байта. 16 бит занято, 16 бит остаются пустыми;
{
	bool opaque					: 1;	// Флаг для режима "прозрачный/непрозрачный". Занимает 1 бит структуры. В поле задействован 0 бит;
	unsigned int fill_color		: 3;	// Переменная отвечающая за заливку цвета.  Занимает 3 бита структуры. В поле задействован 1, 2, 3 биты;
	unsigned int				: 4;	// Далее идут пустые, незадействованные биты 4, 5, 6, 7;
	bool show_border			: 1;	// Флаг для режима "рамка включена/рамка выключена". Занимает 1 бит структуры. В поле задействован 8 бит;
	unsigned int border_color	: 3;	// Переменная отвечающая за цвет рамки. Занимает 3 бита структуры. В поле задействован 9, 10, 11 биты;
	unsigned int border_style	: 2;	// Переменная отвечающая за стиль рамки пунктирная/сплошная рамка. Занимает 2 бита структуры. В поле задействован 12, 13 биты;
	unsigned int				: 2;	// Далее идут пустые, незадействованные биты 14, 15; 
};

void show_settings(const struct box_props* pb);	// Функция для вывода настроек. Принимает константный указатель на структуру, который сможет защитить от случайных изменений значений массива;
*/
 
// Битовые поля и побитовые операции:
/*
#pragma once
// Стили линии:
#pragma once
#define SOLID	0
#define DOTTED	1
#define DASHED	2
// Основые цвета:
#define BLUE	4
#define GREEN	2
#define RED		1
// Смешанные цвета:
#define BLACK	0
#define YELLOW	(RED | GREEN)			// Смешивание цветов. RED и GREEN имеют код 001 и 010 соответственно. При наложении одного цвета на другой получаем 011; 
#define	MAGENTA	(RED | BLUE)			// Смешивание цветов. RED и BLUE имеют код 001 и 100 соответственно. При наложении одного цвета на другой получаем 101; 
#define CYAN	(GREEN | BLUE)			// Смешивание цветов. GREEN и BLUE имеют код 010 и 100 соответственно. При наложении одного цвета на другой получаем 110; 
#define WHITE	(RED | GREEN | BLUE)	// Смешивание цветов. RED, GREEN и BLUE имеют код 001, 010 и 100 соответственно. При наложении одного цвета на другой получаем 111; 
// Побитовые константы:
#define OPAQUE			0x1
#define FILL_BLUE		0x8
#define	FILL_GREEN		0x4
#define FILL_RED		0x2
#define	FILL_MASK		0xE
#define BORDER			0x100
#define BORDER_BLUE		0x800
#define	BORDER_GREEN	0x400
#define BORDER_RED		0x200
#define BORDER_MASK		0xE00
#define B_SOLID			0
#define B_DOTTED		0x1000
#define B_DASHED		0x2000
#define STYLE_MASK		0x3000

extern const char* colors[8];			// Массив из 8 указатель на строковый на строки. Квалификатор extern дает понял компилятору, что в программе существует этот массив. 
										// При сборке линкер соберет все файлы программы и компилятор найдет связь с этим массивом;
struct box_props						// Структура типа box_props имеет размер 4 байта. 16 бит занято, 16 бит остаются пустыми;
{
	bool opaque : 1;					// Флаг для режима "прозрачный/непрозрачный". Занимает 1 бит структуры. В поле задействован 0 бит;
	unsigned int fill_color : 3;		// Переменная отвечающая за заливку цвета.  Занимает 3 бита структуры. В поле задействован 1, 2, 3 биты;
	unsigned int : 4;					// Далее идут пустые, незадействованные биты 4, 5, 6, 7;
	bool show_border : 1;				// Флаг для режима "рамка включена/рамка выключена". Занимает 1 бит структуры. В поле задействован 8 бит;
	unsigned int border_color : 3;		// Переменная отвечающая за цвет рамки. Занимает 3 бита структуры. В поле задействован 9, 10, 11 биты;
	unsigned int border_style : 2;		// Переменная отвечающая за стиль рамки пунктирная/сплошная рамка. Занимает 2 бита структуры. В поле задействован 12, 13 биты;
	unsigned int : 2;					// Далее идут пустые, незадействованные биты 14, 15; 
};

union Views								// Объединения типа View. Структура типа box_props и переменная типа short смотрят на одну и туже область;
{
	struct box_props st_view;			// Взгляд на упорядоченные поля структуры;
	unsigned short us_view;				// Взгляд как на целое число (биты полей образуют число);
};

void show_settings(const struct box_props* pb);	// Функция для вывода настроек. Принимает константный указатель на структуру, который сможет защитить от случайных изменений значений массива;
void show_settings1(unsigned short);			// Функция для вывода настроек. Принимает значение (как биты полей);
char* itobs(int n, char* ps);					// Функция принимает знчение в виде полей структуры (число в двоичном виде) и указатель на массив; 
*/


