#include <stdio.h>
#include <ctype.h>			// Подключение библиотек для вывода символьных значений;
#include <locale.h>
#include <Windows.h>

int main(void)
{
	setlocale(LC_ALL, "RUS");
	setlocale(LC_NUMERIC, "C");
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);

    // Использование функции isalnum():
/*    char ch;
    printf("Enter English text: ");
    while ((ch = getchar()) != '\n') 
    {
        if (isalnum(ch))                                // Проверяет, является ли символ английской буквой или цифрой;
            putchar(ch + 1);                            // Данная функция отставляет неизменными символы как "! " № ; % : ? * ( )" и.т.п.;
        else
            putchar(ch);
    }
    putchar('\n');
*/
    // Использование функции isalpha():
 /*   char ch;
    printf("Enter English text: ");
    while ((ch = getchar()) != '\n')
    {
        if (isalpha(ch))                                // Проверяет, является ли символ английской буквой;
            putchar(ch + 1);                            // Данная функция отставляет неизменными символы как "! " № ; % : ? * ( )" и.т.п, а так же цифры;
        else
            putchar(ch);
    }
    putchar('\n');
*/
    // Использование функции isblank():
/*    char ch;
    printf("Enter English text: ");
    while ((ch = getchar()) != '\n')
    {
        if (isblank(ch))                                // Проверяет, является ли символ пробелом, горизонтальной табуляцией;
            putchar(ch + 1);                            // Данная функция отставляет неизменными символы как буквы, занки "! " № ; % : ? * ( )" и.т.п, а так же цифры;
        else
            putchar(ch);
    }
    putchar('\n');
*/
    // Использование функции iscntrl():
/*    char ch;
    printf("Введите текст. Если нажмете Tab, он превратится в переход строки: \n");
    while ((ch = getchar()) != '\n')             // Цикл читает символы до тех пор, пока не встретит Enter ("\n");
    {
        if (iscntrl(ch))        // Проверяем, является ли символ управляющим (код ASCII 0-31);
            putchar(ch + 1);    // Если это управляющий символ, например Tab (код 9), мы прибавляем 1 и получаем код 10 (это \n - новая строка);
        else
            putchar(ch);        // Обычные буквы, цифры и знаки препинания НЕ являются управляющими и выводятся как есть;
    }
*/

    /*
    Функция  "iscntrl()" не тронет: 
    Пробел (код 32) — это печатный символ, он не считается управляющим.
    Все знаки препинания (. , ! ? : ;).
    Математические знаки (+ - = < >).
    Символы-значки (@ # $ % ^ & * ( ) _ [ ] { }).
    Итог:
    Если просто печатать обычный текст на клавиатуре, "if (iscntrl(ch))" почти никогда не будет срабатывать, кроме случая, когда нажимаем "Tab". 
    Большинство остальных управляющих символов нельзя ввести простым нажатием одной клавиши (они передаются программами или специальными комбинациями с "Ctrl").
    */

    // Использование функции isdigit():
/*   char ch;
    printf("Enter English text: ");
    while ((ch = getchar()) != '\n')
    {
        if (isdigit(ch))                                // Проверяет, является ли символ цифрой;
            putchar(ch + 1);                            // Данная функция отставляет неизменными символы как буквы, занки "! " № ; % : ? * ( )" и.т.п;
        else
            putchar(ch);
    }
    putchar('\n');
*/
    // Использование функции isgraph():
/*    char ch;
    printf("Enter English text: ");
    while ((ch = getchar()) != '\n')
    {
        if (isgraph(ch))                                // Данная функция меняет все кроме пробела и управляющих символов ("iscntrl"): табуляция ("\t"), звуковой сигнал ("\a"), возврат каретки ("\r") и прочие «невидимки»;
            putchar(ch + 1);                            
        else
            putchar(ch);
    }
    putchar('\n');
*/
    // Использование функции islower():
/*    char ch;
    printf("Enter English text: ");
    while ((ch = getchar()) != '\n')
    {
        if (islower(ch))                                // Данная функция меняет только символы низкого регистра, т.е. строчные буквы;
            putchar(ch + 1);                            // Данная функция отставляет неизменными символы как буквы верхнего регистра, занки "! " № ; % : ? * ( )" и.т.п;
        else
            putchar(ch);
    }
    putchar('\n');
*/
    // Использование функции isupper():
/*    char ch;
    printf("Enter English text: ");
    while ((ch = getchar()) != '\n')
    {
        if (isupper(ch))                                // Данная функция меняет только символы верхнего регистра, т.е. заглавные буквы;
            putchar(ch + 1);                            // Данная функция отставляет неизменными символы как буквы нижнего регистра, занки "! " № ; % : ? * ( )" и.т.п;
        else
            putchar(ch);
    }
    putchar('\n');
*/
    // Использование функции isprint():
/*    char ch;
    printf("Enter English text: ");
    while ((ch = getchar()) != '\n')
    {
        if (isprint(ch))                                // Данная функция меняет все символы, кроме все «невидимые» управляющие символы: сюда входят табуляция ("\t"), звуковой сигнал ("\a"), возврат каретки ("\r") и прочие коды из начала таблицы ASCII;
            putchar(ch + 1);                            
        else
            putchar(ch);
    }
    putchar('\n');
*/
    // Использование функции ispunct():
/*    char ch;
    printf("Enter English text: ");
    while ((ch = getchar()) != '\n')
    {
        if (ispunct(ch))                                // Данная функция меняет символы такие как знаки препинания, знаки "! " № ; % : ? * < > ( ) { } [ ]" (математические символы);
            putchar(ch + 1);                            // Данная функция отставляет неизменными символы как буквы и цифры, а так же пробелы, табуляции и новые строки останутся неизменными;
        else
            putchar(ch);
    }
    putchar('\n');
*/
    // Использование функции isspace():
/*    char ch;
    printf("Enter English text: ");
    while ((ch = getchar()) != '\n')
    {
        if (isspace(ch))                                // Данная функция меняет символы пробела, новой строки, перевода страницы, возрата каретки, вертикальной и горизонтальной табуляции;
            putchar(ch + 1);                            // Данная функция отставляет неизменными символы как буквы и цифры, а также знаки "! " № ; % : ? * < > ( ) { } [ ]" (математические символы);
        else
            putchar(ch);
    }
    putchar('\n');
*/
    // Использование функции isxdigit():
/*    char ch;
    printf("Enter English text: ");
    while ((ch = getchar()) != '\n')
    {
        if (isxdigit(ch))                               // Данная функция меняет символы букв от "A до F" и цифр "0 до 9", котрые пользуются в шестнадцатеричной ситеме исчисления;
            putchar(ch + 1);                            // Данная функция отставляет неизменными остальные символы как буквы, знаки "! " № ; % : ? * < > ( ) { } [ ]" (математические символы), управляющие символы;
        else
            putchar(ch);
    }
    putchar('\n');
*/
    // Использование функции tolower():
/*    char ch;
    printf("Введите текст (все заглавные буквы станут строчными):\n");
    while ((ch = getchar()) != '\n')
    {
        char lower_ch = tolower(ch);        // "tolower" сама проверяет, является ли символ заглавной буквой. Если да — уменьшит, если нет — вернет как было;
        putchar(lower_ch);
    }
    putchar('\n');
*/
    // Использование функции toupper():
/*    char ch;
    printf("Введите текст (все заглавные буквы станут строчными):\n");
    while ((ch = getchar()) != '\n')
    {
        char lower_ch = toupper(ch);        // "toupper" сама проверяет, является ли символ строчной буквой. Если да — увеличит, если нет — вернет как было;
        putchar(lower_ch);
    }
    putchar('\n');
*/
    return 0;
}