/* Ваш вес в платиновом эквиваленте. */
//#define _CRT_SECURE_NO_WARNINGS									// Использовать директиву если в программе использовать функцию "scanf";
#include <stdio.h>
#include <locale.h>

int main(void)
{
	setlocale(LC_ALL, "RUS");
	float weight;				// Вес пользователя. float - тип данных с плавающей запятой;
	float value;				// Платиновый эквивалент;

	printf("Хотите узнать свой вес в платиновом эквиваленте? \n");
	printf("Давайте подсчитаем. \n");
	printf("Пожалуйста введите свой вес выраженный в фунтах: \n");

	/* Получить данные от пользователя. */
	scanf_s("%f", &weight);											// Функция "scanf_s" для ввода с клавиатуры значения. "%f" означает, что склавиатуры должно счтываться значение плавающей запятой.
																	// "&weight" означает, что этой переменной будет присвоено это значение. "&" - амперсанд для указатения где находится переменная "weight". Далее прграмма продолжит выполняться;

	/* Считаем что цена родия равна $1700 за тройскую унцию. */
	/* 14.5833 коэффициент для перевода веса, выраженного в фунтах, в тройские унции. */
	value = 1700.0 * weight * 14.5833;								// Переменной "value" присвоится значение выражения с запятой (точкой). После запятой попадает два значения;
																	// "1700.0" - константа с десятичной точкой;

	printf("Ваш вес в платиновом эквиваленте составляет $%.2f. \n", value);			// %f - спецификатор означает, что данные должный считываться с плавающей запятой. 
																					// А ".2" перед спецификатором означает, что после запятой должно отображаться два знака; 
	printf("Вы легко можете стать достойным этого! Если цена платины падает, \n");
	printf("ешьте больше для поддержания стоимости. \n\n");

	int ten = 10;
	int two = 2;

	printf("Выполняетя правильно: \n");						
	printf("%d минус %d равно %d. \n", ten, 2, ten - two);			// Верное написан код;
	printf("Выполняется не правильно: \n");
	printf("%d минус %d равно %d. \n\n", ten);						// Неверно написан код. Пропущены два аргумента;

	int x = 100;

	printf("Десятичное = %d, восьмиричное = %o, шестнадцатеричное = %x. \n", x, x, x);			// Число "100" представлено в разных формах системы исчисления;
	printf("Десятичное = %d, восьмиричное = %#o, шестнадцатеричное = %#x. \n\n", x, x, x);		// К числу добавляется префикс системы исчисления с помощью символа "#";

	/* 
	Обявление переменных с разными типами данных:
	long int count;					// Тип данных "long" со знаком "-". 32 бита (4 байта), диапазон от -2 147 483 648 до 2 147 483 647;
	long trees;						// Тип данных "long" со знаком "-", тоже самое "long int";
	short int gift;					// Тип данных "short" со знаком "-". 16 бит (2 байта), диапазон от -32 768 до 32 767;
	short price;					// Тип данных "short" со знаком "-", тоже самое "short int";
	unsigned int metter;			// Тип данных "unsigned" без знака "-". 32 бита (4 байта), диапазон от 0 до 4 294 967 295;
	unsigned scores;				// Тип данных "unsigned" без знака "-", тоже самое "unsigned int";
	unsigned long stars;			// Тип данных "unsigned long" без знака "-". 32 бита (4 байта), диапазон от 0 до 4 294 967 295;
	unsigned short pen;				// Тип данных "unsigned short" без знака "-". 16 бит (2 байта), диапазон от 0 до 65 356;
	long long ago;					// Тип данных "long long" со знаком "-". 64 бита (8 байт), диапазон от -9 223 372 036 854 775 808 до 9 223 372 036 854 775 807;
	unsigned long long				// Тип данных "unsigned long long" ,без знака "-". 64 бита (8 байт), диапазон от 0 до 18 446 744 073 709 551 615;
	В операционной системе Windows оба типа по 4 байта. 
	В операционной системе Linux/macOC "int" 4 байта, "long" - 8 байт.
	В микроконтроллерах "int" 2 байта, "long" - 4 байта.
	*/

	int i = 2147483647;
	unsigned int j = 4294967295;

	printf("%d %d %d \n", i, i + 1, i + 2);		// Спецификатор "%d" для типа данных "int". При переполнении начинается с -2 147 483 648;
	printf("%u %u %u\n\n", j, j + 1, j + 2);	// Спецификатор "%u" для типа данных "unsigned int". При переполнении начинается с 0;

	unsigned int un = 3000000000;
	short end = 200;
	long big = 65537;
	long long verybig = 12345678908642;

	printf("un = %u, но не %d. \n", un, un);						// Спецификатор "%u" для типа данных "unsigned int". При переполнении начинается с 0;
	printf("end = %hd, и %d. \n", end, end);						// Спецификатор "%hd" для типа данных "short int". При переполнении начинается с -32 768;
	printf("big = %ld, но не %hd. \n", big, big);					// Спецификатор "%ld" для типа данных "long int". При переполнении начинается с -2 147 483 648;
	printf("verybig = %lld, но не %ld. \n\n", verybig, verybig);	// Спецификатор "%lld" для типа данных "long long int". При переполнении начинается с -9 223 372 036 854 775 808;
	/*
	Строка 71.Если представить число "3000000000" в 2 бита - это "10110010110100000101111000000000" (оно помещается в тип данных "unsigned int" 32 бита).
	Далее если привести к типу данных "int" (тоже 32 бита, но данный тип даанных со знаком "-"), то первый бит "1" слева означает знак "-". Если до приведения типа диапазон составлял от 0 до 4 294 967 295,
	после от -2 147 483 648 до 2 147 483 647. В итоге представим выражение 4 294 967 295 - 3000000000 = 1 294 967 296, т.к. первый бит "1", то ставится знак "-";

	Срока 74. Если представить число "12345678908642" в 2 бита - это "впереди еще нули 10110011101001110011110011100100110011100010" (оно помещается в тип данных "long long" 64 бита).
	Далее если привести к типу данных "long", то первые 32 бита обрежутся и получится "01110011110011100100110011100010", а это число "1942899938";
	*/

	/* Использование символов: тип "char": */
	char symbol;
	symbol = 'T';								// Правильное объявление символа;
//	symbol = T;									// Компилятор выдаст ошибку "Не объявленный идентификатор";
//	symbol = "T";								// Грубая ошибка, компилятор выдаст только предупреждение. Так же компилятор счтает, что "Т" является строкой;
	symbol = 65;								// Правильное объявление символа. Согласно таблице ASCII код "65" является символом "А";
	
	char beep = '\x007';						// Непечатаемы символ "\а", можно записать в восьмирчной форме '\007' или шестнадцатеричной '\x007';

	printf("Вывод символа обратная черта \\. \t Или вывод это же символа в шестнадцатеричном формате \x5C. \n\n");		// Символ табуляции "\t"; 

	getchar();														// Для предотвращения преждевременного закрытия консоли;

	char ch;
	printf("Введите какой-нибудь символ: \n");
	scanf_s("%c", &ch);												// Вводится смвол; Спецификатор "%c" для;
	printf("Код символа %c равен %d. \n\n", ch, ch);				// Спецификатор "%c" для вывода символа, спецификатор "%d" для вывода символа в десятичом формате этоже сивола, т.е. код символа согласно таблице ASCII;
	/*
	Также тип "char" можно применять для значений со знаком и без. 
	Со знаком рекомндуется писать "signed char" и диапазон от -128 до 127.
	И без знака "unsigned char" с диапазоном от 0 до 255;
	*/

	return 0;
}