#include <stdio.h>
#include <string.h>
#include <math.h>
#include <limits.h>
#include <stdarg.h>
#include "names_st.h"

// Определение функций для names_st:
/*
void get_names(names* pn)							// В данном файле находятся определения функций, которые содержит заголовочный файл "names_st.h" в виде прототипов;
{
	printf("Введите свое имя: ");
	s_gets(pn->first, SLEN);
	printf("Введите свою фамилию: ");
	s_gets(pn->last, SLEN);
}

void show_names(const names* pn)
{
	printf("%s %s", pn->first, pn->last);
}

char* s_gets(char* mass, int size)
{
	char* ret_val;
	char* find;
	ret_val = fgets(mass, size, stdin);
	if (ret_val)
	{
		find = strchr(mass, '\n');
		if (find)
			*find = '\0';
		else
			while ((getchar()) != '\n')
				continue;
	}
	return ret_val;
}
*/


// Предопределнные идентификаторы:
/*
void why_me(void)
{
	printf("Эта функция: %s.\n", __func__);			// Предопределенный идентификатор выведет на экран название функции, в которой находится оператор;
	printf("Это строка: %d.\n", __LINE__);			// Предопределенный макрос выведет на экран номер строки в текущем файле;
}
*/


// Преобразование прямоугольных координат в полярные:
/*
Polar_V rect_to_polar(Rect_V rv)
{
	Polar_V pv;
	pv.magnitude = sqrt(rv.x * rv.x + rv.y * rv.y);	// По теореме Пифагора находим расстояние до точки, которую надо найти;
	if (pv.magnitude == 0)							// Если расстояние равно 0, то угол соответственно равен 0 (радиан);
		pv.angle = 0;
	else
		pv.angle = RAD_TO_DEG * atan2(rv.y, rv.x);	// Находим угол в радианах до точки по прямой. Вместо макроса RAD_TO_DEG, подставляется выражение 180 / (4 * atan(1)), которое равно 57.296.
													// Это значение умножается (сколько градусов) с функцией atan2 и ее координатами (два катета) и выдает значение в радианах. Итоговый результат будет в градусах;
	return pv;
}
*/

/*
	Почему используют именно atan2(y, x), а не обычный atan(y/x):
	1. Защита от деления на ноль: если x равен 0, функция не упадет, а вернет 90 или -90 градусов;
	2. Определение четверти: функция видит знаки осей X и Y, поэтому четко понимает направление вектора по всему кругу (360°);
	3. Порядок аргументов: первым параметром ОБЯЗАТЕЛЬНО идет координата Y, вторым — X.
*/


// Применение функции atexit:
/*
void sing_off(void)
{
	puts("Завершение работы очередной замечательной программы от");
	puts("SeeSaw Software");
}

void too_bad(void)
{
	puts("SeeSaw Software приносит искреннее соболезнования");
	puts("в связи с отказом программы");
}
*/


// Использование быстрой сортировки для упорядочения групп чисел:
/*
void fillarray(double ar[], int  n)
{
	int index;
	for (index = 0; index < n; index++)
		ar[index] = (double)rand() / ((double)rand() + 0.1);		// Функции необходимо указать тип данных (иначе примет тип int, иначе при делении дробная часть обрежется). Прибавляется 0,1 только для защиты от деления на 0;
}
																	// Внутреннее устройство функции rand() по стандарту C:
																	// NEXT_NUMBER = NEXT_NUMBER * 1103515245 + 12345;
																	// return (NEXT_NUMBER / 65536) % 32768; 


// 1. Это реальный эталонный код из стандарта Си. Функция работает как обычный математический конвейер;
// 2. Гигантские коэффициенты подобраны математиками так, чтобы результаты прыгали максимально хаотично;
// 3. Период повторения этой формулы — больше 2 миллиардов вызовов, что создает для человека идеальную иллюзию случайности.


void showarray(const double ar[], int n)
{
	int index;
	for (index = 0; index < n; index++)
	{
		printf("%9.4f ", ar[index]);
		if (index % 6 == 5)						// Если остаток равен 5, то произведется перенос на новую строку;
			putchar('\n');
	}
	if (index % 6 != '\0')
		putchar('\n');
}

int mycomp(const void* p1, const void* p2)		// Функция принимает два указателя, которые имеют универсальный тип данных и указатели указывают на значения в массиве;
{
	const double* a1 = (const double*)p1;		// Указателям применяем приведение к типу и применяем квалификатор const для защиты от изменения значений. Тоже самое делаем при объявлении указателя * а1;
	const double* a2 = (const double*)p2;		// Указателям применяем приведение к типу и применяем квалификатор const для защиты от изменения значений. Тоже самое делаем при объявлении указателя * а2;
	if (*a1 < *a2)								// Далее идет операция сравнения:
		return -1;								// Если значение, на которое указывает указатель *a1, меньше, чем значение, на которое указывает указатель *a2, вернется код -1, перестановки значений в функции qsort() не произойдет;
	else if (*a1 == *a2)						
		return 0;								// Если значение, на которое указывает указатель *a1, равно значению, на которое указывает указатель *a2, вернется код 0, перестановки значений в функции qsort() не произойдет;
	else
		return 1;								// Если значение, на которое указывает указатель *a1, больше чем значение, на которое указывает указатель *a2, вернется код 1, произойдет перестановка значений в функции qsort();
}												// Функция qsort() с каждым вызовом передает функции mycomp() 2 указателя на значения;
*/


// Использование функций memcpy() и memmove():
/*
void show_array(const int ar[], int n)
{
	int index;
	for (index = 0; index < n; index++)
		printf("%d ", ar[index]);
	putchar('\n');
}
*/


// Использование переменного числа аргументов (файл stdarg.h):
/*
double sum(int lim, ...)						// Для создания функции переменной длины всегда должен быть первыый аргумент (параметр), 2 аргумент может быть тоже аргументом либо троеточие "...",
{												// которое означает переменную длину (можно функции помимо 1 аргумента передать еще 1, 2, 3, 10 аргументов. Но при этом "..." должно стоять последним;
												// 1 аргментом является количество педаваемых аргументов, например, sum(3, 1.1, 2.5, 13.3) - 1 аргумент - это количество передаваемых аргументов (1.1, 2.5, 13.3) вместо "...";
	va_list ap;									// Объявление типа, которое хранит аргументы, например, 1.1, 2.5, 13.3. ap - переменная на тип va_list;
	double tot = 0;
	int i;
	va_start(ap, lim);							// Инициализирует указатель ap. Он находит в памяти аргумент lim, "перешагивает" через него и встает на начало скрытого списка аргументов (в примере — указывает на число 1.1);
	for (i = 0; i < lim; i++)
		tot += va_arg(ap, double);				// Макрос va_arg делает два действия сразу: 1) возвращает текущее значение, на которое смотрит ap (на первой итерации это 1.1).
												// 2) тут же сдвигает указатель ap вперед на размер типа double. Поэтому на второй итерации макрос вернет уже 2.5 и снова сдвинется вперед.
	va_end(ap);									// Если больше не нужны значения, на которые указывает указатель ap, можно деактивировать указатель, применив макрос va_end;

	return tot;									// Функция возвращает сумму значений;
}
*/


// Пример копировании значений с помощью макроса va_copy:
/*
void print_above_average(int lim, ...)
{
	va_list ap;						// Основная "закладка" для первого прохода (подсчет суммы);
	va_list apcopy;					// Резервная "закладка" для второго прохода;
	double sum = 0.0;	
	va_start(ap, lim);				// Ставим ap на самое первое число в списке;
	va_copy(apcopy, ap);			// Делаем снимок (копию) указателя ap, пока он еще указывает на НАЧАЛО списка. Теперь apcopy "запомнил" эту стартовую позицию в памяти;

	// --- ПЕРВЫЙ ПРОХОД (Используем ap) ---
	for (int i = 0; i < lim; i++)	
		sum += va_arg(ap, double);	// va_arg забирает число и сдвигает указатель ap вперед. К концу цикла ap уйдет в самый конец списка и станет бесполезен;

	double average = sum / lim;
	printf("Среднее арифметическое: %.2f\n", average);
	printf("Числа, которые больше среднего: ");

	// --- ВТОРОЙ ПРОХОД (Используем сохраненный apcopy) ---
	for (int i = 0; i < lim; i++)	// Нам не нужно вызывать va_start заново. Мы просто берем apcopy, который все еще неподвижно стоит на самом первом элементе;
	{
		double current_num = va_arg(apcopy, double);	// Шагаем по памяти с помощью apcopy с самого начала списка;
		if (current_num > average)
			printf("%.2f ", current_num);
	}
	printf("\n");
	// ---ОБЯЗАТЕЛЬНАЯ ОЧИСТКА ---
	va_end(ap);						// Закрываем основной указатель;
	va_end(apcopy);					// Правило C99: для каждого va_copy обязан быть свой va_end;
}
*/

