#include <stdio.h>
#include <math.h>
#include <locale.h>		
#include <stdlib.h>
#include <assert.h>
#include <limits.h>
#include <string.h>
#include <stdarg.h>
#include <Windows.h>
#include <complex.h>									// Подключаем комплексную арифметику;
#include "names_st.h"
#include "names_st.h"									// Преднамереное повторение заголовочного файла, чтобы проверить работу директивы #ifndef. Если убрать #ifndef из заголовочного файла, будет ошибка.
														// Если #ifndef вернуть ошибки не будет, данная диреткива страхует от повторного подключения заголовочного файла;
int main(void)
{
	setlocale(LC_ALL, "RUS");
	setlocale(LC_NUMERIC, "C");
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);

			
	// Пример работы с препроцессором:
/*	#define TWO 2										// Комментарии к директиве применяется так же, как и к оператору в программе;
	#define OW "Логик а - последнее убежище лишенных\
 воображения. - Оскар Уайлд"							// Обратная косая черта переносит определение макроса на следующую строку. При этом нельзя комментировать напротив косой черты;
	#define FOUR (TWO*TWO)								// Препроцессор подставляет только значения. Данное определение вычисляется при компиляции;
	#define PX printf("X = %d.\n", x);					// Определение макроса можно представить в виде оператора;
	#define FMT "X = %d.\n"								// Определение макроса можно представить в виде части оператора;

	int x = TWO;										// Вместо макроса подстваляется 2;
	PX;													// Вместо макроса подставится оператор printf("X = %d.\n", x);
	x = FOUR;											// Вместо макроса подстваляется TWO*TWO, при компиляции произойдет вычисление 2 * 2 = 4;
	printf(FMT, x);										// Вместо макроса подставится "X = %d.\n";
	printf("%s\n", OW);									// Вместо макроса подставится строка "Логик а - последнее убежище лишенных воображения. - Оскар Уайлд";
	printf("TWO: OW\n");								// Т.к. макросы заключены в ковычки (""), то они преобразуются в строку TWO: OW. И на монитор выведется только TWO: OW;
*/


	/*
	#define LIMIT 20 
	const int LIM = 50; 
	static int datal[LIMIT];							// Указывать размер массива в виде макроса вместо простого числа разрешено;
	static int data2[LIM];								// Указывать размер массива в виде переменной запрещено, компилятор выдаст ошибку;
	const int LIM2 = 2 * LIMIT;							// При определении переменной с квалификатором const можно применить макрос, но при попытке в дальнейшем изменить переменную, компилятор выдасть ошибку;
	const int LIM3 = 2 * LIM;							// При определении переменной с квалификатором const можно применить переменную, но при попытке в дальнейшем изменить переменную, компилятор выдасть ошибку;
														// LIM2 и LIM3 при дальнейшем использовании данных переменных в виде размера массива запрещено, несмотря на квалификатор const;
	*/



	/*
	#define	FOUR 2*2									// Определение макроса одной лексемой, 2*2 без пробельных символов;
	#define	FOUR 2 * 2									// Определение макроса 3 лексемами, т.к. между символами применены пробелы. При применении макроса в выражение (оператор) так и подставится 2 * 2;
	#define	FOUR 2	*	2								// Определение макроса 3 лексемами, т.к. между символами применены табуляции. При применении макроса в выражение (оператор) так и подставится 2	*	2;
														// Но при этом если записать так 2*2 или 2 * 2, или 2	*	2, затем подставить макрос в оператор, результат будет одинаков, компилятор сузит до одного пробела между лексемами;
	*/



	/*
	// Переопределение константы;
	#define LIMIT 20
	#undef LIMIT				// Макрос для безопасного переопределения;
	#define LIMIT 25										

		// Совпадение определений (по 3 лексемы, одни и теже значения):
	#define	FOUR 2 * 2	
	#define	FOUR 2	*	2
		// Несовпадение определений (одна лексема):
	#define	FOUR 2*2
	*/




	// Макросы с аргументами:
/*	#define SQUARE(X) X*X									// Вместо аргумента макроса Х подставится Х*Х;
	#define PR(X) printf("Результат: %d.\n", X)				// Вместо аргумента макроса Х подставится оператор printf("Результат: %d.\n", X);
	
	int x = 5;
	int z;
	printf("x = %d\n", x);
	z = SQUARE(x);											// Вместо аргумента х подставится определение макроса Х*Х, в результате переменной z присваивается значение 5 * 5 = 25;
	printf("Вычисление SQUARE(x): ");
	PR(z);													// Вместо макроса PR подставляется оператор printf("Результат: %d.\n", X). Вместо аргумента Х макроса PR подставляется значение переменной z (25);
	z = SQUARE(2);											// Вместо макроса подставляется 2 * 2 = 4, переменной z присваивается значение 4;
	printf("Вычисление SQUARE(2): ");
	PR(z);													// Вместо макроса PR подставляется оператор printf("Результат: %d.\n", X). Вместо аргумента Х макроса PR подставляется значение переменной z (4);
	printf("Вычисление SQUARE(x + 2): ");
	PR(SQUARE(x + 2));										// Вместо аргумента оператора printf("Результат: %d.\n", X макроса PR подставляется аргумент макроса SQUARE х + 2, в резульатет получаем выражение 5 + 2 * 5 + 2 = 17. Оператор подставит это значение для вывода его на монитор; 
	printf("Вычисление 100/SQUARE(2): ");
	PR(SQUARE(100 / SQUARE(2)));							// Еще пример вложенности макросов. SQUARE(100 / SQUARE(2)) дает 100 / 2 * 2 * 100 / 2 * 2 = 10000;
	printf("x = %d\n", x);									
	printf("Вычисление SQUARE(++x): ");
	PR(SQUARE(++x));										// Еще один пример вложенности макросов. SQUARE(++x) дает ++х * ++х (6 * 7) = 42. НО!!! Данный метод лучше не использовать, т.к. Инкрементирование допустимо только 1 раз в операторе, компилятор может выдать не логичный резульатат;
	printf("После инкрементирования х = %x.\n", x);
															// Если записать обяевления макроса #define SQUARE(X) (X)*(X), то на примере SQUARE(x + 2) даст выражение (5 + 2) * (5 + 2) = 49. В данном случае скобки сыграли ключевую роль, они дают более предсказуемы результат;
*/




	// Подстановка в строке:
/*	#define PSQR(x) printf("Квадрат " #x " равен %d.\n", ((x)*(x)))		// " #x " - это лексема, которая преобразуется в строку. Вместо аргумента х макроса PSQR подставляется оператор printf("Квадрат " #x " равен %d.\n", ((x)*(x)));

	int y = 5;
	PSQR(y);					// Вместо лексемы " #x " подставляется строка y, а у оператора printf("Квадрат " #x " равен %d.\n", ((x)*(x))) вместо х, подставляется y. В итоге получаем printf("Квадрат y равен %d.\n", ((y)*(y))), далее "Квадрат y равен 25;	
	PSQR(2 + 4);				// Вместо лексемы " #x " подставляется строка 2 + 4, а у оператора printf("Квадрат " #x " равен %d.\n", ((x)*(x))) вместо х, подставляется ((2 + 4) * (2 + 4)). В итоге получаем printf("Квадрат 2 + 4 равен %d.\n", ((2 + 4)*(2 + 4))), далее "Квадрат 2 + 4 равен 36;
*/




	// Использование операции ## (слияние препроцессора):
/*	#define XNAME(n) x ## n										// ## - для склеивания двух лексем (символ х склеивается со значением n);
	#define PRINT_IN(n) printf("x" #n " = %d.\n", x ## n);

	int XNAME(1) = 14;			// Вместо аргумента n макроса XNAME подставляется 1. Препроцессор берёт букву x, которая определена макросу (это просто буква) и склеивает (##) её с аргументом n (который равен 1). Получается: int x1 = 14;
	int XNAME(2) = 20;			// Вместо аргумента n макроса XNAME подставляется 2. Препроцессор берёт букву x, которая определена макросу (это просто буква) и склеивает (##) её с аргументом n (который равен 2). Получается: int x2 = 20;
	int x3 = 30;
	PRINT_IN(1);				// Вместо аргумента n макроса PRINT_IN подставляется 1. Препроцессор берет "x" #n " склеивает (#n превращает значение в строку) между собой строки (х1 получается). x ## n склеивает х и 1, получаем имя переменной x1, а это переменная равна 14, это занчение подставляется вместо спецификатора %d;
	PRINT_IN(2);				// Вместо аргумента n макроса PRINT_IN подставляется 2. Препроцессор берет "x" #n " склеивает (#n превращает значение в строку) между собой строки (х2 получается). x ## n склеивает х и 2, получаем имя переменной x2, а это переменная равна 20, это занчение подставляется вместо спецификатора %d;
	PRINT_IN(3);				// Вместо аргумента n макроса PRINT_IN подставляется 3. Препроцессор берет "x" #n " склеивает (#n превращает значение в строку) между собой строки (х3 получается). x ## n склеивает х и 3, получаем имя переменной x3, а это переменная равна 30, это занчение подставляется вместо спецификатора %d;
*/




	// Макросы с переменным числом аргументов:
/*	#define PR(X, ...) printf("Сообщение " #X ": "__VA_ARGS__)	// Расширение аргументов макроса с помощью макроса предопределения __VA_ARGS__ (идентификатор(или служебное слово) для подстановки вариативных аргументов).
																// Это значаит помимо аргумента Х, может быть еще один аргумент или больше. Вместо ... подставляется __VA_ARGS__
	double x = 48.0;
	double y;
	y = sqrt(x);												// Математическая функция sqrt(x), которая находит квадратный корень из значения находящегося в скобках. Итоговое значение присваивается переменной y;
	PR(1, "x = %g\n", x);										// PR(X, ...) - вместо 1 аргумента подставляется значение 1, вместо ... подставляется "x = %g\n", x. " #X " - вместо лексемы подставляется значение аргумента Х и получаем строку 1;
	PR(2, "x = %.2f, y = %.4f\n", x, y);						// PR(X, ...) - вместо 1 аргумента подставляется значение 2, вместо ... подставляется "x = %.2f, y = %.4f\n", x, y. " #X " - вместо лексемы подставляется значение аргумента Х и получаем строку 2;
*/




/*	// Исполнительный файл для структуры name_st:
	// Компилятор видит вызов функции в исполнительном файле, заглядывает в заголовочный файл, там видит прототип функции, далее оставляет пустое место (адрес) для этой функции, создается файл main.obj.
	// Отдельно компилятор рабоатетс с файлом. переводит так же в машинный код и создают еще файл names_st.obj. Линковщик в последнюю очередь собирает файлы main.obj и names_st.obj,
	// сканирует файл names_st.obj на функции, берет их адреса и вставляет в зарезервированный адрес;
	names candidate;
	get_names(&candidate);
	printf("Добро пожаловать в программу, ");
	show_names(&candidate);
	printf("!\n");
*/



	// Определение макросов:
/*	#define LIMIT 1000				// Идентификатор LIMIT определен;
	#define GOOD					// Идентификатор GOOD определен; 
	#define A(X) (((-(X))*(X)))		// Идентификатор А определен (с аргументом);
	int q;							// Идентификатор q - не макрос, а переменная, поэтому не определен;
	#undef GOOD						// Идентификатор GOOD неопределен (определение сброшено с пощью директивы #undef);

	// #define GOOD. При применении данного макроса остается пустота. Его можно использовать при отладке, посмотрев, работает ли кусок кода
	// #ifdef GOOD					// Препроцессор смотрит в память, видит, что слово GOOD ему знакомо.
    //#endif						// printf("Режим супер-графики ВКЛЮЧЕН");
 */




	// Директивы #ifdef #else #endif:
/*	#ifdef MAVIS				// Данный блок ставится как глобально так и в функцию main() или в другую;
		#include "horse.h"		// Выполняется если идентификатор MAVIS определен;
		#define STABLES 5
	#else
		#include "cow.h"		// Выполняется если идентификатор MAVIS не определен;
		#define STABLES 15
	#endif

	// Альтернативная запись:
	#ifdef MAVIS				// Данный блок ставится как глобально так и в функцию main() или в другую;
	#	include "horse.h"		// Выполняется если идентификатор MAVIS определен;

	#	define STABLES 5
	#else
	#	include "cow.h"			// Выполняется если идентификатор MAVIS не определен;

	#	define STABLES 15
	#endif

	// К примеру в коде применена директива #undef, то макрос MAVIS теряет определенность, 
	// и если после попадается данный макрос, выполнится блок между #else и #endif;
*/


	
	// Использование условной компиляции:
/*	#define JUST_CHEKING					// Идентификатор определен, но вместо дентификатора пустота, на выводе на монитор это никак не отразится;
	#define LIMIT 4

	int i;
	int total = 0;
	for (i = 1; i <= LIMIT; i++)
	{
		total += 2 * i * i + 1;
#ifdef JUST_CHEKING							// Если до блока поставить директиву #undef, то макрос JUST_CHEKING потеряет определенность и ниже оператор не выполнит действие;
		printf("i = %d, промежуточная сумма = %d\n", i, total);
#endif
	}
	printf("Итоговая сумма = %d\n", total);
*/



	// Директива #ifndef:
/*	names winner = {"Иванов", "Иванович"};
	printf("Победителем стал %s %s.\n", winner.first, winner.last);
*/




	// Директивы #if и #elif:
/*	#if SYS == 1							// Если выше макрос SYS при помощи директивы препроцессора был определен и равен одному из значений, выберется одно из условий;
		#include "ibmpc.h"
	#elif SYS == 2							// Если SYS равен 2;
		#include "vax.h"
	#elif SYS == 3							// Если SYS равен 3;
		#include "mac.h"
	#else									// Если SYS равен другому значению;
		#include "general.h"				// Если не одно из значений не подходит, выберется эта директива препроцессора;
	#endif

	
	#define VAX
	// defined - операция препроцессора, которая определяет макросу 1. Этот кусок из 2 строк прописаны в другом месте программы;

	#if defined (IBMPC)						// Если выше был макрос IBMPC выберется это условие;
		#include "ibmpc.h"
	#elif defined (VAX)						// Если выше был макрос VAX выберется это условие (на примере так оно и есть);
		#include "vax.h"
	#elif defined (MAC)						// Если выше был макрос MAC выберется это условие;
		#include "mac.h"
	#else									// Если ни один макрос не подходит, то выберется эта ветка;
		#include "general.h"				
	#endif
*/



	/*
				Предопределнные макросы:
		__DATE__ - строка символов в форме даты "Ммм дд ггг", представляющая дату обработки препроцессором;
		__FILE__ - строка символов,  представляющая  имя текущего файла исходного кода;
		__LINE__ - Целочисленная константа, представляющая номер строки в текущем файле исходного кода;
		__STDC__ - Установлен в 1 для указания , что реализация соответствует стандарту С;
		__STDC_HOSTED__ - Установлен в 1 для размещаемой среды, в противном случае 0;
		__STDC_VERSION__ - Для С99 установлен в 199901L, для С11 установлен в 201112L;
		__TIME__ - Время трансляции в форме "чч:мм:сс";
	*/

	// Предопределнные идентификаторы:
/*	printf("Файл: %s.\n", __FILE__);						// Предопределенный макрос выведет на экран путь к расположению файла; 
	printf("Дата: %s.\n", __DATE__);						// Предопределенный макрос выведет на экран текущую дату компиляции;
	printf("Время: %s.\n", __TIME__);						// Предопределенный макрос выведет на экран текущее время компиляции;
	printf("Версия: is %ld.\n", __STDC_VERSION__);			// Предопределенный макрос выведет на экран текущую версию стандарта С, в которой компилировался код;
	printf("Это строка: %d.\n", __LINE__);					// Предопределенный макрос выведет на экран номер строки в текущем файле;
	printf("Эта функция: %s.\n", __func__);					// Предопределенный идентификатор выведет на экран название функции, в которой находится оператор;
	why_me();
*/




	// Директивы #line и #error:
/*	// До обмана:
	printf("Реальная строка: %d\n", __LINE__);				// Выведет нормальный номер строки, например, 270;

	
	#line 777 "prikol.c"									// Фокус: принудительно меняем настройки компилятора. С этой строки так называемы генератор проверяет код на корректность;
															// С этой строки идет отсчет 777;
															// 778;
	// После обмана:										// 779;
	printf("Фальшивое имя файла: %s\n", __FILE__);			// Выведет фальшивое имя файла: prikol.c. // 780;
	printf("Фальшивая строка: %d\n", __LINE__);				// Выведет: 781 (потому что 777 была на 4 строки выше от начала отсчета строки);
*/
	/*
		Получается генератор ошибок, который проганяется по другому коду (программе), в которм, например 100 строк, при компиляции может выпасть ошибка, 
		что код собран неверно, получается, где эта ошибка укажет генератор, например файл "prikol.c" строка 792.
	*/

	


	// Директива #pragma:
/*	#define MSVC_PRAGMA(X) _Pragma(#X)										// Создаем удобный макрос, который превращает текст в команду для компилятора;
	#define IGNORE_OLD_FUNCTIONS MSVC_PRAGMA(warning(disable : 4996))		// Теперь создаем макрос для отключения конкретного предупреждения (например, 4996);

		IGNORE_OLD_FUNCTIONS												// Препроцессор развернет это в: _Pragma("warning(disable : 4996)");
																			// А компилятор поймет это как: #pragma warning(disable : 4996);
	// Дальше идет код, где компилятор больше не будет ругаться на старые функции;


	// Использование операции _Pragma для создания макросов:
	#define PRAGMA(X) _Pragma(#X)											// Макрос-помощник: превращает переданный текст в строковую команду для компилятора;
	#define DISABLE_OLD PRAGMA(warning(disable:4996))						// Макрос развернется в инструкцию #pragma warning(disable:4996) без использования символа #;

		DISABLE_OLD;														// Инструкция чисто для компилятора: принудительно отключает предупреждения об устаревших функциях;

		// Оператор _Pragma также умеет автоматически раскрывать кавычки внутри строки:
		// Вызов _Pragma("use_bool \"true \"false") препроцессор сам превратит в:
		// #pragma use_bool "true "false;

		// В чем сложность символа # (решетки):

	// 1. Символ # требует отдельной строки. Из-за этого директиву #pragma нельзя спрятать внутрь #define:
	// #define MY_RULE #pragma ... <-- ТАК ПИСАТЬ ЗАПРЕЩЕНО, БУДЕТ ОШИБКА!

	// 2. Операция _Pragma решает эту проблему, так как пишется БЕЗ символа #:
	#define MY_RULE _Pragma("warning(disable:4996)")						// ОТЛИЧНО РАБОТАЕТ! Макрос можно вызывать в любой части кода;
*/

	/*
		Специфика символа # внутри макросов:
		Внутри #define символ # используется для особых свойств: превращения текста в строки (#) и склеивания слов (##).
		Поэтому классическую директиву #pragma нельзя спрятать внутрь макроса — препроцессор путает её со своими текстовыми операторами.
		Операция _Pragma создана специально, чтобы обойти эти ограничения, так как она пишется без решетки.
	*/




	// Обобщенный выбор, применение _Generic:
/*	// _Generic - это автоматический переключатель типов. _Generic(X) - аргумент в скобках является подставляемым значением;
	// Если аргументу макроса подставить значение, а значение имеет определенный тип, то _Generic определит какой это тип;
	// _Generic(X) работает только с типами данных;
	#define MYTYPE(X) _Generic((X),\
		int: "int",\
		float: "float",\
		double: "double",\
		default: "другой")

	int d = 5;
	printf("%s\n", MYTYPE(d));					// Макрос принимает переменную, которая имеет тип int, функция printf выведет строку int;
	printf("%s\n", MYTYPE(2.0 * d));			// Макрос принимает переменную, которая имеет тип double, функция printf выведет строку double;
	printf("%s\n", MYTYPE(2.0f * d));			// Макрос принимает переменную, которая имеет тип float, функция printf выведет строку float;
	printf("%s\n", MYTYPE(3L));					// Макрос принимает переменную, которая имеет тип long, но функция printf выведет строку "другой", т.к. в определении макроса отсутствует определение под данный тип; 
	printf("%s\n", MYTYPE(&d));					// Макрос принимает переменную, которая имеет адрес переменной, но функция printf выведет строку "другой", т.к. в определении макроса отсутствует определение указателя (адреса); 
*/

	// Создаем "всеядный" макрос для автоматического выбора нужного printf:
/*	#define УМНЫЙ_ПРИНТ(X) _Generic((X), \
		int: printf("Это целое число: %d\n", X), \
		double: printf("Это дробное число: %f\n", X), \
		char*: printf("Это текст: %s\n", X))

	int кошелек = 500;
	double бензин = 55.4;
	char* имя = "Алексей";

	// Вызываем один и тот же макрос для ВСЕХ типов!
	УМНЫЙ_ПРИНТ(кошелек);						// Компилятор определит тип int и подставит printf с %d;
	УМНЫЙ_ПРИНТ(бензин);						// Компилятор определит тип double и подставит printf с %f;
	УМНЫЙ_ПРИНТ(имя);							// Компилятор определит тип char* и подставит printf с %s;

	// Теперь самому не нужно думать, какой спецификатор применять, при помощи макроса с _Generic компилятор сам выберет нужное определение;
*/



	// Спецификатор inline:
/*
	// Пример правильной записи в заголовочном файле (.h):
	1. Спецификатор inline не нужен в 99% случаев для ручной оптимизации скорости.
	2. Современный компилятор в режиме Release сам решает, какие функции встраивать,
	   а какие оставлять обычными, полностью игнорируя или заменяя действия программиста.
	3. Единственная реальная польза inline static сегодня — это техническая возможность
	   легально написать код маленькой функции прямо внутри заголовочного (.h) файла.
	   Пример:
	inline static void eatline(void)		// static нужен, если в заголовочном файле пишется само тело функции. Без static, если подключить этот .h файл в несколько .c файлов,
	{										// компилятор выдаст ошибку дублирования кода при сборке. Спецификатор static говорит компилятору: "сделай независимую копию этой функции в каждом файле";
		while (getchar() != '\n')
			continue;
	}
*/



	// Спецификатор _Noreturn:
/*	// Пример правильной записи в заголовочном файле (.h):
	_Noreturn void critical_error(const char* message)
	{
		printf("\n!!! КРИТИЧЕСКАЯ ОШИБКА !!!\n");
		printf("Причина: %s\n", message);
		printf("Программа принудительно завершает работу.\n");

		exit(1);							// Экстренное закрытие ВСЕЙ программы. Возврата в main() физически НЕ БУДЕТ!
	}

	// В исполняемом файле:
	int pin_code;
	printf("Введите PIN-код для доступа к банку: ");
	scanf_s("%d", &pin_code);

	if (pin_code != 1234)	
		critical_error("Неверный пароль! Попытка взлома системы.");		// Вызываем функцию экстренного выхода;
	printf("Доступ разрешен. Добро пожаловать в личный кабинет.\n");	// Этот код выполнится, ТОЛЬКО если пин-код верный. Если пин-код неверный, мы до этой строчки никогда не дойдем!
	

	// Еще пример:
	// Спецификатор функции _Noreturn (Добавлен в C11):
	_Noreturn void critical_error(const char* message)					// _Noreturn говорит компилятору, что функция никогда не вернет управление в место вызова;
	{
		printf("Ошибка: %s\n", message);
		exit(1);														// Программа закрывается намертво внутри функции. Возврата в main не будет;
	}
*/

	/*
		Смысл применения _Noreturn:
		1. Это не замена void! Функция void возвращает управление обратно, а _Noreturn — прерывает выполнение программы или уходит в бесконечный цикл.
		2. Помогает компилятору оптимизировать код (не тратить ресурсы процессора на подготовку точки возврата из функции).
	*/

	// Спецификатор функции _Noreturn на практике:

	/*
		1. Используется для разметки функций экстренного выхода, защиты и обработки критических ошибок
		   (например: проверка паролей, доступ к базам данных, блокировка банковских карт).
		2. Сам по себе защиту не создает, но помечает для компилятора функции, внутри которых программа
		   закрывается намертво (через exit) или зацикливается.
		3. Помогает компилятору выбросить лишний машинный код, так как процессору больше не нужно
		   готовиться к возврату обратно в вызывающую функцию (main).
	*/




	// Преобразование прямоугольных координат в полярные:
/*	Rect_V input;
	Polar_V result;
	puts("Введите координыты x и y; введите q для выхода:");
	while (scanf_s(" %lf %lf", &input.x, &input.y) == 2)
	{
		result = rect_to_polar(input);
		printf("модуль = %0.2f, угол = %0.2f\n", result.magnitude, result.angle);	// Вывод текста на монитор. 2 аргумент - расстояние  до точки (координаты). 3 аргумент - угол до точки в градусах;
	}
	puts("Программа завершена.");
*/




	// Определение обобщенных макросов:
/*	float x = 45.0f;
	double xx = 45.0;
	long double xxx = 45.0l;
	long double y = SQRT(x);		// Вычисление квадратного корня. Вместо аргумента х макроса SQRT подставляется значение переменной х. Значение присваивается переменной y;
	long double yy = SQRT(xx);		// Вычисление квадратного корня. Вместо аргумента х макроса SQRT подставляется значение переменной хх. Значение присваивается переменной yy;
	long double yyy = SQRT(xxx);	// Вычисление квадратного корня. Вместо аргумента х макроса SQRT подставляется значение переменной ххх. Значение присваивается переменной yyy;
	printf("%.17Lf\n", y);
	printf("%.17Lf\n", yy);
	printf("%.17Lf\n", yyy);
	int i = 45;
	yy = SQRT(i);					// Вычисление квадратного корня. Вместо аргумента х макроса SQRT подставляется значение переменной i. Значение присваивается переменной yy;
	printf("%.17Lf\n", yy);
	yyy = SIN(xxx);					// Вычисление синуса (угла в градусах). Вместо аргумента ххх макроса SIN подставляется значение переменной ххх (угол 45 градусов). Значение присваивается переменной yyу;
	printf("%.17Lf\n", yyy);

	// Экспериментальный факт машинной точности в Visual Studio (MSVC):
	// Если вывести переменные yy (double) и yyy (long double) с точностью до 50 знаков, 
	// они совпадут до последней цифры. 
	// Причина: В компиляторе MSVC под Windows типы double и long double аппаратно склеены 
	// и имеют одинаковый размер (8 байт), поэтому вычисляются с абсолютно одинаковой точностью.
*/




	// Библиотека tgmath.h:
/*	#include <tgmath.h>			// Подключение библиотеки, в которой определены обобщенные макросы (они сами переключают типы);

	float x = 44.0f;
	double y;

	y = sqrt(x);				// Вызов макроса. Так как x имеет тип float, макрос автоматически вызовет функцию sqrtf(x) при помощи библиотеки tgmath.h, не нужно вручную создавать обобщенные макросы;
	y = (sqrt)(x);				// Вызов функции. Скобки вокруг имени заставляют препроцессор ПРОИГНОРИРОВАТЬ макрос из tgmath.h. В результате вызовется обычная базовая функция sqrt(x) для типа double из библиотеки math.h;
*/




	// Библиотека complex.h:
/*	// Создаем комплексные числа (используя заглавную букву I)
	double complex z1 = 1.0 + 3.0 * I;
	double complex z2 = 1.0 - 4.0 * I;
	double complex result = z1 * z2;		// В стандартном Си (GCC / Clang) комплексные числа можно просто умножать через знак '*'!;
	printf("Результат умножения: %.1f + %.1f * I\n", creal(result), cimag(result)); 	// Выводим результат на экран, разделяя вещественную и мнимую часть;
	printf("Модуль числа z1: %.2f\n", cabs(z1));		// Извлекаем модуль комплексного числа;

	// Пошаговая логика работы <complex.h>:
	// 1. double complex создает двухсекционную переменную (реальная часть + мнимая часть);
	// 2. Буква I — это маркер мнимой единицы. Всё, что на неё умножается, уходит во мнимую секцию;
	// 3. Знак '*' автоматически перемножает комплексные числа по правилам алгебры (учитывая, что I*I = -1);
	// 4. creal() достает только вещественное число, cimag() — только мнимое;
	// 5. cabs() находит расстояние (модуль) числа на плоскости по теореме Пифагора.


	// Заголовочный файл <complex.h> (Введен в C99);
	// Служит для работы с комплексной математикой (числа с мнимой единицей I, где I*I = -1);


	// 1. Предоставляет комплексные типы: float complex, double complex, long double complex.
	// 2. Математические функции начинаются с буквы 'c': cabs() (модуль), csin() (синус), creal() (реальная часть).
	// 3. Ограничение MSVC (Visual Studio): Компилятор Microsoft не поддерживает комплексные числа нативно.
	//    Полноценно и красиво стандартный <complex.h> работает только в компиляторах GCC и Clang.

	// Связь между библиотеками <tgmath.h> и <complex.h>:
	// 1. <tgmath.h> автоматически подключает внутри себя <math.h> и <complex.h>;
	// 2. Через макросы _Generic она объединяет обычные и комплексные функции под одним именем;
	// 3. Вызов sqrt(обычное_число) перенаправляется в math.h, а вызов sqrt(комплексное_число) автоматически превращается в csqrt() из complex.h.
	// Пример как работает связь:
	#define sqrt(X) _Generic((X), \
		float: sqrtf(X), \
		long double: sqrtl(X), \
		float complex: csqrtf(X), \
		long double complex: csqrtl(X), \
		double complex: csqrt(X), \
		default: sqrt(X) )
*/




	// Применение функции atexit:
/*	int n;
	atexit(sing_off);					// Функция atexit() декларирует функцию sing_off(), т.е. создается указатель на функцию sing_off();
	puts("Введите целое число:");
	if (scanf_s("%d", &n) != 1)			// Если введем число, блок if не выполнится, но после завершения функции main(), функция sing_off() задекларированная функцией atexit() вызовется;
	{
		puts("Это не целое число!");
		atexit(too_bad);				// Функция atexit() декларирует функцию too_bad(), т.е. создается указатель на функцию too_bad(). При этом функция too_bad() при вызове функции exit() вызовется первой, а функция  sing_off() вызовется следующей;
		exit(EXIT_FAILURE);				// В случае успешного завершения работы, считается код 0. Для завершения работы в случае ошибки выполнения кода применяется макрос EXIT_FAILURE, который равен 1;
	}
	printf("%d является %s.\n", n, (n % 2 == 0) ? "четным" : "нечетным");
*/




	// Использование быстрой сортировки для упорядочения групп чисел:
/*	double vals[NUM];
	fillarray(vals, NUM);
	puts("Список случайных чисел:");
	showarray(vals, NUM);
	qsort(vals, NUM, sizeof(double), mycomp);		// 1 аргумент - имя массива, в котором проведется сортировка. 2 аргумент - размер массива, количество элементов. 3 аргумент - размер элемента.
													// 4 аргумент - указатель на функцию-компаратор (сравнения). Т.к. функция qsort устроена так, что будет сама вызывать её сотни раз, передавая туда пары элементов, пока весь массив не отсортируется;
	puts("\nОтсортированный список:");
	showarray(vals, NUM);
													// при вызове функции если не приписывать скобки "()", получаем указатель на функцию, работает так же как и с массивом, где 1 элемент является указателем на массив.
													// qsort(vals, NUM, sizeof(double), mycomp);  // Краткая запись (компилятор сам сделает указатель).
													// qsort(vals, NUM, sizeof(double), &mycomp); // Полная запись (явное взятие адреса функции);
*/


	// Пример сортировки структур:
	/*
		struct names 
		{
			char first[40]; 
			char last [40];
		};
		struct names staff[100];

		// Определние функции для структуры:
		int comp(const void * p1, const void * p2)	
		{
			const struct names* psl = (const struct names*)p1;	// Получение правильного типа указателя;
			const struct names* ps2 = (const struct names*)p2;	// Получение правильного типа указателя;
			int res;  
			res = strcmp(psl->last, ps2->last);
			if (res != 0)										// Сравнение фамилий;
				return res;
			else	
				return strcmp(psl->first, ps2->first);			// Если фамилии одинаковы, поэтому сравниваем имена; 
		}
	*/
	


	
	// Использоваие макроса assert:
/*	double x, y, z;
	puts("Введите пару чисел (0 0 для завершения): ");
	while (scanf_s("%lf%lf", &x, &y) == 2 && (x != 0 || y != 0))
	{
		z = x * x - y * y;
		assert(z >= 0);
		printf("результатом является %f\n", sqrt(z));
		puts("Введите следующую пару чисел: ");
	}
	puts("Программа завершена.");
	// Макрос assert служит для отладки программы. Если, например, переменная z будет меньше 0, то программа аварийно завершится.
	// При этом на монитор выводится вызывана функция abort(), указывается номер строки, где допущена ошибка. Удобно искать, когда код большой;
	// Конструкция макроса:
	// Примерная логика работы assert(условие);
	// if (условие_ложно) 
	// {
	//	  вывести_в_консоль("КРИТИЧЕСКАЯ ОШИБКА: Условие не выполнено!");
	//	  вывести_в_консоль("Файл: main.c, Строка: 15");
	//	  завершить_программу_аварийно();
	// }
	// Когда завершили отладку, чтобы не удалять макросы с кода, перед включением библиотеки assert.h можно прописать макрос #define NDEBUG.
	// При этом программа не тратит ресурсы компьютера на макрос assert();
*/




	// Использоваие оператора объявления _Static_assert:
/*	_Static_assert(CHAR_BIT == 16, "Ошибочно предполагается 16-битовый тип char");	// Если вместо поставить 8, то программа скомпилируется;
	puts("Тип char имеет 16 бит.");
	// _Static_assert() применяется до компиляции. Когда оператор объявления _Static_assert в 1 аргументе видит, что левая и правая части не равны, 
	// то это ложь, логический 0. И программа сразуже не запустится.В журнале ошибок будет сообщение "Ошибочно предполагается 16-битовый тип char".
	// Это по прату

*/




	// Использование функций memcpy() и memmove():
/*	int values[SIZE] = {1, 2, 3, 4, 5, 6, 7, 8, 9, 10};
	int target[SIZE];
	double curious[SIZE / 2] = { 2.0, 2.0e5, 2.0e10, 2.0e20, 5.0e30 };			// Определяем массив из 5 элементов. Макрос,  который равен 10 просто делим пополам;
	puts("Использование memcpy():");
	puts("значения(исходные данные):");
	show_array(values, SIZE);
	memcpy(target, values, SIZE * sizeof(int));									// Копирование элементов одного массива в другой. 1 аргумент - целевой массив, 2 аргумент - массив, содержащий значения, 3 аргумент - сколько байт занимает массив (т.е. в зависимости какой тип данных имеют элементы);
	puts("целевые данные(копия значений):");
	show_array(target, SIZE);
	puts("\nИспользование memmove() с перекрывающимися областями:");
	memmove(values + 2, values, 5 * sizeof(int));								// Сдвиг элементов массива. 1 аргумент показывает с какого элемента начать сдвиг, 2 аргумент - массив, содержащий значения, 3 аргумент - сколько элементов нужно перезаписать, т.е. сколько элементов перезатрется (т.е. в зависимости какой тип данных имеют элементы);
	puts("значения -- элементы 0-5 скопированы в элементы 2-7:");
	show_array(values, SIZE);
	puts("\nИспользование memcpy() для копирования double в int:");
	memcpy(target, curious, (SIZE / 2) * sizeof(double));						// Копирование элементов одного массива в другой. 1 аргумент - целевой массив, 2 аргумент - массив, содержащий значения, 3 аргумент - сколько байт занимает массив (т.е. в зависимости какой тип данных имеют элементы);
	puts("целевые данные -- 5 значений double в 10 позициях int:");
	show_array(target, SIZE / 2);												// Функция покажет первые 5 элементов int. Это будут "половинки" от первых чисел double. Из-за разницы форматов (IEEE 754 и int) на экране отобразится визуальный "мусор" (случайные или очень большие числа); 
	show_array(target + 5, SIZE / 2);											// Функция покажет оставшиеся 5 элементов int. В этой части массива будут СОВЕРШЕННО ДРУГИЕ числа, так как сюда легли биты от второй половины набора double. Данные не дублируются, они просто полностью заполнили весь массив target (40 байт);
																				// Функция memcpy() может принимать данные любого типа, когда передаем тип double, в функции show_array() спецификатор для int биты преобразует по своему.
																				// Биты типа double (знак, экспонента, мантисса) идут по порядку (8 байт), тип int интерпретирует их по-своему, еще и дробит по 4 байта.
																				// В конечном результате может получится большое число, ноль, либо отрицательное число;

	// Прототипы функций:
	// void* memcpy(void* restrict si, const void* restrict s2, size_t n);
	// void* memmove(void* sl, const void* s2, size_t n);
	// Данные прототипы показывают, что они могут принимать любой тип данных;
	// Модификатор restrict указывает компилятору, что оба массива имеют разную область в памяти (данные между массивами не пересикаются), 
	// тем самым компилятор оптимизирует работу функции memcpy();
*/




	// Использование переменного числа аргументов (файл stdarg.h):
/*	double s, t;
	s = sum(3, 1.1, 2.5, 13.3);
	t = sum(6, 1.1, 2.1, 13.1, 5.1, 4.1, 5.1);
	printf("возвращаемое значение sum(3, 1.1, 2.5, 13.3): %g\n", s);
	printf("возвращаемое значение sum(6, 1.1, 2.1, 13.1, 5.1, 4.1, 5.1): %g\n", t);
*/

	// Пример копировании значений с помощью макроса va_copy: 
/*
	va_list ap;									// Объявление основного указателя для обхода аргументов;
	va_list apcopy;								// Объявление резервного указателя для хранения копии;
	double tic;
	int toc;
	...
	va_start(ap, lim);							// Инициализация: настраиваем ap на первый скрытый аргумент;
	va_copy(apcopy, ap);						// Макрос va_copy делает полную копию указателя ap и записывает её в apcopy;
	// Теперь apcopy указывает на то же самое место в памяти (на первый аргумент);
	tic = va_arg(ap, double);					// Извлекаем первый аргумент типа double из ap. Указатель ap сдвинулся вперед к следующему аргументу;
	toc = va_arg(ap, int);						// Извлекаем второй аргумент типа int из ap. Указатель ap снова сдвинулся вперед;

	// Зачем мы это делали?
	// Теперь указатель ap ушел вперед (прочитал два аргумента). 
	// Но у нас остался нетронутый apcopy, который ВСЁ ЕЩЕ указывает на самое начало списка аргументов!
	// Мы можем запустить новый цикл и прочитать аргументы заново, используя va_arg(apcopy, ...);

	va_end(ap);									// Деактивируем основной указатель;
	va_end(apcopy);								// КРИТИЧЕСКИ ВАЖНО: каждую копию, созданную через va_copy, 
												// обязательно нужно закрыть своим макросом va_end!
*/

	// Пример копировании значений с помощью макроса va_copy:
/*	print_above_average(5, 1.0, 2.0, 6.0, 8.0, 3.0);	// Передаем 5 чисел. Среднее будет (1.0 + 2.0 + 6.0 + 8.0 + 3.0) / 5 = 4.0. // Программа должна вывести числа больше 4.0 (то есть 6.0 и 8.0);
*/



	// Вопросы для самоконтроля:

	// Вопрос 2:
/*	#define	NEW(X) ((X) + 5)

	int y, berg, lob, est, nilp;
	y = NEW(y);
	berg = NEW(berg) * lob;
	est = NEW(berg) / NEW(y);
	nilp = lob * NEW(-berg);
*/

	
	// Вопрос 3:
//	#define VOL(X,Y) ((X) < (Y) ? (X) : (Y))


	
	// Вопрос 4:
//	#define	EVEN_GT(X,Y) ((X) % 2 == 0 && ((X) > (Y)))


	// Вопрос 5:
/*	#define PRINT(X,Y) printf("Результат " #X" = %d и " #Y" = %d.\n", X, Y)
	
	int i = PRINT(2 + 3, 2 * 3);		// Переменной присвоится длина строки;
*/


	// Вопрос 6:
/*	#define VOL 25
	#define SPACE ' '
	#define PS() putchar(SPACE) 
	#define BIG(X) (3 + (X))
	#define	SUMSQ(X,Y) ((X) * (X) + (Y) * (Y))
*/


	// Вопрос 7:
/*	#define PARAM(X) printf("имя: %s; значение: %d; адрес: %p\n", #X, X, &X)
	int i = 23;
	PARAM(i);
*/


	// Вопрос 8:
/*	// При отладке:
	#define NDEBUG
	// Какой то код:
	...
	...
	#undef NDEBUG
	#ifdef NDEBUG				// Вместо #ifdef, можно использовать #if, но если макросу только присвоено значение;
	// Какой то код:
	...					
	...
	...
	...
	...
	#endif 

	// При выключенной отладке:
	// Какой то код:
	...
	...
	#ifdef NDEBUG
	// Какой то код:
	...
	...
	...
	...
	...
	#endif 
*/


	// Вопрос 9:
/*	#define PR_DATE 1
	#if PR_DATE
	printf("Дата: %s.\n", __DATE__);
	#endif
*/


	// Вопрос 11:
/*	#define BL(X) _Generic((X),\
	_Bool: "boolean",\
	default: "not boolean")
*/


	// Вопрос 12:
/*	#include <stdio.h>
	#include <math.h>
	#include <stdlib.h>

	int main(int argc, char* argv[])
	{
		if (argc != 2)
		{
			puts("Необходимо ввсети <имя программы> <значение> ");
			exit(EXIT_FAILURE);
		}
		printf("Квадратный корень из %s равен %lf. \n", argv[1], sqrt(atof(argv[1])));
	}
*/


	// Вопрос 13:
/*	qsort(scores, SIZE, sizeof(int), comp);

	int comp(const void* pt_1, const void* pt_2)
	{
		const int* p1 = (const int*)pt_1;
		const int* p2 = (const int*)pt_2;
		if (*p1 < *p2)
			return 1;
		else if (*p1 == *p2)
			return 0;
		else
			return -1;
	}
*/


	// Вопрос 14:
/*	#define SIZE_1 100
	#define SIZE_2 300
	memcpy(data_1, data_2, SIZE_1 * sizeof(double));
	memcpy(data_1, data_2 + (SIZE_2 - SIZE_1), SIZE_1 * sizeof(double));
*/



	return 0;
}