#include <stdio.h>
#include <locale.h>
#include <stdlib.h>    

// int critic(void);                                                            // Задание 1;
// #define SIZE 1000															// К заданию 6;

int main(void)
{
    setlocale(LC_ALL, "RUS");
    setlocale(LC_NUMERIC, "C");

    // Задание 1:
/*    int units;
    printf("Введите число (попробую угадать): ");
    scanf_s("%d", &units);
    while (units != 56)
        units = critic();
    printf("Вы знали это! \n");
*/


	// Задание 2:
/*	int mode;
	printf("Введите 0 для метрического режима или 1 для американского режима: ");
	while(scanf_s("%d", &mode) != 1)										// Если scanf_s завершается ошибкой совпадения типов(ждали число, а пришла буква), то функция возвращает 0, компилятор принудительно записывает в  переменную - 1;
		clear();
	while (mode >= 0)
	{

		set_mode(mode);
		get_info();
		show_info();
		printf("Введите 0 для метрического режима или 1 для американского режима: ");
		printf(" (-1 для завершения): ");
		while (scanf_s("%d", &mode) != 1)									// Если scanf_s завершается ошибкой совпадения типов(ждали число, а пришла буква), то функция возвращает 0, компилятор принудительно записывает в  переменную - 1;
			clear();
	}
	printf("Программа завершена. \n");

	// Функция scanf_s возвращает результат 0 или 1, если результат не нужен можно прописать (void);
*/


	// Задание 3 (отдельно и совместно с заданием 4):
/*	float distanse = 0.0f, fuel = 0.0f;
	int mode = 0, meter;
	float* dist, * fu;
	int *p_mode;
	dist = &distanse;
	fu = &fuel;
	p_mode = &mode;

	printf("Введите 0 для метрического режима или 1 для американского режима: ");

	while (1)
	{
		if (scanf_s("%d", p_mode) != 1)
		{
			clear();
			printf("Ошибка ввода! Ожидалось число.\n");
			continue;
		}
		if (*p_mode < 0)
			break;
		set_mode(p_mode);										// Вызов функции, которая принимает в виде аргумента адрес указателя;
		get_info(p_mode, dist, fu);								// Вызов функции, которая принимает в виде аргумента адреса указателей;
		show_info(*p_mode, distanse, fuel);						// Вызов функции, которая принимает в виде аргумента значение переменной, на которую указывает указатель и значения переменных;
		count(1);												// Задание 4;
		printf("Введите 0 для метрического режима или 1 для американского режима: ");
		printf(" (-1 для завершения): ");
	}
	printf("Программа завершена. \n");
	printf("Количество циклов программы составляет %d раз(а). \n", count(0));	// Задание 4;
*/


	// Задание 5:
/*	int num[SIZE];
	generate(num, SIZE);														// Генерация чисел;
	printf("До сортировки. \n");
	view_num(num, SIZE);														// Вывод чисел;
	printf("\n\nПосле сортировки. \n");
	sort(num, SIZE);															// Сортировка чисел;
	view_num(num, SIZE);														// Вывод чисел;
	printf("\n");
*/


	// Задание 6:
/*	int num[SIZE];
	generate(num, SIZE);
*/

    return 0;
}

/*
int critic(void)                                                            // Задание 1
{
    int find;
    printf("Вам не повезло. Попробуйте еще раз. \n");
    scanf_s("%d", &find);
    return find;
}
*/