// diceroll.h
/*
#pragma once													// Включить этот заголовочный файл в код только один раз;
extern int roll_count;											// Объявление является ссылочным. Т.к. сама переменная объвлена не в основном файле, где функция main, компилятор, когда собирает программу, 
																// Сначала собирает по порядку код сверху вниз, но натыкается на переменную roll_count, но подключенная локальная библиотека diceroll.h дает значать,
																// что такая переменная существует, т.к. ей присвоен спецификатор (класс хранения) extern, компилятор разрешает сборку программы без ошибки. Дальше при сборке собирается следующий файл с расширением .с,
																// и там компилятор как раз видет эту переменную roll_count и выделяет под нее память;
int roll_n_dice(int dice, int sides);							// Прототип функции, который можно подключать с любого файла программы при условии добавления заголовочного файла, в котором он содержится;
*/

