#include <stdio.h>
#include <locale.h>
#include <stdlib.h>															// Бибилиотека, где содержится необходимая функция rand();
#include <time.h>															// Библиотека для подключения функции time();
#include "diceroll.h"														// Локальная блиотека для подключения функции roll_n_dice();
#include <stdatomic.h>														// Для работы со спецификатором _Atomic;
#include <stdatomic.h>														// Для работы с функцией atomic_store;


// int units = 0;															// Использование внешней переменной, т.к. она объявлена вне функций и видна во всем фйле ниже точки своего объявления. Данная переменная является глобальной, действует на весь файл.
																			// Если нужно использовать переменную в другом файле, то нужно в этом файле прописать глобально extern int units или в функции прописать. Инициализировать в другом файле будет ошибка.
																			// Но ее можно изменять - применять в арифметических выражениях, в сравнениях, игкрементировать и.т.п.;
// int count = 0;																// Разнообразные классы хранения, применения разных спецификаторов видимости. Область применения в пределах файла, также  внешнее связывание, в другом файле с помощью спецификатора extern,
																			// можно применить переменную;

// void trystat(void);														// Использование локальной статической переменной;

// void critic(void);														// Использование внешней переменной;

// void report_count();														// Разнообразные классы хранения, применения разных спецификаторов и квалификаторов видимости. Прототип функции, которая ничего не принимает (пустые скобки равнозначно void это для С23, в других случаях принимает неизвестое количество и типов аргументов). Эту функцию можно вызвать с другого файла;
// void accumulate(int k);													// Разнообразные классы хранения, применения разных спецификаторов и квалификаторов видимости. Прототип функции, которая принимает переменную типа int. Эту функцию можно вызвать с другого файла;;

int main(void)
{
	setlocale(LC_ALL, "RUS");
	setlocale(LC_NUMERIC, "C");


	// Переменные в блоках:
/*	int x = 30;																// Исходная переменная внешнего блока;
	printf("x во внешнем блоке: %d по адресу %p \n", x, &x);
	{
		int x = 77;															// Новая переменная во внутреннем блоке (одноименная переменная, не копия). Находится уже по другому адресу;
		printf("x во внутреннем блоке: %d  по адресу %p \n", x, &x);
	}
	printf("x во внешнем блоке: %d по адресу %p \n", x, &x);				// Исходная переменная внешнего блока, которая не претерпела никаких изменений;
	while (x++ < 33)														// Исходная переменная внешнего блока, использующаяся в цикле while;
	{
		int x = 100;														// Очередная новая переменная во внутреннем блоке (одноименная переменная, не копия). Находится уже по другому адресу;
		x++;
		printf("x в цикле while: %d по адресу %p \n", x, &x);				// Очередная новая переменная во внутреннем блоке, которая изменяет свое значение в цикле 3 раза;
	}
	printf("x во внешнем блоке: %d по адресу %p \n", x, &x);				// Исходная переменная внешнего блока, которая изменила свое значение, т.к. в цикле while инкрементировалась, но адрес все тот же;
																			// ВАЖНО!!! При написании программы, переменным лучше давать разные имена, чтобы не запутаться и код был читабельный;
*/

	
	// Новые правила для блоков в С99:
/*	int n = 8;																// Исходная переменная внешнего блока;
	printf("	Первоначально n = %d по адресу %p \n", n, &n);
	for(int n = 1; n < 3; n++)												// Новая переменная использующаяся в цикле for, исходная переменная перестает быть видимой для компилятора.
		printf("	цикл 1: n = %d по адресу %p \n", n, &n);				// Эта переменная имеет другой адрес отличный от исходной переменной. Несмотря отсутствия фигурных скобок, переменная относится к циклу for;
	printf("	После цикла 1: n = %d по адресу %p \n\n", n, &n);			// После завершения цикла новая переменная становится невидима, становится видимой исходная переменная;
	for (int n = 1; n < 3; n++)												// Очередная новая переменная использующаяся в цикле for, исходная переменная перестает быть видимой для компилятора.
	{																		// Эта переменная имеет другой адрес отличный от исходной переменной. Несмотря отсутствия фигурных скобок, переменная относится к циклу for;
		printf("	индекс цикла 2: n = %d по адресу %p \n", n, &n);
		int n = 6;															// В блоке цикла создается очередная одноименная переменная, которая имеет свой адрес в памяти, при этом переменная цикла становится невидимой.
		printf("	цикл 2: n = %d по адресу %p \n", n, &n);
		n++;																// Эта переменная инкрементируется, но адрес не меняется. После завершения итерации цикла, становится видимой переменная созданная в условии цикле,
	}																		// а переменная созданная в блоке цикла невидимой.
	printf("	После цикла 2: n = %d по адресу %p \n", n, &n);				// После завершения цикла for становится видимой исходная переменная внешенго блока. Циклы - это своего рода, внутренний блок;

																			// ВАЖНО!!! При написании программы, переменным лучше давать разные имена, чтобы не запутаться и код был читабельный;
*/


	// Регистровые переменные:
/*	int main(void)
	{
		register int quick;													// Переменная находится в памяти процессора (в так называемые регистры), которая является быстродейственней по отношению к памяти данных (ОЗУ), но по объему значительно меньшей.
	}																		// Если объема памяти не хватить места эта переменная может автоматически записаться в память данных. Чтобы записать туда переменную нужно применить спецификатор register;
																			// Но есть ограничение в области указателей, с их помощью нельзя обратится к переменной, а также взять адрес;

	void macho(register int quick)											// Для обращения к этой переменной, нужно обратится с ключевым словом register, как показано в примере. При вызове такой функции достаточно прописать macho(quick);
*/


	// Использование локальной статической переменной:
/*	int count;
	for (count = 1; count <= 3; count++)
	{
		printf("Начинается итерация %d \n", count);
		trystat();
	}
*/


	// Использование внешней переменной:
/*	extern int units;														// Необязательное повторное объявоение переменной. Данную строку можно было бы не писать. Если написать int units, то создастся одноименная (автоматическая) локальная переменная, которая скроет внешнюю переменную;
	printf("Сколько функтов весит маленький бочонок масла? \n");
	scanf_s("%d", &units);
	while (units != 56)
		critic();															// Функция critic не берет аргумент, она ничего не принимает. Функция работает с units, т.к. она задействована в этой функции (прописана);
	printf("Вы знали это! \n");
*/


	// Статическая переменная с внутренним связыванием:
/*	int traveler = 1;														// Глобальная переменная с внешним связыванием;
	static int stayhome = 1;												// Глобальная переменная с внутренним связыванием;
	int main(void)
	{
		extern int traveler;												// Данная переменная может использоваться как в этом же файле так и в другом;
		extern int stayhome;												// Данная переменная может использоваться только в этом же файле так, в другом нельзяю
																			// Чтобы использовать перменную stayhome в функциях этого же файла, писать extern int stayhome не нужно,
																			// это ошибка из-за конфликта типов связывания, достаточно написать имя переменной;
	}
*/


	// Разнообразные классы хранения, применения разных спецификаторов и квалификаторов видимости (часть 1):
	// Применить с файлом Storage class PART2:
/*	int value;																// Автоматическая переменная (локальная переменная). Живет только в этом блоке;
	register int i;															// Переменная, которая записана в регистровую память процессора, но также может записать в область памяти данных, она видна только в данном блоке;	
	printf("Введите целое положительное число (0 для завершения):");
	while (scanf_s("%d", &value) == 1 && value > 0)
	{
		++count;															// Префиксный инкремент глобальной переменной, данная переменная видна во всем файле;
		for (i = value; i >= 0; i--)
			accumulate(i);													// Вызов функции, которая принимает значение переменной и определена в другом файле;
		printf("Введите целое положительное число (0 для завершения):");
	}
	report_count();															// Вызов функции, которая ничего не принимает. Блок этой функции выводит только сообщение;
*/



	// Бросание множества костей:
/*	int dice, roll;																	// Автоматические переменные (локальные), которые видны в блоке функции main;
	int sides;																		// Автоматическая переменная (локальная), которая видна в блоке функции main;
	int status;																		// Автоматическая переменная (локальная), которая видна в блоке функции main;
	srand((unsigned int)time(0));													// Рандомизация начального числа. Сначала выполнится действие функции time(0), затем значение приведется к типу int без знака, далее это значение уже обработает функция srand();
	printf("Введите количество граней кости или 0 для завершения программы. \n");
	while (scanf_s("%d", &sides) == 1 && sides > 0)									// Если ввели некоректное значение граней (сторон) и количесвто сторон меньше или равно 0, произойдет выход из программы;
	{
		printf("Сколько костей? \n");
		if ((status = scanf_s("%d", &dice)) != 1)									// Данное условие выполнится при условии если ввели некорректное занчение, это могут быть отрицательные числа, буквы, знаки; 
		{
			if (status == EOF)														// Если ввести конец файла (Ctrl+z) произойдет выход из программы. В другом случае выполнится условие else;
				break;
			else                                                                    
			{
				printf("Вы должны ввести целое число.");
				printf(" Давайте начнем сначала. \n");
				while (getchar() != '\n')											// Очтщение буфера ввода всяких символов;
					continue;
				printf("Сколько граней? Для прекращения введите 0. \n");
				continue;															// Новая итерация цикла;
			}
		}
		roll = roll_n_dice(dice, sides);											// Вызов функции, которая определена в файле Storage class PART2. Функция roll_n_dice вернет значение от 1 до 6;;
		printf("Вы бросали %d раз(а), используя %d кости c %d гранями. \n", roll, dice, sides);
		printf("Сколько граней? Для прекращения введите 0. \n");
	}
	printf("Функция rollem() была вызвана %d раз(а). \n", roll_count);				// Выведется сообщение сколько раз вызывалась функция в программе. Данное значение вычисляется в функции rollem;
	printf("Пусть удача не покидает вас! \n");
*/
	// srand((unsigned int)time(0)) - "time(0)" берет текущее время компьютера в секундах, которое отсчитывается от 1970 года (дата создания UNIX),
	// 0 в скобках означает, что time(0) берет текущее значение и использует его для настройки генератора случайных чисел. time() в скобках ждет адрес (указатель) куда будет записано это число.
	// Но функции time(0) передаем 0, что означает - передавать адрес, куда зписывать значение не надо. Если в скобках указать 1, 2, 3 и т.д., произойдет авария программы, т.к. это место в оперативной памяти предназначено для системы.
	// (unsigned int) - переводит это время в обычный формат целого числа, понятный для генератора. 
	// srand(...) — загружает полученное число секунд в генератор случайных чисел как «стартовую точку», т.е. функция rand() возьмет это значение для расчетов в файле Storage class PART2;



	// Динамически выделенный массив (применение функции malloc(), free():
/*	double* ptd;														// Создаем указатель на тип double. Данный казатель применяется для создания массива с помощью функции malloc();
	int max = 0;
	int number;
	int i = 0;
	puts("Введите максимальное количество элементов типа double.");
	if (scanf_s("%d", &max) != 1)
	{
		puts("Количество введено некорректно -- программа завершена.");
		exit(EXIT_FAILURE);												// Функция exit(EXIT_FAILURE) (прототип определен в библотеке stdlib.h. Если при проверке ввести не число, то произойдет аварийный выход из программы;
	}
	ptd = (double*)malloc(max * sizeof(double));						// Об объеме выделения в памяти функция malloc узнает из (max * sizeof(double), выделяестя объем в памяти. Функции malloc возвращает универсальный адрес void* (неопределнный указатель, компилятору не известо какой шаг в байтах делать между значениями), чтобы превратиь в адрес конкретного типа используется приведение к типу double;
	if (ptd == NULL)													// Указателю ptd присваивается адрес начала массива. В случае если невозможности выделить нужный объем в памяти, функция malloc вернет значение 0 (NULL);
	{
		puts("Не удалось выделить память. Программа завершена");
		exit(EXIT_FAILURE);												// Произойдет аварийный выход из программы;
	}

	puts("Введите значение (q для выхода):");							// Указатель ptd теперь указывает на массив из max элементов;
	while (i < max && scanf_s("%lf", &ptd[i]) == 1)						// После успешного размещения массива в памяти (при этом имя массива не существует), производится проверка цикла и программа просит ввести значения;
		++i;															// "i < max" дает программе горантию, что введенные те значения, которые не поместились в заявленный объем, программа ими не воспользуется, они не запишутся в память данных, они останутся висеть в буфере ввода stdin. Чтобы там эти значения не висели можно вычистить буфер с помощью getchar.
	printf("Введено %d элементов: \n", number = i);						// В случае елсли не было этой проверки программа будет работать некорректно, что может привести к аварийной остановки программы;
	for (i = 0; i < number; i++)										// Происходит вывод на экран символов;
	{
		printf("%7.2f", ptd[i]);
		if (i % 7 == 6)													// Вывод символов по 7 значений в одну строку. Например  7 в 6 поместится 0 раз, итого 6 - (7 * 0) = 6 - 0 = 6. Значение 6 означает индекс массива;
			putchar('\n');
	}
	if (i % 7 != 0)														// Если если в новой строке не окажется выеденных символов, даже одного, ввода новой строки не будет;
		putchar('\n');
	puts("Программа завершена. \n");
	free(ptd);															// Прежде завершить программу или цикл необходимо очистить память от массива, иначе при повторном использовании функции malloc() создастся еще массив с таким же или другим количеством элементов.
																		// Что может привести к переполнению в памяти данных, а так же будет отсутствовать доступ к предыдущему созданному массивую. ptd теперь указывает на мусор;
*/


/*
	Функция calloc как и malloc выделяет место в памяти данных, за исключением, что функция calloc выделеным байтам в области памяти данных присваивается 0.
	Так же функция возвращает реальный адрес на void* (универсальный адрес). Чтобы компилятор понимал сколько шагов в байтах делать необходимо приведение к типу,
	как указано ниже в примере:
	long* ptd;
	ptd = (long*)calloc(100, sizeof(long));

	sizeof(long) равно 8 байтам, чтобы уместить 100 значений необходимо 800 байт. Функция calloc  возвращает универсальный адрес void* (реальный адрес).
	(long*)calloc - чтобы компилятор мог определить какой шаг в байтах делать производится приведение к типу указателя, т.е. шаг по 8 байта. Указателю ptd присваиваится начальный адрес массива;
*/


	// Разновидности определния массивов:
/*	int n = 5;
	int m = 6;
	int ar2[n][m];										// Массив переменной длины n х m. В практике не используется в связи с отсутствием безопасности работы программы, 
														// т.к. переменные могут менять размер массива из-за чего компилятор может затереть нужную область другими значениями в области памяти;

	int (*р2)[6];										// Указатель на строку из 6 элементов двумерного массива;

	int (*рЗ)[m];										// Требуется поддержка массивов переменной длины. Указатель на строку из m элементов двумерного массива. Если вместо цифрового обозначения размера массива, используется переменная, 
														// то это массив переменной длины. Программа может выдать ошибку, если попытаться изменить размер массива, программа не скомпилируется, в связи с отсутствием безопасности работы программы, 
														// т.к. переменные могут менять размер массива из-за чего компилятор может затереть нужную область другими значениями в области памяти;

	р2 = (int (*)[6]) malloc(n * 6 * sizeof(int));		// Указателю p2 присваивается адрес начала динамического массива из n строк по 6 элементов. 
														// Массив выделяется в куче, его размер зависит от n в момент вызова, и для экономии памяти 
														// он должен обязательно использоваться в паре с функцией free(), иначе память (куча) может забиться быстро, что может привести к аварийной остановку програмы.
														// В отличии от массива переменной длины (VLA), динамический массив отличается тем, что при применении функции free полностью пропадает и это место в памяти (куча) займется уже другим массивом, может быть и другого размера
														// а в массиве переменной длины вместо цифрового обозначения размера массива, используется переменная;
	
	р3 = (int (*)[m]) malloc(n * m * sizeof(int));		// Указателю p3 присваивается адрес начала динамического массива из n строк по m элементов. 
														// Массив выделяется в куче, его размер зависит от n (строк) и m (элементов) в момент вызова, и для экономии памяти 
														// он должен обязательно использоваться в паре с функцией free(), иначе память (куча) может забиться быстро, что может привести к аварийной остановку програмы.
														// В данном случае создается динамический массив переменной длины, т.к. в скобках вместо цифрового обозначения количества элементов и спользуется переменная m;
*/

	// Неправильное использование массива переменной длины:
/*	void process_data(void)															// Перед началом работы программы, компилятор выделяет определнный размер в стеке (например 1Мб, это в зависимости от настроек компилятора);
	{
		int n;
		printf("Введите количество элементов для обработки: ");
		scanf_s("%d", &n);															// Если ввести 10, то программа отрежет от куска в 1Мб 40 байт для массива;
																					// Если введем больше, нарпимер, 400000, то в итоге значение превысит 1Мб, то пррограмма аварийно завершится;
		// === КРИТИЧЕСКАЯ ОПАСНОСТЬ БЕЗ ПРОВЕРКИ ===
		int vla_arr[n];

		// Компьютер дойдёт сюда, только если программа не вылетит на строке выше
		vla_arr[0] = 100;
		printf("Данные успешно записаны в ячейку: %d\n", vla_arr[0]);
	}
*/



	// Где что находится в памяти:
/*	int auto_store = 40;
	char auto_string[] = "Автоматический массив char";
	int* pi;
	char* pcl;
	pi = (int*)malloc(sizeof(int));
	if (pi != NULL)
	*pi = 35;																		// 100% безопасно, если проверка пройдена, в динамическом сегменте выделно место;
	else
	return EXIT_FAILURE;															// Выход из программы, если память не выделилась
	pcl = (char*)malloc(strlen("Динамическая строка") + 1);								// +1 для символа конца строки \0;
	if (pcl != NULL)																	// 100% безопасно, если проверка пройдена, в динамическом сегменте выделно место;
	strcpy_s(pcl, strlen("Динамическая строка") + 1, "Динамическая строка");		// +1 для символа конца строки \0;
	else
	{
		free(pi);																		// Не забываем очистить первый указатель перед аварийным выходом (при условии что он уже не нужен);
		return EXIT_FAILURE;
	}
	printf("%-25s %-5d по адресу %p \n", "static_store:", static_store, &static_store);							// Глобальная переменная содержащая значение хранится в области сегмента данных (Data Segment с расширением .data)
	printf("%-25s %-5d по адресу %p \n", "auto_store:", auto_store, &auto_store);								// Автоматическая (локальная) переменная хранится в сегменте памяти "Стек" (Stack);
	printf("%-25s %-5d по адресу %p \n", "*pi:", *pi, pi);														// Сам указатель лежит в сегменте памяти "Стек" (Stack), но функция выводит адрес первого значения массива в динамической памяти из КУЧИ (Heap), где хранится число 35;
	printf("%-25s %-30s по адресу %p \n", "pcg (литерал):", pcg, pcg);											// Указатель лежит в сегменте памяти "Стек" (Stack), но адрес строкового литерала хранится в сегменте с расширением .rodata;
	printf("%-25s %-30s по адресу %p \n", "auto_string (стек):", auto_string, auto_string);						// Автоматический (локальный) массив хранится в сегменте памяти "Стек" (Stack);
	printf("%-25s %-30s по адресу %p \n", "pcl (куча):", pcl, pcl);												// Сам указатель лежит в сегменте памяти "Стек" (Stack), но функция выводит адрес динамической памяти из КУЧИ (Heap), выделенной через malloc. Cмощью функции strcpy туда копируются символы текста;
	printf("%-25s %-30s по адресу %p \n", "Строка в кавычках:", "Строка в ковычках", "Строка в кавычках");		// Строковый литерал хранится в сегменте с расширением .rodata;
	free(pcl);
*/

/*
	Сегмент кода и только для чтения (.rodata): Здесь хранятся адреса, на которые указывает pcg, а также сам литерал "Строка в кавычках". Эта память защищена от изменений.
	Сегмент инициализированных данных (.data): Здесь выделено место под глобальную переменную static_store. Для неинициализированных расширение .bss.
	Стек (Stack): В этой области находятся автоматические локальные переменные auto_store, auto_string, а также сами коробочки-указатели pi, pcg и pcl.
	Куча (Heap): В эту область ведут адреса, хранящиеся внутри указателей pi (где лежит число 35) и pcl (где лежат скопированные символы динамической строки).
*/


// Квалификатор const:
/*	const int nochange;							// Если при объявлении переменной применен квалификатор const, то изменить значение уже нельзя;
	nochange = 12;								// ОШИБКА!!!
	const int nochange = 12;					// Если сразу при объявлении переменной проинициализировали, то ее изменить потом нельзя;

	const int days[12] = { 31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31 }; // К массиву применен квалификатор const. Изменять значения массива нельзя;

	const float* pf;							// Указатель указывает на константное значение, которое нельзя изменять. Значение указателя (адрес) можно изменить;
	float* const pt;							// Указатель указывает на значение, которое можно изменять. Адрес указателя нельзя менять;
	const float* const ptr;						// Указатель указывает на константное значение, которое нельзя изменять. Адрес указателя нельзя менять;
*/

/*
	Если const стоит слева от звёздочки (const float * pf или float const * pf — это одно и то же): константным является то, на что смотрят (значение менять нельзя, адрес — можно).
	Если const стоит справа от звёздочки (float * const pt): константным является сам указатель (адрес менять нельзя, значение по адресу — можно).
	Если const и слева, и справа (const float * const ptr): заблокировано абсолютно всё.
*/

/* file1.с -- определение нескольких глобальных констант */
/*	const double PI = 3.14159;
	const char* MONTHS[12] =														// Массив указателей, в котором хранятся адреса строковых литералов;
	{ "Январь", "Февраль", "Март", "Апрель", "Май", "Июнь", "Июль",
		"Август", "Сентябрь", "Октябрь", "Ноябрь", "Декабрь" };
/* file2.c -- использование констант, определенных где-то в другом месте */
/*	extern const double PI;
	extern const char* MONTHS[];
/*
	В файле file1.с создаются переменная и массив с квалификатором const.
	В файле file2.с происходит связь с данными константами с применением спецификатора extern, которые доступны только для чтения.
	Данный подход экономит память данных;
*/


/* constant.h -- определение нескольких глобальных констант */
/*	static const double PI = 3.14159;
	static const char* MONTHS[12] =													// Массив указателей, в котором хранятся адреса строковых литералов;
	{ "Январь", "Февраль", "Март", "Апрель", "Май", "Июнь", "Июль",
		"Август", "Сентябрь", "Октябрь", "Ноябрь", "Декабрь" };
	/* file1.с -- использование констант, определенных где-то в другом месте */
//	#include "constant.h"
	/* file2.c -- использование констант, определенных где-то в другом месте */
//	#include "constant.h"


/*
	Чтобы не использовать спецификатор extern для доступа к переменным ил массива, можно создать заголовочный файл с эти константами.
	В файле file1.с и file2.с подключается библиотека constant.h и эти файлы уже могут пользоваться этими константами.
	Помимо применения квалификатора const - чтобы запретить изменять значения, применен спецификатор static для того, чтобы линковцик при сборке не натыкался на одноименные константы
	в одном файле потом в другом, что может привести к путанице. В итоге в каждом файле создаются свои переменные или массивы, то есть копии с одинаковыми именами,
	которые видны только для своего файла. Минус такого варианта, что объем памяти будет расходовать больше, особенно если применять массивы с огромным количеством значений,
	тем самым программа станет "тяжелее".
*/


	// Квалификатор типа volatile:
/*
	Оптимизация - когда компилятор взял значение переменной из памяти данных в память процессора (регистровую память), где происходят все вычисления,
	и пока происходит работа с этим значением, пока не изменится или происходят математические вычисления,
	это значение не вернется обратно в ячейку памяти.

	Кэширование - в процессе каких-либо вычислений в памяти процессора, происходит сохранение промежуточного результата в регистровой памяти,
	чтобы этот результат снова использовать для вычислений. Также кеш памяти процессора используется перед началом использовании, например, блока программы.
	Компилятор берет этот блок из памяти данных и копирует в память процессора, когда доходит очередь программы до этого блока, процессор сразу обрабатывает этот блок.
	Сделано для того, чтобы прграмма не обращался в более медленную память данных. ;

	Квалификатор volatile указывает компилятору, что значение этой переменной может
	измениться извне (например, другой программой, фоновым потоком или аппаратным датчиком).

	Он ЗАПРЕЩАЕТ компилятору оптимизировать работу с переменной через регистры процессора,
	происходит игнорирование кэша (памяти процессора).
	Процессор обязан при каждом упоминании переменной в коде честно обращаться напрямую
	в оперативную память (ОЗУ) для чтения или записи, чтобы всегда иметь актуальное значение.

	Сделано для того, чтобы в случае изменения значения извне, процессор заметил, что значение изсенилось и не стал работать страрым значением.
	Когда процессор производит вычислания, он уже обращается в память данных, где лежит значение переменной с квалификатором volatile,
	и брал для следующих вычислений;
*/

/*
	volatile int locl;								// Переменная является изменчивой. Какая-либо программа или сама программа, в которой находится такая переменная, будет обращаться, непосредственно к памяти данных, а не к регистровой памяти;
	volatile int* ploc;								// Указатель указывает на изменчивую переменную. Какая-либо программа или сама программа, в которой находится адрес переменной, будет обращаться, непосредственно к памяти данных, а не к регистровой памяти;

	volatile const int loc;							// Переменную нельзя будет изменять в программе, в которой находится переменная. Какая-либо внешняя программа, которая будет обращаться, непосредственно к памяти данных, а не к регистровой памяти, может изменять это значение;
	const volatile int* ploc;						// Указатель указывает на неизменчивую переменную, программа, которая содержит этот указатель на переменную не может изменять. Какая-либо внешняя программа, которая обращается по этому адресу к переменной сможет изменить значение;
*/


	// Квалификатор типа restrict (данный квалификатор работает только с указателями):
/*	int ar[10];													// Массив из 10 элементов;
	int* __restrict restar = (int*)malloc(10 * sizeof(int));	// Обявление указателя на динамический массив с квалификатором __restrict. Квалификатор __restrict дает знать компилятору, что имено указатель restar указывает только на определнную область в памяти данных и обещаем компилятору, что ни один указатель не будет обращаться к этому массиву.
																// В противном случае могут быть баги в программе, т.е. здесь уже зависит от программиста. И тем самым программа оптимизируется, т.е. данные динамического массива можно поместить в процессорную память и провести с ними вычисления, вместо того чтобы обращатся по уазателю в медленную память данных;
	int* par = ar;												// Указателю присваивается адрес массива (первого элемента массива);

	for (int n = 0; n < 10; n++)
	{
		par[n] += 5;											// Указатель указывает на элемент n массива ar и прибавляет 5. Программа вынуждена каждый раз брать это значение из медленной памяти данных (ОЗУ) и сразу записывать обратно, так как у указателя par нет квалификатора __restrict, и компилятор боится скрытых изменений в этой ячейке;
		restar[n] += 5;											// Элемент динамического массива n прибавляет 5. Т.к. при объявлении указателя restar к нему был применен квалификатор __restrict, т.е. программа бурет значение из памяти данных и помещает в память процессора для быстрых вичислений;
		ar[n] *= 2;												// Элемент массива n умножается на 2. Т.к. на элемент n обращается массив ar и указатель par, программа страхуется и обращается к этому значению только из памяти данных. Если был бы квалификатор __restrict, то программа взяла бы эти значения смело в процессорную память;	
		par[n] += 3;											// Указатель указывает на элемент n массива ar и прибавляет 3. Программа вынуждена каждый раз брать это значение из медленной памяти данных (ОЗУ) и сразу записывать обратно, так как у указателя par нет квалификатора __restrict, и компилятор боится скрытых изменений в этой ячейке;
		restar[n] += 3;											// Элемент динамического массива n прибавляет 3. Т.к. при объявлении указателя restar к нему был применен квалификатор __restrict, т.е. программа берет значение из памяти данных и помещает в память процессора для быстрых вычислений;;
	}
*/

	/* 
		Если в программе только массив, программа смело помещает данные в процессорную память их обрабатывает. 
		Если в программе не применен квалификатор __restrict, то программа значения, на которые указывает указатель или которые содержит массив,
		берет и обрабатывает непосредственно в сегменте памяти данных. Компилятор по умолчанию настроен для безопасной работы, чтобы вычисления были корректны.
		Поэтому он так себя ведет - подстраховывается. При применении квалификатора __restrict, ответственный уже программист, обещает программе, что можно смело брать данные 
		с памяти данных и помещать их в область процессорной памяти. Если результат ошибочный, то вина лежит на программисте.
	*/

	// Функции обмена данными между указателями:
/*	void* memcpy(void* restrict s1, const void* restrict s2, size_t n);		// Примененный спецификатор к указателю s1 и s2 говорит компилятору, что доступ к данным имеет только указатель s1 и s2 соответсвенно и эти области памяти не пересекаются между собой.
																			// И программа может смело брать данные с памяти данных в процессорную память. При этом нельзя изменять данные, на которые указывает указатель s2;
	void* memmove(void* s1, const void* s2, size_t n);
*/																			// К данной функции отсутствует потребность в квалификаторе restrict. Данная функция допускает пересечение данных указателей,
																			// так как в ней реализована защита от наложений (если два указателя указывают на одну и ту же область в памяти данных).
																			// Из-за этого программа будет вынуждена обращаться напрямую к значениям в области памяти данных. Если применить здесь restrict,
																			// компилятор поверит, что указатели являются единственными для доступа к своим значениям. В итоге мы уберем защиту от наложения областей,
																			// и при реальном пересечении адресов произойдет некорректная перезапись значений;

																			// size_t n — это количество байт, которое функция должна скопировать из одного места памяти в другое. 
																			// Если копируем массив из 5 целых чисел (int), то передавать нужно не цифру 5, а общий размер в байтах, это 20;

		

	// Спецификатор _Atomic:
/*	_Atomic int hogs;														// Сохранение значения в атомарном режиме - это значит, когда в этой программе происходит работа со значением, то другие потоки не могут прервать этот процесс,
																			// то же самое происходит, когда другие внешние программы обращаются к этому значению, но в обоих случаях имеют доступ к этому значению;
	atomic_store(&hogs, 12);												// Макрос-функция. Это команда компилятору: Запиши число 12 прямо в ОЗУ, заблокируй на это мгновение шину процессора от других ядер и не пытайся оптимизировать или откладывать эту запись.
																			// Данная макрос-функция блокирует оптимизацию и производит мгновенную запись значения в переменную;
*/


	return 0;

}

/*
void trystat(void)															// Использование локальной статической переменной;
{
	int fade = 1;															// Переменная внутреннего блока;
	static int stay = 1;													// Статическая переменная внктреннего блока. При применении квалификатора static, в памяти данных всегда будет зарезервировано место для значения переменной.
	printf("fade = %d и stay = %d \n", fade++, stay++);						// В данном случае, когда завершается функция, значение переменной сохраняется. Когда произойдет снова вызов функции trystat, занчение переменной сохранится,
}																			// в отличии от переменной fade, которая при каждой итерации создается с присвоенным одним и тем же значением, которое находится во внутреннем блоке функции;
																			// Действие перменной stay ограничено только функцией. Данная создается не настеке ОЗУ, а в специльном сегменте пямяти данных ОЗУ.
																			// Использовать модификатор static прототипах функции запрещено;
*/

/*
void critic(void)
{
	// Необязательное повторное объявоение переменной. Переменная в функции не прописана, но функция ее видит, т.к. переменная внешняя (глобальная);
	printf("Вам не повезло. Попробуйте еще раз. \n");
	scanf_s("%d", &units);
}
*/

/*
void report_count()															// Разнообразные классы хранения, применения разных спецификаторов и квалификаторов видимости (часть 1);
{
	printf("Цикл выполнен %d раз(а) \n", count);							// Блок этой функции выводит только сообщение, это вывод текущего значения глобальной переменной;
}
*/