#include <stdio.h>
#include <locale.h>
/*
extern int count;																	// Разнообразные классы хранения, применения разных спецификаторов и квалификаторов видимости (часть 2). Ссылочное объявление с помощью квалификатора extern, который связывает переменную с другого файла;
static int total = 0;																// Разнообразные классы хранения, применения разных спецификаторов и квалификаторов видимости (часть 2). Глобальная переменная объявленая со спецификатором static, которая видна только в этом файле;

void accumulate(int k);																// В данном файле необязательно было писать прототип функции,
																					// Т.к. ниже написано объявление этой функции;
void accumulate(int k)														
{
	static int subtotal = 0;														// Локальная переменная объявленая со спецификатором static, которая видна только в этом блоке, но после завершения работы этой функции значение переменной сохранится.
	if (k <= 0)																		// В случае повторного вызова функции значение переменной будет уже таким же, что при последней работе этой функции. 
	{																				// После очередного запуска программы, значение примет исходное значение, которое было при первоначально вызове функции;	
		printf("итерация цикла: %d \n", count);
		printf("subtotal: %d; total: %d \n", subtotal, total);
		subtotal = 0;
	}
	else
	{
		subtotal += k;
		total += k;
	}
}
*/

/*
int roll_count = 0;															// Внешняя переменная (глобальная), к которой имеют доступ другие файлы программы;

static int rollem(int sides);												// Функция только для внутренней связи, другие файла программы не имеют доступа к ней;

int rollem(int sides)
{
	int roll;
	roll = rand() % sides + 1;												// + 1 для того чтобы число было не от 0 до 5, а от 1 до 6. Функция rand() определена в бибилотеке stdlib.h, предназначена для вывода случайных. Так как делим число на 6 остаток будет от 0 до 5.
	++roll_count;															// В файле Memory management функция srand получает сгенерированное случайное значение, функция rand() берет это значение;
	return roll;															// Подсчет вызовов функции;
}


int roll_n_dice(int dice, int sides)										// Прототип функции содержится в локальной библиотеке diceroll.h. При компиляции эта библиотека подключается к программе;
{
	int d;
	int total = 0;
	if (sides < 2)															// В случае, если будет введено значение меньше 2, т.е. меньше 2 граней (сторон), функция вернет значение -2;
	{
		printf("Требуются, по меньшей мере, 2 грани. \n");
		return -2;
	}
	if (dice < 1)															// В случае, если будет введено значение меньше 1, т.е. меньше 1 кости, функция вернет значение -1; 
	{
		printf("Требуются, по меньшей мере, 1 кость. \n");
		return -1;
	}
	for (d = 0; d < dice; d++)												// Сколько введено костей, столько циклов;
		total += rollem(sides);												// В цикле будет вызвана функция rollem, которая принимает количество сторон, затем функция rollem возвращает число (случайное), результат функции rollem складывается с переменной total.
	return total;															// Функция roll_n_dice вернет сумму значений сторон (side);
}
*/

